Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_gfxmmu.h
/*
 * SPDX-License-Identifier: MIT
 *
 * Goal:     stm32V873_gfxmmu equates.
 */
#pragma once

#include    <stdint.h>

// GFXMMU address definitions
// --------------------------

typedef struct {
    volatile    uint32_t    CR;
    volatile    uint32_t    SR;
    volatile    uint32_t    FCR;
    volatile    uint32_t    RESERVED0;
    volatile    uint32_t    DVR;
    volatile    uint32_t    DAR;
    volatile    uint32_t    RESERVED1[2];
    volatile    uint32_t    B0CR;
    volatile    uint32_t    B1CR;
    volatile    uint32_t    B2CR;
    volatile    uint32_t    B3CR;
    volatile    uint32_t    RESERVED2[4];
    volatile    uint32_t    SECCFGR;
    volatile    uint32_t    PRIVCFGR;
    volatile    uint32_t    RCFGLOCKR;
    volatile    uint32_t    PUBCFGR;
    volatile    uint32_t    RESERVED3[1004];
    volatile    uint32_t    LUT0L;
    volatile    uint32_t    LUT0H;
    volatile    uint32_t    LUT1L;
    volatile    uint32_t    LUT1H;
    volatile    uint32_t    LUT2L;
    volatile    uint32_t    LUT2H;
    volatile    uint32_t    LUT3L;
    volatile    uint32_t    LUT3H;
    volatile    uint32_t    LUT4L;
    volatile    uint32_t    LUT4H;
    volatile    uint32_t    LUT5L;
    volatile    uint32_t    LUT5H;
    volatile    uint32_t    LUT6L;
    volatile    uint32_t    LUT6H;
    volatile    uint32_t    LUT7L;
    volatile    uint32_t    LUT7H;
    volatile    uint32_t    LUT8L;
    volatile    uint32_t    LUT8H;
    volatile    uint32_t    LUT9L;
    volatile    uint32_t    LUT9H;
    volatile    uint32_t    LUT10L;
    volatile    uint32_t    LUT10H;
    volatile    uint32_t    LUT11L;
    volatile    uint32_t    LUT11H;
    volatile    uint32_t    LUT12L;
    volatile    uint32_t    LUT12H;
    volatile    uint32_t    LUT13L;
    volatile    uint32_t    LUT13H;
    volatile    uint32_t    LUT14L;
    volatile    uint32_t    LUT14H;
    volatile    uint32_t    LUT15L;
    volatile    uint32_t    LUT15H;
    volatile    uint32_t    LUT16L;
    volatile    uint32_t    LUT16H;
    volatile    uint32_t    LUT17L;
    volatile    uint32_t    LUT17H;
    volatile    uint32_t    LUT18L;
    volatile    uint32_t    LUT18H;
    volatile    uint32_t    LUT19L;
    volatile    uint32_t    LUT19H;
    volatile    uint32_t    LUT20L;
    volatile    uint32_t    LUT20H;
    volatile    uint32_t    LUT21L;
    volatile    uint32_t    LUT21H;
    volatile    uint32_t    LUT22L;
    volatile    uint32_t    LUT22H;
    volatile    uint32_t    LUT23L;
    volatile    uint32_t    LUT23H;
    volatile    uint32_t    LUT24L;
    volatile    uint32_t    LUT24H;
    volatile    uint32_t    LUT25L;
    volatile    uint32_t    LUT25H;
    volatile    uint32_t    LUT26L;
    volatile    uint32_t    LUT26H;
    volatile    uint32_t    LUT27L;
    volatile    uint32_t    LUT27H;
    volatile    uint32_t    LUT28L;
    volatile    uint32_t    LUT28H;
    volatile    uint32_t    LUT29L;
    volatile    uint32_t    LUT29H;
    volatile    uint32_t    LUT30L;
    volatile    uint32_t    LUT30H;
    volatile    uint32_t    LUT31L;
    volatile    uint32_t    LUT31H;
    volatile    uint32_t    LUT32L;
    volatile    uint32_t    LUT32H;
    volatile    uint32_t    LUT33L;
    volatile    uint32_t    LUT33H;
    volatile    uint32_t    LUT34L;
    volatile    uint32_t    LUT34H;
    volatile    uint32_t    LUT35L;
    volatile    uint32_t    LUT35H;
    volatile    uint32_t    LUT36L;
    volatile    uint32_t    LUT36H;
    volatile    uint32_t    LUT37L;
    volatile    uint32_t    LUT37H;
    volatile    uint32_t    LUT38L;
    volatile    uint32_t    LUT38H;
    volatile    uint32_t    LUT39L;
    volatile    uint32_t    LUT39H;
    volatile    uint32_t    LUT40L;
    volatile    uint32_t    LUT40H;
    volatile    uint32_t    LUT41L;
    volatile    uint32_t    LUT41H;
    volatile    uint32_t    LUT42L;
    volatile    uint32_t    LUT42H;
    volatile    uint32_t    LUT43L;
    volatile    uint32_t    LUT43H;
    volatile    uint32_t    LUT44L;
    volatile    uint32_t    LUT44H;
    volatile    uint32_t    LUT45L;
    volatile    uint32_t    LUT45H;
    volatile    uint32_t    LUT46L;
    volatile    uint32_t    LUT46H;
    volatile    uint32_t    LUT47L;
    volatile    uint32_t    LUT47H;
    volatile    uint32_t    LUT48L;
    volatile    uint32_t    LUT48H;
    volatile    uint32_t    LUT49L;
    volatile    uint32_t    LUT49H;
    volatile    uint32_t    LUT50L;
    volatile    uint32_t    LUT50H;
    volatile    uint32_t    LUT51L;
    volatile    uint32_t    LUT51H;
    volatile    uint32_t    LUT52L;
    volatile    uint32_t    LUT52H;
    volatile    uint32_t    LUT53L;
    volatile    uint32_t    LUT53H;
    volatile    uint32_t    LUT54L;
    volatile    uint32_t    LUT54H;
    volatile    uint32_t    LUT55L;
    volatile    uint32_t    LUT55H;
    volatile    uint32_t    LUT56L;
    volatile    uint32_t    LUT56H;
    volatile    uint32_t    LUT57L;
    volatile    uint32_t    LUT57H;
    volatile    uint32_t    LUT58L;
    volatile    uint32_t    LUT58H;
    volatile    uint32_t    LUT59L;
    volatile    uint32_t    LUT59H;
    volatile    uint32_t    LUT60L;
    volatile    uint32_t    LUT60H;
    volatile    uint32_t    LUT61L;
    volatile    uint32_t    LUT61H;
    volatile    uint32_t    LUT62L;
    volatile    uint32_t    LUT62H;
    volatile    uint32_t    LUT63L;
    volatile    uint32_t    LUT63H;
    volatile    uint32_t    LUT64L;
    volatile    uint32_t    LUT64H;
    volatile    uint32_t    LUT65L;
    volatile    uint32_t    LUT65H;
    volatile    uint32_t    LUT66L;
    volatile    uint32_t    LUT66H;
    volatile    uint32_t    LUT67L;
    volatile    uint32_t    LUT67H;
    volatile    uint32_t    LUT68L;
    volatile    uint32_t    LUT68H;
    volatile    uint32_t    LUT69L;
    volatile    uint32_t    LUT69H;
    volatile    uint32_t    LUT70L;
    volatile    uint32_t    LUT70H;
    volatile    uint32_t    LUT71L;
    volatile    uint32_t    LUT71H;
    volatile    uint32_t    LUT72L;
    volatile    uint32_t    LUT72H;
    volatile    uint32_t    LUT73L;
    volatile    uint32_t    LUT73H;
    volatile    uint32_t    LUT74L;
    volatile    uint32_t    LUT74H;
    volatile    uint32_t    LUT75L;
    volatile    uint32_t    LUT75H;
    volatile    uint32_t    LUT76L;
    volatile    uint32_t    LUT76H;
    volatile    uint32_t    LUT77L;
    volatile    uint32_t    LUT77H;
    volatile    uint32_t    LUT78L;
    volatile    uint32_t    LUT78H;
    volatile    uint32_t    LUT79L;
    volatile    uint32_t    LUT79H;
    volatile    uint32_t    LUT80L;
    volatile    uint32_t    LUT80H;
    volatile    uint32_t    LUT81L;
    volatile    uint32_t    LUT81H;
    volatile    uint32_t    LUT82L;
    volatile    uint32_t    LUT82H;
    volatile    uint32_t    LUT83L;
    volatile    uint32_t    LUT83H;
    volatile    uint32_t    LUT84L;
    volatile    uint32_t    LUT84H;
    volatile    uint32_t    LUT85L;
    volatile    uint32_t    LUT85H;
    volatile    uint32_t    LUT86L;
    volatile    uint32_t    LUT86H;
    volatile    uint32_t    LUT87L;
    volatile    uint32_t    LUT87H;
    volatile    uint32_t    LUT88L;
    volatile    uint32_t    LUT88H;
    volatile    uint32_t    LUT89L;
    volatile    uint32_t    LUT89H;
    volatile    uint32_t    LUT90L;
    volatile    uint32_t    LUT90H;
    volatile    uint32_t    LUT91L;
    volatile    uint32_t    LUT91H;
    volatile    uint32_t    LUT92L;
    volatile    uint32_t    LUT92H;
    volatile    uint32_t    LUT93L;
    volatile    uint32_t    LUT93H;
    volatile    uint32_t    LUT94L;
    volatile    uint32_t    LUT94H;
    volatile    uint32_t    LUT95L;
    volatile    uint32_t    LUT95H;
    volatile    uint32_t    LUT96L;
    volatile    uint32_t    LUT96H;
    volatile    uint32_t    LUT97L;
    volatile    uint32_t    LUT97H;
    volatile    uint32_t    LUT98L;
    volatile    uint32_t    LUT98H;
    volatile    uint32_t    LUT99L;
    volatile    uint32_t    LUT99H;
    volatile    uint32_t    LUT100L;
    volatile    uint32_t    LUT100H;
    volatile    uint32_t    LUT101L;
    volatile    uint32_t    LUT101H;
    volatile    uint32_t    LUT102L;
    volatile    uint32_t    LUT102H;
    volatile    uint32_t    LUT103L;
    volatile    uint32_t    LUT103H;
    volatile    uint32_t    LUT104L;
    volatile    uint32_t    LUT104H;
    volatile    uint32_t    LUT105L;
    volatile    uint32_t    LUT105H;
    volatile    uint32_t    LUT106L;
    volatile    uint32_t    LUT106H;
    volatile    uint32_t    LUT107L;
    volatile    uint32_t    LUT107H;
    volatile    uint32_t    LUT108L;
    volatile    uint32_t    LUT108H;
    volatile    uint32_t    LUT109L;
    volatile    uint32_t    LUT109H;
    volatile    uint32_t    LUT110L;
    volatile    uint32_t    LUT110H;
    volatile    uint32_t    LUT111L;
    volatile    uint32_t    LUT111H;
    volatile    uint32_t    LUT112L;
    volatile    uint32_t    LUT112H;
    volatile    uint32_t    LUT113L;
    volatile    uint32_t    LUT113H;
    volatile    uint32_t    LUT114L;
    volatile    uint32_t    LUT114H;
    volatile    uint32_t    LUT115L;
    volatile    uint32_t    LUT115H;
    volatile    uint32_t    LUT116L;
    volatile    uint32_t    LUT116H;
    volatile    uint32_t    LUT117L;
    volatile    uint32_t    LUT117H;
    volatile    uint32_t    LUT118L;
    volatile    uint32_t    LUT118H;
    volatile    uint32_t    LUT119L;
    volatile    uint32_t    LUT119H;
    volatile    uint32_t    LUT120L;
    volatile    uint32_t    LUT120H;
    volatile    uint32_t    LUT121L;
    volatile    uint32_t    LUT121H;
    volatile    uint32_t    LUT122L;
    volatile    uint32_t    LUT122H;
    volatile    uint32_t    LUT123L;
    volatile    uint32_t    LUT123H;
    volatile    uint32_t    LUT124L;
    volatile    uint32_t    LUT124H;
    volatile    uint32_t    LUT125L;
    volatile    uint32_t    LUT125H;
    volatile    uint32_t    LUT126L;
    volatile    uint32_t    LUT126H;
    volatile    uint32_t    LUT127L;
    volatile    uint32_t    LUT127H;
    volatile    uint32_t    LUT128L;
    volatile    uint32_t    LUT128H;
    volatile    uint32_t    LUT129L;
    volatile    uint32_t    LUT129H;
    volatile    uint32_t    LUT130L;
    volatile    uint32_t    LUT130H;
    volatile    uint32_t    LUT131L;
    volatile    uint32_t    LUT131H;
    volatile    uint32_t    LUT132L;
    volatile    uint32_t    LUT132H;
    volatile    uint32_t    LUT133L;
    volatile    uint32_t    LUT133H;
    volatile    uint32_t    LUT134L;
    volatile    uint32_t    LUT134H;
    volatile    uint32_t    LUT135L;
    volatile    uint32_t    LUT135H;
    volatile    uint32_t    LUT136L;
    volatile    uint32_t    LUT136H;
    volatile    uint32_t    LUT137L;
    volatile    uint32_t    LUT137H;
    volatile    uint32_t    LUT138L;
    volatile    uint32_t    LUT138H;
    volatile    uint32_t    LUT139L;
    volatile    uint32_t    LUT139H;
    volatile    uint32_t    LUT140L;
    volatile    uint32_t    LUT140H;
    volatile    uint32_t    LUT141L;
    volatile    uint32_t    LUT141H;
    volatile    uint32_t    LUT142L;
    volatile    uint32_t    LUT142H;
    volatile    uint32_t    LUT143L;
    volatile    uint32_t    LUT143H;
    volatile    uint32_t    LUT144L;
    volatile    uint32_t    LUT144H;
    volatile    uint32_t    LUT145L;
    volatile    uint32_t    LUT145H;
    volatile    uint32_t    LUT146L;
    volatile    uint32_t    LUT146H;
    volatile    uint32_t    LUT147L;
    volatile    uint32_t    LUT147H;
    volatile    uint32_t    LUT148L;
    volatile    uint32_t    LUT148H;
    volatile    uint32_t    LUT149L;
    volatile    uint32_t    LUT149H;
    volatile    uint32_t    LUT150L;
    volatile    uint32_t    LUT150H;
    volatile    uint32_t    LUT151L;
    volatile    uint32_t    LUT151H;
    volatile    uint32_t    LUT152L;
    volatile    uint32_t    LUT152H;
    volatile    uint32_t    LUT153L;
    volatile    uint32_t    LUT153H;
    volatile    uint32_t    LUT154L;
    volatile    uint32_t    LUT154H;
    volatile    uint32_t    LUT155L;
    volatile    uint32_t    LUT155H;
    volatile    uint32_t    LUT156L;
    volatile    uint32_t    LUT156H;
    volatile    uint32_t    LUT157L;
    volatile    uint32_t    LUT157H;
    volatile    uint32_t    LUT158L;
    volatile    uint32_t    LUT158H;
    volatile    uint32_t    LUT159L;
    volatile    uint32_t    LUT159H;
    volatile    uint32_t    LUT160L;
    volatile    uint32_t    LUT160H;
    volatile    uint32_t    LUT161L;
    volatile    uint32_t    LUT161H;
    volatile    uint32_t    LUT162L;
    volatile    uint32_t    LUT162H;
    volatile    uint32_t    LUT163L;
    volatile    uint32_t    LUT163H;
    volatile    uint32_t    LUT164L;
    volatile    uint32_t    LUT164H;
    volatile    uint32_t    LUT165L;
    volatile    uint32_t    LUT165H;
    volatile    uint32_t    LUT166L;
    volatile    uint32_t    LUT166H;
    volatile    uint32_t    LUT167L;
    volatile    uint32_t    LUT167H;
    volatile    uint32_t    LUT168L;
    volatile    uint32_t    LUT168H;
    volatile    uint32_t    LUT169L;
    volatile    uint32_t    LUT169H;
    volatile    uint32_t    LUT170L;
    volatile    uint32_t    LUT170H;
    volatile    uint32_t    LUT171L;
    volatile    uint32_t    LUT171H;
    volatile    uint32_t    LUT172L;
    volatile    uint32_t    LUT172H;
    volatile    uint32_t    LUT173L;
    volatile    uint32_t    LUT173H;
    volatile    uint32_t    LUT174L;
    volatile    uint32_t    LUT174H;
    volatile    uint32_t    LUT175L;
    volatile    uint32_t    LUT175H;
    volatile    uint32_t    LUT176L;
    volatile    uint32_t    LUT176H;
    volatile    uint32_t    LUT177L;
    volatile    uint32_t    LUT177H;
    volatile    uint32_t    LUT178L;
    volatile    uint32_t    LUT178H;
    volatile    uint32_t    LUT179L;
    volatile    uint32_t    LUT179H;
    volatile    uint32_t    LUT180L;
    volatile    uint32_t    LUT180H;
    volatile    uint32_t    LUT181L;
    volatile    uint32_t    LUT181H;
    volatile    uint32_t    LUT182L;
    volatile    uint32_t    LUT182H;
    volatile    uint32_t    LUT183L;
    volatile    uint32_t    LUT183H;
    volatile    uint32_t    LUT184L;
    volatile    uint32_t    LUT184H;
    volatile    uint32_t    LUT185L;
    volatile    uint32_t    LUT185H;
    volatile    uint32_t    LUT186L;
    volatile    uint32_t    LUT186H;
    volatile    uint32_t    LUT187L;
    volatile    uint32_t    LUT187H;
    volatile    uint32_t    LUT188L;
    volatile    uint32_t    LUT188H;
    volatile    uint32_t    LUT189L;
    volatile    uint32_t    LUT189H;
    volatile    uint32_t    LUT190L;
    volatile    uint32_t    LUT190H;
    volatile    uint32_t    LUT191L;
    volatile    uint32_t    LUT191H;
    volatile    uint32_t    LUT192L;
    volatile    uint32_t    LUT192H;
    volatile    uint32_t    LUT193L;
    volatile    uint32_t    LUT193H;
    volatile    uint32_t    LUT194L;
    volatile    uint32_t    LUT194H;
    volatile    uint32_t    LUT195L;
    volatile    uint32_t    LUT195H;
    volatile    uint32_t    LUT196L;
    volatile    uint32_t    LUT196H;
    volatile    uint32_t    LUT197L;
    volatile    uint32_t    LUT197H;
    volatile    uint32_t    LUT198L;
    volatile    uint32_t    LUT198H;
    volatile    uint32_t    LUT199L;
    volatile    uint32_t    LUT199H;
    volatile    uint32_t    LUT200L;
    volatile    uint32_t    LUT200H;
    volatile    uint32_t    LUT201L;
    volatile    uint32_t    LUT201H;
    volatile    uint32_t    LUT202L;
    volatile    uint32_t    LUT202H;
    volatile    uint32_t    LUT203L;
    volatile    uint32_t    LUT203H;
    volatile    uint32_t    LUT204L;
    volatile    uint32_t    LUT204H;
    volatile    uint32_t    LUT205L;
    volatile    uint32_t    LUT205H;
    volatile    uint32_t    LUT206L;
    volatile    uint32_t    LUT206H;
    volatile    uint32_t    LUT207L;
    volatile    uint32_t    LUT207H;
    volatile    uint32_t    LUT208L;
    volatile    uint32_t    LUT208H;
    volatile    uint32_t    LUT209L;
    volatile    uint32_t    LUT209H;
    volatile    uint32_t    LUT210L;
    volatile    uint32_t    LUT210H;
    volatile    uint32_t    LUT211L;
    volatile    uint32_t    LUT211H;
    volatile    uint32_t    LUT212L;
    volatile    uint32_t    LUT212H;
    volatile    uint32_t    LUT213L;
    volatile    uint32_t    LUT213H;
    volatile    uint32_t    LUT214L;
    volatile    uint32_t    LUT214H;
    volatile    uint32_t    LUT215L;
    volatile    uint32_t    LUT215H;
    volatile    uint32_t    LUT216L;
    volatile    uint32_t    LUT216H;
    volatile    uint32_t    LUT217L;
    volatile    uint32_t    LUT217H;
    volatile    uint32_t    LUT218L;
    volatile    uint32_t    LUT218H;
    volatile    uint32_t    LUT219L;
    volatile    uint32_t    LUT219H;
    volatile    uint32_t    LUT220L;
    volatile    uint32_t    LUT220H;
    volatile    uint32_t    LUT221L;
    volatile    uint32_t    LUT221H;
    volatile    uint32_t    LUT222L;
    volatile    uint32_t    LUT222H;
    volatile    uint32_t    LUT223L;
    volatile    uint32_t    LUT223H;
    volatile    uint32_t    LUT224L;
    volatile    uint32_t    LUT224H;
    volatile    uint32_t    LUT225L;
    volatile    uint32_t    LUT225H;
    volatile    uint32_t    LUT226L;
    volatile    uint32_t    LUT226H;
    volatile    uint32_t    LUT227L;
    volatile    uint32_t    LUT227H;
    volatile    uint32_t    LUT228L;
    volatile    uint32_t    LUT228H;
    volatile    uint32_t    LUT229L;
    volatile    uint32_t    LUT229H;
    volatile    uint32_t    LUT230L;
    volatile    uint32_t    LUT230H;
    volatile    uint32_t    LUT231L;
    volatile    uint32_t    LUT231H;
    volatile    uint32_t    LUT232L;
    volatile    uint32_t    LUT232H;
    volatile    uint32_t    LUT233L;
    volatile    uint32_t    LUT233H;
    volatile    uint32_t    LUT234L;
    volatile    uint32_t    LUT234H;
    volatile    uint32_t    LUT235L;
    volatile    uint32_t    LUT235H;
    volatile    uint32_t    LUT236L;
    volatile    uint32_t    LUT236H;
    volatile    uint32_t    LUT237L;
    volatile    uint32_t    LUT237H;
    volatile    uint32_t    LUT238L;
    volatile    uint32_t    LUT238H;
    volatile    uint32_t    LUT239L;
    volatile    uint32_t    LUT239H;
    volatile    uint32_t    LUT240L;
    volatile    uint32_t    LUT240H;
    volatile    uint32_t    LUT241L;
    volatile    uint32_t    LUT241H;
    volatile    uint32_t    LUT242L;
    volatile    uint32_t    LUT242H;
    volatile    uint32_t    LUT243L;
    volatile    uint32_t    LUT243H;
    volatile    uint32_t    LUT244L;
    volatile    uint32_t    LUT244H;
    volatile    uint32_t    LUT245L;
    volatile    uint32_t    LUT245H;
    volatile    uint32_t    LUT246L;
    volatile    uint32_t    LUT246H;
    volatile    uint32_t    LUT247L;
    volatile    uint32_t    LUT247H;
    volatile    uint32_t    LUT248L;
    volatile    uint32_t    LUT248H;
    volatile    uint32_t    LUT249L;
    volatile    uint32_t    LUT249H;
    volatile    uint32_t    LUT250L;
    volatile    uint32_t    LUT250H;
    volatile    uint32_t    LUT251L;
    volatile    uint32_t    LUT251H;
    volatile    uint32_t    LUT252L;
    volatile    uint32_t    LUT252H;
    volatile    uint32_t    LUT253L;
    volatile    uint32_t    LUT253H;
    volatile    uint32_t    LUT254L;
    volatile    uint32_t    LUT254H;
    volatile    uint32_t    LUT255L;
    volatile    uint32_t    LUT255H;
    volatile    uint32_t    LUT256L;
    volatile    uint32_t    LUT256H;
    volatile    uint32_t    LUT257L;
    volatile    uint32_t    LUT257H;
    volatile    uint32_t    LUT258L;
    volatile    uint32_t    LUT258H;
    volatile    uint32_t    LUT259L;
    volatile    uint32_t    LUT259H;
    volatile    uint32_t    LUT260L;
    volatile    uint32_t    LUT260H;
    volatile    uint32_t    LUT261L;
    volatile    uint32_t    LUT261H;
    volatile    uint32_t    LUT262L;
    volatile    uint32_t    LUT262H;
    volatile    uint32_t    LUT263L;
    volatile    uint32_t    LUT263H;
    volatile    uint32_t    LUT264L;
    volatile    uint32_t    LUT264H;
    volatile    uint32_t    LUT265L;
    volatile    uint32_t    LUT265H;
    volatile    uint32_t    LUT266L;
    volatile    uint32_t    LUT266H;
    volatile    uint32_t    LUT267L;
    volatile    uint32_t    LUT267H;
    volatile    uint32_t    LUT268L;
    volatile    uint32_t    LUT268H;
    volatile    uint32_t    LUT269L;
    volatile    uint32_t    LUT269H;
    volatile    uint32_t    LUT270L;
    volatile    uint32_t    LUT270H;
    volatile    uint32_t    LUT271L;
    volatile    uint32_t    LUT271H;
    volatile    uint32_t    LUT272L;
    volatile    uint32_t    LUT272H;
    volatile    uint32_t    LUT273L;
    volatile    uint32_t    LUT273H;
    volatile    uint32_t    LUT274L;
    volatile    uint32_t    LUT274H;
    volatile    uint32_t    LUT275L;
    volatile    uint32_t    LUT275H;
    volatile    uint32_t    LUT276L;
    volatile    uint32_t    LUT276H;
    volatile    uint32_t    LUT277L;
    volatile    uint32_t    LUT277H;
    volatile    uint32_t    LUT278L;
    volatile    uint32_t    LUT278H;
    volatile    uint32_t    LUT279L;
    volatile    uint32_t    LUT279H;
    volatile    uint32_t    LUT280L;
    volatile    uint32_t    LUT280H;
    volatile    uint32_t    LUT281L;
    volatile    uint32_t    LUT281H;
    volatile    uint32_t    LUT282L;
    volatile    uint32_t    LUT282H;
    volatile    uint32_t    LUT283L;
    volatile    uint32_t    LUT283H;
    volatile    uint32_t    LUT284L;
    volatile    uint32_t    LUT284H;
    volatile    uint32_t    LUT285L;
    volatile    uint32_t    LUT285H;
    volatile    uint32_t    LUT286L;
    volatile    uint32_t    LUT286H;
    volatile    uint32_t    LUT287L;
    volatile    uint32_t    LUT287H;
    volatile    uint32_t    LUT288L;
    volatile    uint32_t    LUT288H;
    volatile    uint32_t    LUT289L;
    volatile    uint32_t    LUT289H;
    volatile    uint32_t    LUT290L;
    volatile    uint32_t    LUT290H;
    volatile    uint32_t    LUT291L;
    volatile    uint32_t    LUT291H;
    volatile    uint32_t    LUT292L;
    volatile    uint32_t    LUT292H;
    volatile    uint32_t    LUT293L;
    volatile    uint32_t    LUT293H;
    volatile    uint32_t    LUT294L;
    volatile    uint32_t    LUT294H;
    volatile    uint32_t    LUT295L;
    volatile    uint32_t    LUT295H;
    volatile    uint32_t    LUT296L;
    volatile    uint32_t    LUT296H;
    volatile    uint32_t    LUT297L;
    volatile    uint32_t    LUT297H;
    volatile    uint32_t    LUT298L;
    volatile    uint32_t    LUT298H;
    volatile    uint32_t    LUT299L;
    volatile    uint32_t    LUT299H;
    volatile    uint32_t    LUT300L;
    volatile    uint32_t    LUT300H;
    volatile    uint32_t    LUT301L;
    volatile    uint32_t    LUT301H;
    volatile    uint32_t    LUT302L;
    volatile    uint32_t    LUT302H;
    volatile    uint32_t    LUT303L;
    volatile    uint32_t    LUT303H;
    volatile    uint32_t    LUT304L;
    volatile    uint32_t    LUT304H;
    volatile    uint32_t    LUT305L;
    volatile    uint32_t    LUT305H;
    volatile    uint32_t    LUT306L;
    volatile    uint32_t    LUT306H;
    volatile    uint32_t    LUT307L;
    volatile    uint32_t    LUT307H;
    volatile    uint32_t    LUT308L;
    volatile    uint32_t    LUT308H;
    volatile    uint32_t    LUT309L;
    volatile    uint32_t    LUT309H;
    volatile    uint32_t    LUT310L;
    volatile    uint32_t    LUT310H;
    volatile    uint32_t    LUT311L;
    volatile    uint32_t    LUT311H;
    volatile    uint32_t    LUT312L;
    volatile    uint32_t    LUT312H;
    volatile    uint32_t    LUT313L;
    volatile    uint32_t    LUT313H;
    volatile    uint32_t    LUT314L;
    volatile    uint32_t    LUT314H;
    volatile    uint32_t    LUT315L;
    volatile    uint32_t    LUT315H;
