Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_gfxmmu.h
    volatile    uint32_t    LUT640L;
    volatile    uint32_t    LUT640H;
    volatile    uint32_t    LUT641L;
    volatile    uint32_t    LUT641H;
    volatile    uint32_t    LUT642L;
    volatile    uint32_t    LUT642H;
    volatile    uint32_t    LUT643L;
    volatile    uint32_t    LUT643H;
    volatile    uint32_t    LUT644L;
    volatile    uint32_t    LUT644H;
    volatile    uint32_t    LUT645L;
    volatile    uint32_t    LUT645H;
    volatile    uint32_t    LUT646L;
    volatile    uint32_t    LUT646H;
    volatile    uint32_t    LUT647L;
    volatile    uint32_t    LUT647H;
    volatile    uint32_t    LUT648L;
    volatile    uint32_t    LUT648H;
    volatile    uint32_t    LUT649L;
    volatile    uint32_t    LUT649H;
    volatile    uint32_t    LUT650L;
    volatile    uint32_t    LUT650H;
    volatile    uint32_t    LUT651L;
    volatile    uint32_t    LUT651H;
    volatile    uint32_t    LUT652L;
    volatile    uint32_t    LUT652H;
    volatile    uint32_t    LUT653L;
    volatile    uint32_t    LUT653H;
    volatile    uint32_t    LUT654L;
    volatile    uint32_t    LUT654H;
    volatile    uint32_t    LUT655L;
    volatile    uint32_t    LUT655H;
    volatile    uint32_t    LUT656L;
    volatile    uint32_t    LUT656H;
    volatile    uint32_t    LUT657L;
    volatile    uint32_t    LUT657H;
    volatile    uint32_t    LUT658L;
    volatile    uint32_t    LUT658H;
    volatile    uint32_t    LUT659L;
    volatile    uint32_t    LUT659H;
    volatile    uint32_t    LUT660L;
    volatile    uint32_t    LUT660H;
    volatile    uint32_t    LUT661L;
    volatile    uint32_t    LUT661H;
    volatile    uint32_t    LUT662L;
    volatile    uint32_t    LUT662H;
    volatile    uint32_t    LUT663L;
    volatile    uint32_t    LUT663H;
    volatile    uint32_t    LUT664L;
    volatile    uint32_t    LUT664H;
    volatile    uint32_t    LUT665L;
    volatile    uint32_t    LUT665H;
    volatile    uint32_t    LUT666L;
    volatile    uint32_t    LUT666H;
    volatile    uint32_t    LUT667L;
    volatile    uint32_t    LUT667H;
    volatile    uint32_t    LUT668L;
    volatile    uint32_t    LUT668H;
    volatile    uint32_t    LUT669L;
    volatile    uint32_t    LUT669H;
    volatile    uint32_t    LUT670L;
    volatile    uint32_t    LUT670H;
    volatile    uint32_t    LUT671L;
    volatile    uint32_t    LUT671H;
    volatile    uint32_t    LUT672L;
    volatile    uint32_t    LUT672H;
    volatile    uint32_t    LUT673L;
    volatile    uint32_t    LUT673H;
    volatile    uint32_t    LUT674L;
    volatile    uint32_t    LUT674H;
    volatile    uint32_t    LUT675L;
    volatile    uint32_t    LUT675H;
    volatile    uint32_t    LUT676L;
    volatile    uint32_t    LUT676H;
    volatile    uint32_t    LUT677L;
    volatile    uint32_t    LUT677H;
    volatile    uint32_t    LUT678L;
    volatile    uint32_t    LUT678H;
    volatile    uint32_t    LUT679L;
    volatile    uint32_t    LUT679H;
    volatile    uint32_t    LUT680L;
    volatile    uint32_t    LUT680H;
    volatile    uint32_t    LUT681L;
    volatile    uint32_t    LUT681H;
    volatile    uint32_t    LUT682L;
    volatile    uint32_t    LUT682H;
    volatile    uint32_t    LUT683L;
    volatile    uint32_t    LUT683H;
    volatile    uint32_t    LUT684L;
    volatile    uint32_t    LUT684H;
    volatile    uint32_t    LUT685L;
    volatile    uint32_t    LUT685H;
    volatile    uint32_t    LUT686L;
    volatile    uint32_t    LUT686H;
    volatile    uint32_t    LUT687L;
    volatile    uint32_t    LUT687H;
    volatile    uint32_t    LUT688L;
    volatile    uint32_t    LUT688H;
    volatile    uint32_t    LUT689L;
    volatile    uint32_t    LUT689H;
    volatile    uint32_t    LUT690L;
    volatile    uint32_t    LUT690H;
    volatile    uint32_t    LUT691L;
    volatile    uint32_t    LUT691H;
    volatile    uint32_t    LUT692L;
    volatile    uint32_t    LUT692H;
    volatile    uint32_t    LUT693L;
    volatile    uint32_t    LUT693H;
    volatile    uint32_t    LUT694L;
    volatile    uint32_t    LUT694H;
    volatile    uint32_t    LUT695L;
    volatile    uint32_t    LUT695H;
    volatile    uint32_t    LUT696L;
    volatile    uint32_t    LUT696H;
    volatile    uint32_t    LUT697L;
    volatile    uint32_t    LUT697H;
    volatile    uint32_t    LUT698L;
    volatile    uint32_t    LUT698H;
    volatile    uint32_t    LUT699L;
    volatile    uint32_t    LUT699H;
    volatile    uint32_t    LUT700L;
    volatile    uint32_t    LUT700H;
    volatile    uint32_t    LUT701L;
    volatile    uint32_t    LUT701H;
    volatile    uint32_t    LUT702L;
    volatile    uint32_t    LUT702H;
    volatile    uint32_t    LUT703L;
    volatile    uint32_t    LUT703H;
    volatile    uint32_t    LUT704L;
    volatile    uint32_t    LUT704H;
    volatile    uint32_t    LUT705L;
    volatile    uint32_t    LUT705H;
    volatile    uint32_t    LUT706L;
    volatile    uint32_t    LUT706H;
    volatile    uint32_t    LUT707L;
    volatile    uint32_t    LUT707H;
    volatile    uint32_t    LUT708L;
    volatile    uint32_t    LUT708H;
    volatile    uint32_t    LUT709L;
    volatile    uint32_t    LUT709H;
    volatile    uint32_t    LUT710L;
    volatile    uint32_t    LUT710H;
    volatile    uint32_t    LUT711L;
    volatile    uint32_t    LUT711H;
    volatile    uint32_t    LUT712L;
    volatile    uint32_t    LUT712H;
    volatile    uint32_t    LUT713L;
    volatile    uint32_t    LUT713H;
    volatile    uint32_t    LUT714L;
    volatile    uint32_t    LUT714H;
    volatile    uint32_t    LUT715L;
    volatile    uint32_t    LUT715H;
    volatile    uint32_t    LUT716L;
    volatile    uint32_t    LUT716H;
    volatile    uint32_t    LUT717L;
    volatile    uint32_t    LUT717H;
    volatile    uint32_t    LUT718L;
    volatile    uint32_t    LUT718H;
    volatile    uint32_t    LUT719L;
    volatile    uint32_t    LUT719H;
    volatile    uint32_t    LUT720L;
    volatile    uint32_t    LUT720H;
    volatile    uint32_t    LUT721L;
    volatile    uint32_t    LUT721H;
    volatile    uint32_t    LUT722L;
    volatile    uint32_t    LUT722H;
    volatile    uint32_t    LUT723L;
    volatile    uint32_t    LUT723H;
    volatile    uint32_t    LUT724L;
    volatile    uint32_t    LUT724H;
    volatile    uint32_t    LUT725L;
    volatile    uint32_t    LUT725H;
    volatile    uint32_t    LUT726L;
    volatile    uint32_t    LUT726H;
    volatile    uint32_t    LUT727L;
    volatile    uint32_t    LUT727H;
    volatile    uint32_t    LUT728L;
    volatile    uint32_t    LUT728H;
    volatile    uint32_t    LUT729L;
    volatile    uint32_t    LUT729H;
    volatile    uint32_t    LUT730L;
    volatile    uint32_t    LUT730H;
    volatile    uint32_t    LUT731L;
    volatile    uint32_t    LUT731H;
    volatile    uint32_t    LUT732L;
    volatile    uint32_t    LUT732H;
    volatile    uint32_t    LUT733L;
    volatile    uint32_t    LUT733H;
    volatile    uint32_t    LUT734L;
    volatile    uint32_t    LUT734H;
    volatile    uint32_t    LUT735L;
    volatile    uint32_t    LUT735H;
    volatile    uint32_t    LUT736L;
    volatile    uint32_t    LUT736H;
    volatile    uint32_t    LUT737L;
    volatile    uint32_t    LUT737H;
    volatile    uint32_t    LUT738L;
    volatile    uint32_t    LUT738H;
    volatile    uint32_t    LUT739L;
    volatile    uint32_t    LUT739H;
    volatile    uint32_t    LUT740L;
    volatile    uint32_t    LUT740H;
    volatile    uint32_t    LUT741L;
    volatile    uint32_t    LUT741H;
    volatile    uint32_t    LUT742L;
    volatile    uint32_t    LUT742H;
    volatile    uint32_t    LUT743L;
    volatile    uint32_t    LUT743H;
    volatile    uint32_t    LUT744L;
    volatile    uint32_t    LUT744H;
    volatile    uint32_t    LUT745L;
    volatile    uint32_t    LUT745H;
    volatile    uint32_t    LUT746L;
    volatile    uint32_t    LUT746H;
    volatile    uint32_t    LUT747L;
    volatile    uint32_t    LUT747H;
    volatile    uint32_t    LUT748L;
    volatile    uint32_t    LUT748H;
    volatile    uint32_t    LUT749L;
    volatile    uint32_t    LUT749H;
    volatile    uint32_t    LUT750L;
    volatile    uint32_t    LUT750H;
    volatile    uint32_t    LUT751L;
    volatile    uint32_t    LUT751H;
    volatile    uint32_t    LUT752L;
    volatile    uint32_t    LUT752H;
    volatile    uint32_t    LUT753L;
    volatile    uint32_t    LUT753H;
    volatile    uint32_t    LUT754L;
    volatile    uint32_t    LUT754H;
    volatile    uint32_t    LUT755L;
    volatile    uint32_t    LUT755H;
    volatile    uint32_t    LUT756L;
    volatile    uint32_t    LUT756H;
    volatile    uint32_t    LUT757L;
    volatile    uint32_t    LUT757H;
    volatile    uint32_t    LUT758L;
    volatile    uint32_t    LUT758H;
    volatile    uint32_t    LUT759L;
    volatile    uint32_t    LUT759H;
    volatile    uint32_t    LUT760L;
    volatile    uint32_t    LUT760H;
    volatile    uint32_t    LUT761L;
    volatile    uint32_t    LUT761H;
    volatile    uint32_t    LUT762L;
    volatile    uint32_t    LUT762H;
    volatile    uint32_t    LUT763L;
    volatile    uint32_t    LUT763H;
    volatile    uint32_t    LUT764L;
    volatile    uint32_t    LUT764H;
    volatile    uint32_t    LUT765L;
    volatile    uint32_t    LUT765H;
    volatile    uint32_t    LUT766L;
    volatile    uint32_t    LUT766H;
    volatile    uint32_t    LUT767L;
    volatile    uint32_t    LUT767H;
    volatile    uint32_t    LUT768L;
    volatile    uint32_t    LUT768H;
    volatile    uint32_t    LUT769L;
    volatile    uint32_t    LUT769H;
    volatile    uint32_t    LUT770L;
    volatile    uint32_t    LUT770H;
    volatile    uint32_t    LUT771L;
    volatile    uint32_t    LUT771H;
    volatile    uint32_t    LUT772L;
    volatile    uint32_t    LUT772H;
    volatile    uint32_t    LUT773L;
    volatile    uint32_t    LUT773H;
    volatile    uint32_t    LUT774L;
    volatile    uint32_t    LUT774H;
    volatile    uint32_t    LUT775L;
    volatile    uint32_t    LUT775H;
    volatile    uint32_t    LUT776L;
    volatile    uint32_t    LUT776H;
    volatile    uint32_t    LUT777L;
    volatile    uint32_t    LUT777H;
    volatile    uint32_t    LUT778L;
    volatile    uint32_t    LUT778H;
    volatile    uint32_t    LUT779L;
    volatile    uint32_t    LUT779H;
    volatile    uint32_t    LUT780L;
    volatile    uint32_t    LUT780H;
    volatile    uint32_t    LUT781L;
    volatile    uint32_t    LUT781H;
    volatile    uint32_t    LUT782L;
    volatile    uint32_t    LUT782H;
    volatile    uint32_t    LUT783L;
    volatile    uint32_t    LUT783H;
    volatile    uint32_t    LUT784L;
    volatile    uint32_t    LUT784H;
    volatile    uint32_t    LUT785L;
    volatile    uint32_t    LUT785H;
    volatile    uint32_t    LUT786L;
    volatile    uint32_t    LUT786H;
    volatile    uint32_t    LUT787L;
    volatile    uint32_t    LUT787H;
    volatile    uint32_t    LUT788L;
    volatile    uint32_t    LUT788H;
    volatile    uint32_t    LUT789L;
    volatile    uint32_t    LUT789H;
    volatile    uint32_t    LUT790L;
    volatile    uint32_t    LUT790H;
    volatile    uint32_t    LUT791L;
    volatile    uint32_t    LUT791H;
    volatile    uint32_t    LUT792L;
    volatile    uint32_t    LUT792H;
    volatile    uint32_t    LUT793L;
    volatile    uint32_t    LUT793H;
    volatile    uint32_t    LUT794L;
    volatile    uint32_t    LUT794H;
    volatile    uint32_t    LUT795L;
    volatile    uint32_t    LUT795H;
    volatile    uint32_t    LUT796L;
    volatile    uint32_t    LUT796H;
    volatile    uint32_t    LUT797L;
    volatile    uint32_t    LUT797H;
    volatile    uint32_t    LUT798L;
    volatile    uint32_t    LUT798H;
    volatile    uint32_t    LUT799L;
    volatile    uint32_t    LUT799H;
    volatile    uint32_t    LUT800L;
    volatile    uint32_t    LUT800H;
    volatile    uint32_t    LUT801L;
    volatile    uint32_t    LUT801H;
    volatile    uint32_t    LUT802L;
    volatile    uint32_t    LUT802H;
    volatile    uint32_t    LUT803L;
    volatile    uint32_t    LUT803H;
    volatile    uint32_t    LUT804L;
    volatile    uint32_t    LUT804H;
    volatile    uint32_t    LUT805L;
    volatile    uint32_t    LUT805H;
    volatile    uint32_t    LUT806L;
    volatile    uint32_t    LUT806H;
    volatile    uint32_t    LUT807L;
    volatile    uint32_t    LUT807H;
    volatile    uint32_t    LUT808L;
    volatile    uint32_t    LUT808H;
    volatile    uint32_t    LUT809L;
    volatile    uint32_t    LUT809H;
    volatile    uint32_t    LUT810L;
    volatile    uint32_t    LUT810H;
    volatile    uint32_t    LUT811L;
    volatile    uint32_t    LUT811H;
    volatile    uint32_t    LUT812L;
    volatile    uint32_t    LUT812H;
    volatile    uint32_t    LUT813L;
    volatile    uint32_t    LUT813H;
    volatile    uint32_t    LUT814L;
    volatile    uint32_t    LUT814H;
    volatile    uint32_t    LUT815L;
    volatile    uint32_t    LUT815H;
    volatile    uint32_t    LUT816L;
    volatile    uint32_t    LUT816H;
    volatile    uint32_t    LUT817L;
    volatile    uint32_t    LUT817H;
    volatile    uint32_t    LUT818L;
    volatile    uint32_t    LUT818H;
    volatile    uint32_t    LUT819L;
    volatile    uint32_t    LUT819H;
    volatile    uint32_t    LUT820L;
    volatile    uint32_t    LUT820H;
    volatile    uint32_t    LUT821L;
    volatile    uint32_t    LUT821H;
    volatile    uint32_t    LUT822L;
    volatile    uint32_t    LUT822H;
    volatile    uint32_t    LUT823L;
    volatile    uint32_t    LUT823H;
    volatile    uint32_t    LUT824L;
    volatile    uint32_t    LUT824H;
    volatile    uint32_t    LUT825L;
    volatile    uint32_t    LUT825H;
    volatile    uint32_t    LUT826L;
    volatile    uint32_t    LUT826H;
    volatile    uint32_t    LUT827L;
    volatile    uint32_t    LUT827H;
    volatile    uint32_t    LUT828L;
    volatile    uint32_t    LUT828H;
    volatile    uint32_t    LUT829L;
    volatile    uint32_t    LUT829H;
    volatile    uint32_t    LUT830L;
    volatile    uint32_t    LUT830H;
    volatile    uint32_t    LUT831L;
    volatile    uint32_t    LUT831H;
    volatile    uint32_t    LUT832L;
    volatile    uint32_t    LUT832H;
    volatile    uint32_t    LUT833L;
    volatile    uint32_t    LUT833H;
    volatile    uint32_t    LUT834L;
    volatile    uint32_t    LUT834H;
    volatile    uint32_t    LUT835L;
    volatile    uint32_t    LUT835H;
    volatile    uint32_t    LUT836L;
    volatile    uint32_t    LUT836H;
    volatile    uint32_t    LUT837L;
    volatile    uint32_t    LUT837H;
    volatile    uint32_t    LUT838L;
    volatile    uint32_t    LUT838H;
    volatile    uint32_t    LUT839L;
    volatile    uint32_t    LUT839H;
    volatile    uint32_t    LUT840L;
    volatile    uint32_t    LUT840H;
    volatile    uint32_t    LUT841L;
    volatile    uint32_t    LUT841H;
    volatile    uint32_t    LUT842L;
    volatile    uint32_t    LUT842H;
    volatile    uint32_t    LUT843L;
    volatile    uint32_t    LUT843H;
    volatile    uint32_t    LUT844L;
    volatile    uint32_t    LUT844H;
    volatile    uint32_t    LUT845L;
    volatile    uint32_t    LUT845H;
    volatile    uint32_t    LUT846L;
    volatile    uint32_t    LUT846H;
    volatile    uint32_t    LUT847L;
    volatile    uint32_t    LUT847H;
    volatile    uint32_t    LUT848L;
    volatile    uint32_t    LUT848H;
    volatile    uint32_t    LUT849L;
    volatile    uint32_t    LUT849H;
    volatile    uint32_t    LUT850L;
    volatile    uint32_t    LUT850H;
    volatile    uint32_t    LUT851L;
    volatile    uint32_t    LUT851H;
    volatile    uint32_t    LUT852L;
    volatile    uint32_t    LUT852H;
    volatile    uint32_t    LUT853L;
    volatile    uint32_t    LUT853H;
    volatile    uint32_t    LUT854L;
    volatile    uint32_t    LUT854H;
    volatile    uint32_t    LUT855L;
    volatile    uint32_t    LUT855H;
    volatile    uint32_t    LUT856L;
    volatile    uint32_t    LUT856H;
    volatile    uint32_t    LUT857L;
    volatile    uint32_t    LUT857H;
    volatile    uint32_t    LUT858L;
    volatile    uint32_t    LUT858H;
    volatile    uint32_t    LUT859L;
    volatile    uint32_t    LUT859H;
    volatile    uint32_t    LUT860L;
    volatile    uint32_t    LUT860H;
    volatile    uint32_t    LUT861L;
    volatile    uint32_t    LUT861H;
    volatile    uint32_t    LUT862L;
    volatile    uint32_t    LUT862H;
    volatile    uint32_t    LUT863L;
    volatile    uint32_t    LUT863H;
    volatile    uint32_t    LUT864L;
    volatile    uint32_t    LUT864H;
    volatile    uint32_t    LUT865L;
    volatile    uint32_t    LUT865H;
    volatile    uint32_t    LUT866L;
    volatile    uint32_t    LUT866H;
    volatile    uint32_t    LUT867L;
    volatile    uint32_t    LUT867H;
    volatile    uint32_t    LUT868L;
    volatile    uint32_t    LUT868H;
    volatile    uint32_t    LUT869L;
    volatile    uint32_t    LUT869H;
    volatile    uint32_t    LUT870L;
    volatile    uint32_t    LUT870H;
    volatile    uint32_t    LUT871L;
    volatile    uint32_t    LUT871H;
    volatile    uint32_t    LUT872L;
    volatile    uint32_t    LUT872H;
    volatile    uint32_t    LUT873L;
    volatile    uint32_t    LUT873H;
    volatile    uint32_t    LUT874L;
    volatile    uint32_t    LUT874H;
    volatile    uint32_t    LUT875L;
    volatile    uint32_t    LUT875H;
    volatile    uint32_t    LUT876L;
    volatile    uint32_t    LUT876H;
    volatile    uint32_t    LUT877L;
    volatile    uint32_t    LUT877H;
    volatile    uint32_t    LUT878L;
    volatile    uint32_t    LUT878H;
    volatile    uint32_t    LUT879L;
    volatile    uint32_t    LUT879H;
    volatile    uint32_t    LUT880L;
    volatile    uint32_t    LUT880H;
    volatile    uint32_t    LUT881L;
    volatile    uint32_t    LUT881H;
    volatile    uint32_t    LUT882L;
    volatile    uint32_t    LUT882H;
    volatile    uint32_t    LUT883L;
    volatile    uint32_t    LUT883H;
    volatile    uint32_t    LUT884L;
    volatile    uint32_t    LUT884H;
    volatile    uint32_t    LUT885L;
    volatile    uint32_t    LUT885H;
    volatile    uint32_t    LUT886L;
    volatile    uint32_t    LUT886H;
    volatile    uint32_t    LUT887L;
    volatile    uint32_t    LUT887H;
    volatile    uint32_t    LUT888L;
    volatile    uint32_t    LUT888H;
    volatile    uint32_t    LUT889L;
    volatile    uint32_t    LUT889H;
    volatile    uint32_t    LUT890L;
    volatile    uint32_t    LUT890H;
    volatile    uint32_t    LUT891L;
    volatile    uint32_t    LUT891H;
    volatile    uint32_t    LUT892L;
    volatile    uint32_t    LUT892H;
    volatile    uint32_t    LUT893L;
    volatile    uint32_t    LUT893H;
    volatile    uint32_t    LUT894L;
    volatile    uint32_t    LUT894H;
    volatile    uint32_t    LUT895L;
    volatile    uint32_t    LUT895H;
    volatile    uint32_t    LUT896L;
    volatile    uint32_t    LUT896H;
    volatile    uint32_t    LUT897L;
    volatile    uint32_t    LUT897H;
    volatile    uint32_t    LUT898L;
    volatile    uint32_t    LUT898H;
    volatile    uint32_t    LUT899L;
    volatile    uint32_t    LUT899H;
    volatile    uint32_t    LUT900L;
    volatile    uint32_t    LUT900H;
    volatile    uint32_t    LUT901L;
    volatile    uint32_t    LUT901H;
    volatile    uint32_t    LUT902L;
    volatile    uint32_t    LUT902H;
    volatile    uint32_t    LUT903L;
    volatile    uint32_t    LUT903H;
    volatile    uint32_t    LUT904L;
    volatile    uint32_t    LUT904H;
    volatile    uint32_t    LUT905L;
    volatile    uint32_t    LUT905H;
    volatile    uint32_t    LUT906L;
    volatile    uint32_t    LUT906H;
    volatile    uint32_t    LUT907L;
    volatile    uint32_t    LUT907H;
    volatile    uint32_t    LUT908L;
    volatile    uint32_t    LUT908H;
    volatile    uint32_t    LUT909L;
    volatile    uint32_t    LUT909H;
    volatile    uint32_t    LUT910L;
    volatile    uint32_t    LUT910H;
    volatile    uint32_t    LUT911L;
    volatile    uint32_t    LUT911H;
    volatile    uint32_t    LUT912L;
    volatile    uint32_t    LUT912H;
    volatile    uint32_t    LUT913L;
    volatile    uint32_t    LUT913H;
    volatile    uint32_t    LUT914L;
    volatile    uint32_t    LUT914H;
    volatile    uint32_t    LUT915L;
    volatile    uint32_t    LUT915H;
    volatile    uint32_t    LUT916L;
    volatile    uint32_t    LUT916H;
    volatile    uint32_t    LUT917L;
    volatile    uint32_t    LUT917H;
    volatile    uint32_t    LUT918L;
    volatile    uint32_t    LUT918H;
    volatile    uint32_t    LUT919L;
    volatile    uint32_t    LUT919H;
    volatile    uint32_t    LUT920L;
    volatile    uint32_t    LUT920H;
    volatile    uint32_t    LUT921L;
    volatile    uint32_t    LUT921H;
    volatile    uint32_t    LUT922L;
    volatile    uint32_t    LUT922H;
    volatile    uint32_t    LUT923L;
    volatile    uint32_t    LUT923H;
    volatile    uint32_t    LUT924L;
    volatile    uint32_t    LUT924H;
    volatile    uint32_t    LUT925L;
    volatile    uint32_t    LUT925H;
    volatile    uint32_t    LUT926L;
    volatile    uint32_t    LUT926H;
    volatile    uint32_t    LUT927L;
    volatile    uint32_t    LUT927H;
    volatile    uint32_t    LUT928L;
    volatile    uint32_t    LUT928H;
    volatile    uint32_t    LUT929L;
    volatile    uint32_t    LUT929H;
    volatile    uint32_t    LUT930L;
    volatile    uint32_t    LUT930H;
    volatile    uint32_t    LUT931L;
    volatile    uint32_t    LUT931H;
    volatile    uint32_t    LUT932L;
    volatile    uint32_t    LUT932H;
    volatile    uint32_t    LUT933L;
    volatile    uint32_t    LUT933H;
    volatile    uint32_t    LUT934L;
    volatile    uint32_t    LUT934H;
    volatile    uint32_t    LUT935L;
    volatile    uint32_t    LUT935H;
    volatile    uint32_t    LUT936L;
    volatile    uint32_t    LUT936H;
    volatile    uint32_t    LUT937L;
    volatile    uint32_t    LUT937H;
    volatile    uint32_t    LUT938L;
    volatile    uint32_t    LUT938H;
    volatile    uint32_t    LUT939L;
    volatile    uint32_t    LUT939H;
    volatile    uint32_t    LUT940L;
    volatile    uint32_t    LUT940H;
    volatile    uint32_t    LUT941L;
    volatile    uint32_t    LUT941H;
    volatile    uint32_t    LUT942L;
    volatile    uint32_t    LUT942H;
    volatile    uint32_t    LUT943L;
    volatile    uint32_t    LUT943H;
    volatile    uint32_t    LUT944L;
    volatile    uint32_t    LUT944H;
    volatile    uint32_t    LUT945L;
    volatile    uint32_t    LUT945H;
    volatile    uint32_t    LUT946L;
    volatile    uint32_t    LUT946H;
    volatile    uint32_t    LUT947L;
    volatile    uint32_t    LUT947H;
    volatile    uint32_t    LUT948L;
    volatile    uint32_t    LUT948H;
    volatile    uint32_t    LUT949L;
    volatile    uint32_t    LUT949H;
    volatile    uint32_t    LUT950L;
    volatile    uint32_t    LUT950H;
    volatile    uint32_t    LUT951L;
    volatile    uint32_t    LUT951H;
    volatile    uint32_t    LUT952L;
    volatile    uint32_t    LUT952H;
    volatile    uint32_t    LUT953L;
    volatile    uint32_t    LUT953H;
    volatile    uint32_t    LUT954L;
    volatile    uint32_t    LUT954H;
    volatile    uint32_t    LUT955L;
    volatile    uint32_t    LUT955H;
    volatile    uint32_t    LUT956L;
    volatile    uint32_t    LUT956H;
    volatile    uint32_t    LUT957L;
    volatile    uint32_t    LUT957H;
    volatile    uint32_t    LUT958L;
    volatile    uint32_t    LUT958H;
    volatile    uint32_t    LUT959L;
    volatile    uint32_t    LUT959H;
    volatile    uint32_t    LUT960L;
    volatile    uint32_t    LUT960H;
    volatile    uint32_t    LUT961L;
    volatile    uint32_t    LUT961H;
    volatile    uint32_t    LUT962L;
    volatile    uint32_t    LUT962H;
    volatile    uint32_t    LUT963L;
    volatile    uint32_t    LUT963H;
