Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_gfxmmu.h
// B0CR Configuration

#define GFXMMU_B0CR_PBBA                (0x1FFu<<23)
#define GFXMMU_B0CR_PBBA_0              (0x1u<<23)
#define GFXMMU_B0CR_PBO                 (0x7FFFFu<<4)
#define GFXMMU_B0CR_PBO_0               (0x1u<<4)

// B1CR Configuration

#define GFXMMU_B1CR_PBBA                (0x1FFu<<23)
#define GFXMMU_B1CR_PBBA_0              (0x1u<<23)
#define GFXMMU_B1CR_PBO                 (0x7FFFFu<<4)
#define GFXMMU_B1CR_PBO_0               (0x1u<<4)

// B2CR Configuration

#define GFXMMU_B2CR_PBBA                (0x1FFu<<23)
#define GFXMMU_B2CR_PBBA_0              (0x1u<<23)
#define GFXMMU_B2CR_PBO                 (0x7FFFFu<<4)
#define GFXMMU_B2CR_PBO_0               (0x1u<<4)

// B3CR Configuration

#define GFXMMU_B3CR_PBBA                (0x1FFu<<23)
#define GFXMMU_B3CR_PBBA_0              (0x1u<<23)
#define GFXMMU_B3CR_PBO                 (0x7FFFFu<<4)
#define GFXMMU_B3CR_PBO_0               (0x1u<<4)

// SECCFGR Configuration

#define GFXMMU_SECCFGR_CSEC             (0x1u<<4)
#define GFXMMU_SECCFGR_B3SEC            (0x1u<<3)
#define GFXMMU_SECCFGR_B2SEC            (0x1u<<2)
#define GFXMMU_SECCFGR_B1SEC            (0x1u<<1)
#define GFXMMU_SECCFGR_B0SEC            (0x1u<<0)

#define GFXMMU_SECCFGR_CSEC_B_0X0       (0x0u<<4)
#define GFXMMU_SECCFGR_CSEC_B_0X1       (0x1u<<4)
#define GFXMMU_SECCFGR_B3SEC_B_0X0      (0x0u<<3)
#define GFXMMU_SECCFGR_B3SEC_B_0X1      (0x1u<<3)
#define GFXMMU_SECCFGR_B2SEC_B_0X0      (0x0u<<2)
#define GFXMMU_SECCFGR_B2SEC_B_0X1      (0x1u<<2)
#define GFXMMU_SECCFGR_B1SEC_B_0X0      (0x0u<<1)
#define GFXMMU_SECCFGR_B1SEC_B_0X1      (0x1u<<1)
#define GFXMMU_SECCFGR_B0SEC_B_0X0      (0x0u<<0)
#define GFXMMU_SECCFGR_B0SEC_B_0X1      (0x1u<<0)

// PRIVCFGR Configuration

#define GFXMMU_PRIVCFGR_CPRIV           (0x1u<<4)
#define GFXMMU_PRIVCFGR_B3PRIV          (0x1u<<3)
#define GFXMMU_PRIVCFGR_B2PRIV          (0x1u<<2)
#define GFXMMU_PRIVCFGR_B1PRIV          (0x1u<<1)
#define GFXMMU_PRIVCFGR_B0PRIV          (0x1u<<0)

#define GFXMMU_PRIVCFGR_CPRIV_B_0X0     (0x0u<<4)
#define GFXMMU_PRIVCFGR_CPRIV_B_0X1     (0x1u<<4)
#define GFXMMU_PRIVCFGR_B3PRIV_B_0X0    (0x0u<<3)
#define GFXMMU_PRIVCFGR_B3PRIV_B_0X1    (0x1u<<3)
#define GFXMMU_PRIVCFGR_B2PRIV_B_0X0    (0x0u<<2)
#define GFXMMU_PRIVCFGR_B2PRIV_B_0X1    (0x1u<<2)
#define GFXMMU_PRIVCFGR_B1PRIV_B_0X0    (0x0u<<1)
#define GFXMMU_PRIVCFGR_B1PRIV_B_0X1    (0x1u<<1)
#define GFXMMU_PRIVCFGR_B0PRIV_B_0X0    (0x0u<<0)
#define GFXMMU_PRIVCFGR_B0PRIV_B_0X1    (0x1u<<0)

// RCFGLOCKR Configuration

#define GFXMMU_RCFGLOCKR_CLOCK          (0x1u<<4)
#define GFXMMU_RCFGLOCKR_B3LOCK         (0x1u<<3)
#define GFXMMU_RCFGLOCKR_B2LOCK         (0x1u<<2)
#define GFXMMU_RCFGLOCKR_B1LOCK         (0x1u<<1)
#define GFXMMU_RCFGLOCKR_B0LOCK         (0x1u<<0)

#define GFXMMU_RCFGLOCKR_CLOCK_B_0X0    (0x0u<<4)
#define GFXMMU_RCFGLOCKR_CLOCK_B_0X1    (0x1u<<4)
#define GFXMMU_RCFGLOCKR_B3LOCK_B_0X0   (0x0u<<3)
#define GFXMMU_RCFGLOCKR_B3LOCK_B_0X1   (0x1u<<3)
#define GFXMMU_RCFGLOCKR_B2LOCK_B_0X0   (0x0u<<2)
#define GFXMMU_RCFGLOCKR_B2LOCK_B_0X1   (0x1u<<2)
#define GFXMMU_RCFGLOCKR_B1LOCK_B_0X0   (0x0u<<1)
#define GFXMMU_RCFGLOCKR_B1LOCK_B_0X1   (0x1u<<1)
#define GFXMMU_RCFGLOCKR_B0LOCK_B_0X0   (0x0u<<0)
#define GFXMMU_RCFGLOCKR_B0LOCK_B_0X1   (0x1u<<0)

// PUBCFGR Configuration

#define GFXMMU_PUBCFGR_CPUB             (0x1u<<4)
#define GFXMMU_PUBCFGR_B3PUB            (0x1u<<3)
#define GFXMMU_PUBCFGR_B2PUB            (0x1u<<2)
#define GFXMMU_PUBCFGR_B1PUB            (0x1u<<1)
#define GFXMMU_PUBCFGR_B0PUB            (0x1u<<0)

#define GFXMMU_PUBCFGR_CPUB_B_0X0       (0x0u<<4)
#define GFXMMU_PUBCFGR_CPUB_B_0X1       (0x1u<<4)
#define GFXMMU_PUBCFGR_B3PUB_B_0X0      (0x0u<<3)
#define GFXMMU_PUBCFGR_B3PUB_B_0X1      (0x1u<<3)
#define GFXMMU_PUBCFGR_B2PUB_B_0X0      (0x0u<<2)
#define GFXMMU_PUBCFGR_B2PUB_B_0X1      (0x1u<<2)
#define GFXMMU_PUBCFGR_B1PUB_B_0X0      (0x0u<<1)
#define GFXMMU_PUBCFGR_B1PUB_B_0X1      (0x1u<<1)
#define GFXMMU_PUBCFGR_B0PUB_B_0X0      (0x0u<<0)
#define GFXMMU_PUBCFGR_B0PUB_B_0X1      (0x1u<<0)

// LUT0L Configuration

#define GFXMMU_LUT0L_LVB                (0xFFu<<16)
#define GFXMMU_LUT0L_LVB_0              (0x1u<<16)
#define GFXMMU_LUT0L_FVB                (0xFFu<<8)
#define GFXMMU_LUT0L_FVB_0              (0x1u<<8)
#define GFXMMU_LUT0L_EN                 (0x1u<<0)

#define GFXMMU_LUT0L_EN_B_0X0           (0x0u<<0)
#define GFXMMU_LUT0L_EN_B_0X1           (0x1u<<0)

// LUT0H Configuration

#define GFXMMU_LUT0H_LO                 (0x3FFFFu<<0)
#define GFXMMU_LUT0H_LO_0               (0x1u<<0)

// LUT1L Configuration

#define GFXMMU_LUT1L_LVB                (0xFFu<<16)
#define GFXMMU_LUT1L_LVB_0              (0x1u<<16)
#define GFXMMU_LUT1L_FVB                (0xFFu<<8)
#define GFXMMU_LUT1L_FVB_0              (0x1u<<8)
#define GFXMMU_LUT1L_EN                 (0x1u<<0)

#define GFXMMU_LUT1L_EN_B_0X0           (0x0u<<0)
#define GFXMMU_LUT1L_EN_B_0X1           (0x1u<<0)

// LUT1H Configuration

#define GFXMMU_LUT1H_LO                 (0x3FFFFu<<0)
#define GFXMMU_LUT1H_LO_0               (0x1u<<0)

// LUT2L Configuration

#define GFXMMU_LUT2L_LVB                (0xFFu<<16)
#define GFXMMU_LUT2L_LVB_0              (0x1u<<16)
#define GFXMMU_LUT2L_FVB                (0xFFu<<8)
#define GFXMMU_LUT2L_FVB_0              (0x1u<<8)
#define GFXMMU_LUT2L_EN                 (0x1u<<0)

#define GFXMMU_LUT2L_EN_B_0X0           (0x0u<<0)
#define GFXMMU_LUT2L_EN_B_0X1           (0x1u<<0)

// LUT2H Configuration

#define GFXMMU_LUT2H_LO                 (0x3FFFFu<<0)
#define GFXMMU_LUT2H_LO_0               (0x1u<<0)

// LUT3L Configuration

#define GFXMMU_LUT3L_LVB                (0xFFu<<16)
#define GFXMMU_LUT3L_LVB_0              (0x1u<<16)
#define GFXMMU_LUT3L_FVB                (0xFFu<<8)
#define GFXMMU_LUT3L_FVB_0              (0x1u<<8)
#define GFXMMU_LUT3L_EN                 (0x1u<<0)

#define GFXMMU_LUT3L_EN_B_0X0           (0x0u<<0)
#define GFXMMU_LUT3L_EN_B_0X1           (0x1u<<0)

// LUT3H Configuration

#define GFXMMU_LUT3H_LO                 (0x3FFFFu<<0)
#define GFXMMU_LUT3H_LO_0               (0x1u<<0)

// LUT4L Configuration

#define GFXMMU_LUT4L_LVB                (0xFFu<<16)
#define GFXMMU_LUT4L_LVB_0              (0x1u<<16)
#define GFXMMU_LUT4L_FVB                (0xFFu<<8)
#define GFXMMU_LUT4L_FVB_0              (0x1u<<8)
#define GFXMMU_LUT4L_EN                 (0x1u<<0)

#define GFXMMU_LUT4L_EN_B_0X0           (0x0u<<0)
#define GFXMMU_LUT4L_EN_B_0X1           (0x1u<<0)

// LUT4H Configuration

#define GFXMMU_LUT4H_LO                 (0x3FFFFu<<0)
#define GFXMMU_LUT4H_LO_0               (0x1u<<0)

