Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_gfxmmu.h
// LUT5L Configuration

#define GFXMMU_LUT5L_LVB                (0xFFu<<16)
#define GFXMMU_LUT5L_LVB_0              (0x1u<<16)
#define GFXMMU_LUT5L_FVB                (0xFFu<<8)
#define GFXMMU_LUT5L_FVB_0              (0x1u<<8)
#define GFXMMU_LUT5L_EN                 (0x1u<<0)

#define GFXMMU_LUT5L_EN_B_0X0           (0x0u<<0)
#define GFXMMU_LUT5L_EN_B_0X1           (0x1u<<0)

// LUT5H Configuration

#define GFXMMU_LUT5H_LO                 (0x3FFFFu<<0)
#define GFXMMU_LUT5H_LO_0               (0x1u<<0)

// LUT6L Configuration

#define GFXMMU_LUT6L_LVB                (0xFFu<<16)
#define GFXMMU_LUT6L_LVB_0              (0x1u<<16)
#define GFXMMU_LUT6L_FVB                (0xFFu<<8)
#define GFXMMU_LUT6L_FVB_0              (0x1u<<8)
#define GFXMMU_LUT6L_EN                 (0x1u<<0)

#define GFXMMU_LUT6L_EN_B_0X0           (0x0u<<0)
#define GFXMMU_LUT6L_EN_B_0X1           (0x1u<<0)

// LUT6H Configuration

#define GFXMMU_LUT6H_LO                 (0x3FFFFu<<0)
#define GFXMMU_LUT6H_LO_0               (0x1u<<0)

// LUT7L Configuration

#define GFXMMU_LUT7L_LVB                (0xFFu<<16)
#define GFXMMU_LUT7L_LVB_0              (0x1u<<16)
#define GFXMMU_LUT7L_FVB                (0xFFu<<8)
#define GFXMMU_LUT7L_FVB_0              (0x1u<<8)
#define GFXMMU_LUT7L_EN                 (0x1u<<0)

#define GFXMMU_LUT7L_EN_B_0X0           (0x0u<<0)
#define GFXMMU_LUT7L_EN_B_0X1           (0x1u<<0)

// LUT7H Configuration

#define GFXMMU_LUT7H_LO                 (0x3FFFFu<<0)
#define GFXMMU_LUT7H_LO_0               (0x1u<<0)

// LUT8L Configuration

#define GFXMMU_LUT8L_LVB                (0xFFu<<16)
#define GFXMMU_LUT8L_LVB_0              (0x1u<<16)
#define GFXMMU_LUT8L_FVB                (0xFFu<<8)
#define GFXMMU_LUT8L_FVB_0              (0x1u<<8)
#define GFXMMU_LUT8L_EN                 (0x1u<<0)

#define GFXMMU_LUT8L_EN_B_0X0           (0x0u<<0)
#define GFXMMU_LUT8L_EN_B_0X1           (0x1u<<0)

// LUT8H Configuration

#define GFXMMU_LUT8H_LO                 (0x3FFFFu<<0)
#define GFXMMU_LUT8H_LO_0               (0x1u<<0)

// LUT9L Configuration

#define GFXMMU_LUT9L_LVB                (0xFFu<<16)
#define GFXMMU_LUT9L_LVB_0              (0x1u<<16)
#define GFXMMU_LUT9L_FVB                (0xFFu<<8)
#define GFXMMU_LUT9L_FVB_0              (0x1u<<8)
#define GFXMMU_LUT9L_EN                 (0x1u<<0)

#define GFXMMU_LUT9L_EN_B_0X0           (0x0u<<0)
#define GFXMMU_LUT9L_EN_B_0X1           (0x1u<<0)

// LUT9H Configuration

#define GFXMMU_LUT9H_LO                 (0x3FFFFu<<0)
#define GFXMMU_LUT9H_LO_0               (0x1u<<0)

// LUT10L Configuration

#define GFXMMU_LUT10L_LVB               (0xFFu<<16)
#define GFXMMU_LUT10L_LVB_0             (0x1u<<16)
#define GFXMMU_LUT10L_FVB               (0xFFu<<8)
#define GFXMMU_LUT10L_FVB_0             (0x1u<<8)
#define GFXMMU_LUT10L_EN                (0x1u<<0)

#define GFXMMU_LUT10L_EN_B_0X0          (0x0u<<0)
#define GFXMMU_LUT10L_EN_B_0X1          (0x1u<<0)

// LUT10H Configuration

#define GFXMMU_LUT10H_LO                (0x3FFFFu<<0)
#define GFXMMU_LUT10H_LO_0              (0x1u<<0)

// LUT11L Configuration

#define GFXMMU_LUT11L_LVB               (0xFFu<<16)
#define GFXMMU_LUT11L_LVB_0             (0x1u<<16)
#define GFXMMU_LUT11L_FVB               (0xFFu<<8)
#define GFXMMU_LUT11L_FVB_0             (0x1u<<8)
#define GFXMMU_LUT11L_EN                (0x1u<<0)

#define GFXMMU_LUT11L_EN_B_0X0          (0x0u<<0)
#define GFXMMU_LUT11L_EN_B_0X1          (0x1u<<0)

// LUT11H Configuration

#define GFXMMU_LUT11H_LO                (0x3FFFFu<<0)
#define GFXMMU_LUT11H_LO_0              (0x1u<<0)

// LUT12L Configuration

#define GFXMMU_LUT12L_LVB               (0xFFu<<16)
#define GFXMMU_LUT12L_LVB_0             (0x1u<<16)
#define GFXMMU_LUT12L_FVB               (0xFFu<<8)
#define GFXMMU_LUT12L_FVB_0             (0x1u<<8)
#define GFXMMU_LUT12L_EN                (0x1u<<0)

#define GFXMMU_LUT12L_EN_B_0X0          (0x0u<<0)
#define GFXMMU_LUT12L_EN_B_0X1          (0x1u<<0)

// LUT12H Configuration

#define GFXMMU_LUT12H_LO                (0x3FFFFu<<0)
#define GFXMMU_LUT12H_LO_0              (0x1u<<0)

// LUT13L Configuration

#define GFXMMU_LUT13L_LVB               (0xFFu<<16)
#define GFXMMU_LUT13L_LVB_0             (0x1u<<16)
#define GFXMMU_LUT13L_FVB               (0xFFu<<8)
#define GFXMMU_LUT13L_FVB_0             (0x1u<<8)
#define GFXMMU_LUT13L_EN                (0x1u<<0)

#define GFXMMU_LUT13L_EN_B_0X0          (0x0u<<0)
#define GFXMMU_LUT13L_EN_B_0X1          (0x1u<<0)

// LUT13H Configuration

#define GFXMMU_LUT13H_LO                (0x3FFFFu<<0)
#define GFXMMU_LUT13H_LO_0              (0x1u<<0)

// LUT14L Configuration

#define GFXMMU_LUT14L_LVB               (0xFFu<<16)
#define GFXMMU_LUT14L_LVB_0             (0x1u<<16)
#define GFXMMU_LUT14L_FVB               (0xFFu<<8)
#define GFXMMU_LUT14L_FVB_0             (0x1u<<8)
#define GFXMMU_LUT14L_EN                (0x1u<<0)

#define GFXMMU_LUT14L_EN_B_0X0          (0x0u<<0)
#define GFXMMU_LUT14L_EN_B_0X1          (0x1u<<0)

// LUT14H Configuration

#define GFXMMU_LUT14H_LO                (0x3FFFFu<<0)
#define GFXMMU_LUT14H_LO_0              (0x1u<<0)

// LUT15L Configuration

#define GFXMMU_LUT15L_LVB               (0xFFu<<16)
#define GFXMMU_LUT15L_LVB_0             (0x1u<<16)
#define GFXMMU_LUT15L_FVB               (0xFFu<<8)
#define GFXMMU_LUT15L_FVB_0             (0x1u<<8)
#define GFXMMU_LUT15L_EN                (0x1u<<0)

#define GFXMMU_LUT15L_EN_B_0X0          (0x0u<<0)
#define GFXMMU_LUT15L_EN_B_0X1          (0x1u<<0)

// LUT15H Configuration

#define GFXMMU_LUT15H_LO                (0x3FFFFu<<0)
#define GFXMMU_LUT15H_LO_0              (0x1u<<0)

// LUT16L Configuration

#define GFXMMU_LUT16L_LVB               (0xFFu<<16)
#define GFXMMU_LUT16L_LVB_0             (0x1u<<16)
#define GFXMMU_LUT16L_FVB               (0xFFu<<8)
#define GFXMMU_LUT16L_FVB_0             (0x1u<<8)
#define GFXMMU_LUT16L_EN                (0x1u<<0)

#define GFXMMU_LUT16L_EN_B_0X0          (0x0u<<0)
#define GFXMMU_LUT16L_EN_B_0X1          (0x1u<<0)

// LUT16H Configuration

#define GFXMMU_LUT16H_LO                (0x3FFFFu<<0)
#define GFXMMU_LUT16H_LO_0              (0x1u<<0)

// LUT17L Configuration

#define GFXMMU_LUT17L_LVB               (0xFFu<<16)
#define GFXMMU_LUT17L_LVB_0             (0x1u<<16)
#define GFXMMU_LUT17L_FVB               (0xFFu<<8)
#define GFXMMU_LUT17L_FVB_0             (0x1u<<8)
#define GFXMMU_LUT17L_EN                (0x1u<<0)

#define GFXMMU_LUT17L_EN_B_0X0          (0x0u<<0)
#define GFXMMU_LUT17L_EN_B_0X1          (0x1u<<0)

