Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_gfxmmu.h
// LUT17H Configuration

#define GFXMMU_LUT17H_LO                (0x3FFFFu<<0)
#define GFXMMU_LUT17H_LO_0              (0x1u<<0)

// LUT18L Configuration

#define GFXMMU_LUT18L_LVB               (0xFFu<<16)
#define GFXMMU_LUT18L_LVB_0             (0x1u<<16)
#define GFXMMU_LUT18L_FVB               (0xFFu<<8)
#define GFXMMU_LUT18L_FVB_0             (0x1u<<8)
#define GFXMMU_LUT18L_EN                (0x1u<<0)

#define GFXMMU_LUT18L_EN_B_0X0          (0x0u<<0)
#define GFXMMU_LUT18L_EN_B_0X1          (0x1u<<0)

// LUT18H Configuration

#define GFXMMU_LUT18H_LO                (0x3FFFFu<<0)
#define GFXMMU_LUT18H_LO_0              (0x1u<<0)

// LUT19L Configuration

#define GFXMMU_LUT19L_LVB               (0xFFu<<16)
#define GFXMMU_LUT19L_LVB_0             (0x1u<<16)
#define GFXMMU_LUT19L_FVB               (0xFFu<<8)
#define GFXMMU_LUT19L_FVB_0             (0x1u<<8)
#define GFXMMU_LUT19L_EN                (0x1u<<0)

#define GFXMMU_LUT19L_EN_B_0X0          (0x0u<<0)
#define GFXMMU_LUT19L_EN_B_0X1          (0x1u<<0)

// LUT19H Configuration

#define GFXMMU_LUT19H_LO                (0x3FFFFu<<0)
#define GFXMMU_LUT19H_LO_0              (0x1u<<0)

// LUT20L Configuration

#define GFXMMU_LUT20L_LVB               (0xFFu<<16)
#define GFXMMU_LUT20L_LVB_0             (0x1u<<16)
#define GFXMMU_LUT20L_FVB               (0xFFu<<8)
#define GFXMMU_LUT20L_FVB_0             (0x1u<<8)
#define GFXMMU_LUT20L_EN                (0x1u<<0)

#define GFXMMU_LUT20L_EN_B_0X0          (0x0u<<0)
#define GFXMMU_LUT20L_EN_B_0X1          (0x1u<<0)

// LUT20H Configuration

#define GFXMMU_LUT20H_LO                (0x3FFFFu<<0)
#define GFXMMU_LUT20H_LO_0              (0x1u<<0)

// LUT21L Configuration

#define GFXMMU_LUT21L_LVB               (0xFFu<<16)
#define GFXMMU_LUT21L_LVB_0             (0x1u<<16)
#define GFXMMU_LUT21L_FVB               (0xFFu<<8)
#define GFXMMU_LUT21L_FVB_0             (0x1u<<8)
#define GFXMMU_LUT21L_EN                (0x1u<<0)

#define GFXMMU_LUT21L_EN_B_0X0          (0x0u<<0)
#define GFXMMU_LUT21L_EN_B_0X1          (0x1u<<0)

// LUT21H Configuration

#define GFXMMU_LUT21H_LO                (0x3FFFFu<<0)
#define GFXMMU_LUT21H_LO_0              (0x1u<<0)

// LUT22L Configuration

#define GFXMMU_LUT22L_LVB               (0xFFu<<16)
#define GFXMMU_LUT22L_LVB_0             (0x1u<<16)
#define GFXMMU_LUT22L_FVB               (0xFFu<<8)
#define GFXMMU_LUT22L_FVB_0             (0x1u<<8)
#define GFXMMU_LUT22L_EN                (0x1u<<0)

#define GFXMMU_LUT22L_EN_B_0X0          (0x0u<<0)
#define GFXMMU_LUT22L_EN_B_0X1          (0x1u<<0)

// LUT22H Configuration

#define GFXMMU_LUT22H_LO                (0x3FFFFu<<0)
#define GFXMMU_LUT22H_LO_0              (0x1u<<0)

// LUT23L Configuration

#define GFXMMU_LUT23L_LVB               (0xFFu<<16)
#define GFXMMU_LUT23L_LVB_0             (0x1u<<16)
#define GFXMMU_LUT23L_FVB               (0xFFu<<8)
#define GFXMMU_LUT23L_FVB_0             (0x1u<<8)
#define GFXMMU_LUT23L_EN                (0x1u<<0)

#define GFXMMU_LUT23L_EN_B_0X0          (0x0u<<0)
#define GFXMMU_LUT23L_EN_B_0X1          (0x1u<<0)

// LUT23H Configuration

#define GFXMMU_LUT23H_LO                (0x3FFFFu<<0)
#define GFXMMU_LUT23H_LO_0              (0x1u<<0)

// LUT24L Configuration

#define GFXMMU_LUT24L_LVB               (0xFFu<<16)
#define GFXMMU_LUT24L_LVB_0             (0x1u<<16)
#define GFXMMU_LUT24L_FVB               (0xFFu<<8)
#define GFXMMU_LUT24L_FVB_0             (0x1u<<8)
#define GFXMMU_LUT24L_EN                (0x1u<<0)

#define GFXMMU_LUT24L_EN_B_0X0          (0x0u<<0)
#define GFXMMU_LUT24L_EN_B_0X1          (0x1u<<0)

// LUT24H Configuration

#define GFXMMU_LUT24H_LO                (0x3FFFFu<<0)
#define GFXMMU_LUT24H_LO_0              (0x1u<<0)

// LUT25L Configuration

#define GFXMMU_LUT25L_LVB               (0xFFu<<16)
#define GFXMMU_LUT25L_LVB_0             (0x1u<<16)
#define GFXMMU_LUT25L_FVB               (0xFFu<<8)
#define GFXMMU_LUT25L_FVB_0             (0x1u<<8)
#define GFXMMU_LUT25L_EN                (0x1u<<0)

#define GFXMMU_LUT25L_EN_B_0X0          (0x0u<<0)
#define GFXMMU_LUT25L_EN_B_0X1          (0x1u<<0)

// LUT25H Configuration

#define GFXMMU_LUT25H_LO                (0x3FFFFu<<0)
#define GFXMMU_LUT25H_LO_0              (0x1u<<0)

// LUT26L Configuration

#define GFXMMU_LUT26L_LVB               (0xFFu<<16)
#define GFXMMU_LUT26L_LVB_0             (0x1u<<16)
#define GFXMMU_LUT26L_FVB               (0xFFu<<8)
#define GFXMMU_LUT26L_FVB_0             (0x1u<<8)
#define GFXMMU_LUT26L_EN                (0x1u<<0)

#define GFXMMU_LUT26L_EN_B_0X0          (0x0u<<0)
#define GFXMMU_LUT26L_EN_B_0X1          (0x1u<<0)

// LUT26H Configuration

#define GFXMMU_LUT26H_LO                (0x3FFFFu<<0)
#define GFXMMU_LUT26H_LO_0              (0x1u<<0)

// LUT27L Configuration

#define GFXMMU_LUT27L_LVB               (0xFFu<<16)
#define GFXMMU_LUT27L_LVB_0             (0x1u<<16)
#define GFXMMU_LUT27L_FVB               (0xFFu<<8)
#define GFXMMU_LUT27L_FVB_0             (0x1u<<8)
#define GFXMMU_LUT27L_EN                (0x1u<<0)

#define GFXMMU_LUT27L_EN_B_0X0          (0x0u<<0)
#define GFXMMU_LUT27L_EN_B_0X1          (0x1u<<0)

// LUT27H Configuration

#define GFXMMU_LUT27H_LO                (0x3FFFFu<<0)
#define GFXMMU_LUT27H_LO_0              (0x1u<<0)

// LUT28L Configuration

#define GFXMMU_LUT28L_LVB               (0xFFu<<16)
#define GFXMMU_LUT28L_LVB_0             (0x1u<<16)
#define GFXMMU_LUT28L_FVB               (0xFFu<<8)
#define GFXMMU_LUT28L_FVB_0             (0x1u<<8)
#define GFXMMU_LUT28L_EN                (0x1u<<0)

#define GFXMMU_LUT28L_EN_B_0X0          (0x0u<<0)
#define GFXMMU_LUT28L_EN_B_0X1          (0x1u<<0)

// LUT28H Configuration

#define GFXMMU_LUT28H_LO                (0x3FFFFu<<0)
#define GFXMMU_LUT28H_LO_0              (0x1u<<0)

// LUT29L Configuration

#define GFXMMU_LUT29L_LVB               (0xFFu<<16)
#define GFXMMU_LUT29L_LVB_0             (0x1u<<16)
#define GFXMMU_LUT29L_FVB               (0xFFu<<8)
#define GFXMMU_LUT29L_FVB_0             (0x1u<<8)
#define GFXMMU_LUT29L_EN                (0x1u<<0)

#define GFXMMU_LUT29L_EN_B_0X0          (0x0u<<0)
#define GFXMMU_LUT29L_EN_B_0X1          (0x1u<<0)

// LUT29H Configuration

#define GFXMMU_LUT29H_LO                (0x3FFFFu<<0)
#define GFXMMU_LUT29H_LO_0              (0x1u<<0)

// LUT30L Configuration

#define GFXMMU_LUT30L_LVB               (0xFFu<<16)
#define GFXMMU_LUT30L_LVB_0             (0x1u<<16)
#define GFXMMU_LUT30L_FVB               (0xFFu<<8)
#define GFXMMU_LUT30L_FVB_0             (0x1u<<8)
#define GFXMMU_LUT30L_EN                (0x1u<<0)

#define GFXMMU_LUT30L_EN_B_0X0          (0x0u<<0)
#define GFXMMU_LUT30L_EN_B_0X1          (0x1u<<0)

// LUT30H Configuration

