Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_gfxmmu.h
#define GFXMMU_LUT30H_LO                (0x3FFFFu<<0)
#define GFXMMU_LUT30H_LO_0              (0x1u<<0)

// LUT31L Configuration

#define GFXMMU_LUT31L_LVB               (0xFFu<<16)
#define GFXMMU_LUT31L_LVB_0             (0x1u<<16)
#define GFXMMU_LUT31L_FVB               (0xFFu<<8)
#define GFXMMU_LUT31L_FVB_0             (0x1u<<8)
#define GFXMMU_LUT31L_EN                (0x1u<<0)

#define GFXMMU_LUT31L_EN_B_0X0          (0x0u<<0)
#define GFXMMU_LUT31L_EN_B_0X1          (0x1u<<0)

// LUT31H Configuration

#define GFXMMU_LUT31H_LO                (0x3FFFFu<<0)
#define GFXMMU_LUT31H_LO_0              (0x1u<<0)

// LUT32L Configuration

#define GFXMMU_LUT32L_LVB               (0xFFu<<16)
#define GFXMMU_LUT32L_LVB_0             (0x1u<<16)
#define GFXMMU_LUT32L_FVB               (0xFFu<<8)
#define GFXMMU_LUT32L_FVB_0             (0x1u<<8)
#define GFXMMU_LUT32L_EN                (0x1u<<0)

#define GFXMMU_LUT32L_EN_B_0X0          (0x0u<<0)
#define GFXMMU_LUT32L_EN_B_0X1          (0x1u<<0)

// LUT32H Configuration

#define GFXMMU_LUT32H_LO                (0x3FFFFu<<0)
#define GFXMMU_LUT32H_LO_0              (0x1u<<0)

// LUT33L Configuration

#define GFXMMU_LUT33L_LVB               (0xFFu<<16)
#define GFXMMU_LUT33L_LVB_0             (0x1u<<16)
#define GFXMMU_LUT33L_FVB               (0xFFu<<8)
#define GFXMMU_LUT33L_FVB_0             (0x1u<<8)
#define GFXMMU_LUT33L_EN                (0x1u<<0)

#define GFXMMU_LUT33L_EN_B_0X0          (0x0u<<0)
#define GFXMMU_LUT33L_EN_B_0X1          (0x1u<<0)

// LUT33H Configuration

#define GFXMMU_LUT33H_LO                (0x3FFFFu<<0)
#define GFXMMU_LUT33H_LO_0              (0x1u<<0)

// LUT34L Configuration

#define GFXMMU_LUT34L_LVB               (0xFFu<<16)
#define GFXMMU_LUT34L_LVB_0             (0x1u<<16)
#define GFXMMU_LUT34L_FVB               (0xFFu<<8)
#define GFXMMU_LUT34L_FVB_0             (0x1u<<8)
#define GFXMMU_LUT34L_EN                (0x1u<<0)

#define GFXMMU_LUT34L_EN_B_0X0          (0x0u<<0)
#define GFXMMU_LUT34L_EN_B_0X1          (0x1u<<0)

// LUT34H Configuration

#define GFXMMU_LUT34H_LO                (0x3FFFFu<<0)
#define GFXMMU_LUT34H_LO_0              (0x1u<<0)

// LUT35L Configuration

#define GFXMMU_LUT35L_LVB               (0xFFu<<16)
#define GFXMMU_LUT35L_LVB_0             (0x1u<<16)
#define GFXMMU_LUT35L_FVB               (0xFFu<<8)
#define GFXMMU_LUT35L_FVB_0             (0x1u<<8)
#define GFXMMU_LUT35L_EN                (0x1u<<0)

#define GFXMMU_LUT35L_EN_B_0X0          (0x0u<<0)
#define GFXMMU_LUT35L_EN_B_0X1          (0x1u<<0)

// LUT35H Configuration

#define GFXMMU_LUT35H_LO                (0x3FFFFu<<0)
#define GFXMMU_LUT35H_LO_0              (0x1u<<0)

// LUT36L Configuration

#define GFXMMU_LUT36L_LVB               (0xFFu<<16)
#define GFXMMU_LUT36L_LVB_0             (0x1u<<16)
#define GFXMMU_LUT36L_FVB               (0xFFu<<8)
#define GFXMMU_LUT36L_FVB_0             (0x1u<<8)
#define GFXMMU_LUT36L_EN                (0x1u<<0)

#define GFXMMU_LUT36L_EN_B_0X0          (0x0u<<0)
#define GFXMMU_LUT36L_EN_B_0X1          (0x1u<<0)

// LUT36H Configuration

#define GFXMMU_LUT36H_LO                (0x3FFFFu<<0)
#define GFXMMU_LUT36H_LO_0              (0x1u<<0)

// LUT37L Configuration

#define GFXMMU_LUT37L_LVB               (0xFFu<<16)
#define GFXMMU_LUT37L_LVB_0             (0x1u<<16)
#define GFXMMU_LUT37L_FVB               (0xFFu<<8)
#define GFXMMU_LUT37L_FVB_0             (0x1u<<8)
#define GFXMMU_LUT37L_EN                (0x1u<<0)

#define GFXMMU_LUT37L_EN_B_0X0          (0x0u<<0)
#define GFXMMU_LUT37L_EN_B_0X1          (0x1u<<0)

// LUT37H Configuration

#define GFXMMU_LUT37H_LO                (0x3FFFFu<<0)
#define GFXMMU_LUT37H_LO_0              (0x1u<<0)

// LUT38L Configuration

#define GFXMMU_LUT38L_LVB               (0xFFu<<16)
#define GFXMMU_LUT38L_LVB_0             (0x1u<<16)
#define GFXMMU_LUT38L_FVB               (0xFFu<<8)
#define GFXMMU_LUT38L_FVB_0             (0x1u<<8)
#define GFXMMU_LUT38L_EN                (0x1u<<0)

#define GFXMMU_LUT38L_EN_B_0X0          (0x0u<<0)
#define GFXMMU_LUT38L_EN_B_0X1          (0x1u<<0)

// LUT38H Configuration

#define GFXMMU_LUT38H_LO                (0x3FFFFu<<0)
#define GFXMMU_LUT38H_LO_0              (0x1u<<0)

// LUT39L Configuration

#define GFXMMU_LUT39L_LVB               (0xFFu<<16)
#define GFXMMU_LUT39L_LVB_0             (0x1u<<16)
#define GFXMMU_LUT39L_FVB               (0xFFu<<8)
#define GFXMMU_LUT39L_FVB_0             (0x1u<<8)
#define GFXMMU_LUT39L_EN                (0x1u<<0)

#define GFXMMU_LUT39L_EN_B_0X0          (0x0u<<0)
#define GFXMMU_LUT39L_EN_B_0X1          (0x1u<<0)

// LUT39H Configuration

#define GFXMMU_LUT39H_LO                (0x3FFFFu<<0)
#define GFXMMU_LUT39H_LO_0              (0x1u<<0)

// LUT40L Configuration

#define GFXMMU_LUT40L_LVB               (0xFFu<<16)
#define GFXMMU_LUT40L_LVB_0             (0x1u<<16)
#define GFXMMU_LUT40L_FVB               (0xFFu<<8)
#define GFXMMU_LUT40L_FVB_0             (0x1u<<8)
#define GFXMMU_LUT40L_EN                (0x1u<<0)

#define GFXMMU_LUT40L_EN_B_0X0          (0x0u<<0)
#define GFXMMU_LUT40L_EN_B_0X1          (0x1u<<0)

// LUT40H Configuration

#define GFXMMU_LUT40H_LO                (0x3FFFFu<<0)
#define GFXMMU_LUT40H_LO_0              (0x1u<<0)

// LUT41L Configuration

#define GFXMMU_LUT41L_LVB               (0xFFu<<16)
#define GFXMMU_LUT41L_LVB_0             (0x1u<<16)
#define GFXMMU_LUT41L_FVB               (0xFFu<<8)
#define GFXMMU_LUT41L_FVB_0             (0x1u<<8)
#define GFXMMU_LUT41L_EN                (0x1u<<0)

#define GFXMMU_LUT41L_EN_B_0X0          (0x0u<<0)
#define GFXMMU_LUT41L_EN_B_0X1          (0x1u<<0)

// LUT41H Configuration

#define GFXMMU_LUT41H_LO                (0x3FFFFu<<0)
#define GFXMMU_LUT41H_LO_0              (0x1u<<0)

// LUT42L Configuration

#define GFXMMU_LUT42L_LVB               (0xFFu<<16)
#define GFXMMU_LUT42L_LVB_0             (0x1u<<16)
#define GFXMMU_LUT42L_FVB               (0xFFu<<8)
#define GFXMMU_LUT42L_FVB_0             (0x1u<<8)
#define GFXMMU_LUT42L_EN                (0x1u<<0)

