Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_gfxmmu.h
#define GFXMMU_LUT67H_LO                (0x3FFFFu<<0)
#define GFXMMU_LUT67H_LO_0              (0x1u<<0)

// LUT68L Configuration

#define GFXMMU_LUT68L_LVB               (0xFFu<<16)
#define GFXMMU_LUT68L_LVB_0             (0x1u<<16)
#define GFXMMU_LUT68L_FVB               (0xFFu<<8)
#define GFXMMU_LUT68L_FVB_0             (0x1u<<8)
#define GFXMMU_LUT68L_EN                (0x1u<<0)

#define GFXMMU_LUT68L_EN_B_0X0          (0x0u<<0)
#define GFXMMU_LUT68L_EN_B_0X1          (0x1u<<0)

// LUT68H Configuration

#define GFXMMU_LUT68H_LO                (0x3FFFFu<<0)
#define GFXMMU_LUT68H_LO_0              (0x1u<<0)

// LUT69L Configuration

#define GFXMMU_LUT69L_LVB               (0xFFu<<16)
#define GFXMMU_LUT69L_LVB_0             (0x1u<<16)
#define GFXMMU_LUT69L_FVB               (0xFFu<<8)
#define GFXMMU_LUT69L_FVB_0             (0x1u<<8)
#define GFXMMU_LUT69L_EN                (0x1u<<0)

#define GFXMMU_LUT69L_EN_B_0X0          (0x0u<<0)
#define GFXMMU_LUT69L_EN_B_0X1          (0x1u<<0)

// LUT69H Configuration

#define GFXMMU_LUT69H_LO                (0x3FFFFu<<0)
#define GFXMMU_LUT69H_LO_0              (0x1u<<0)

// LUT70L Configuration

#define GFXMMU_LUT70L_LVB               (0xFFu<<16)
#define GFXMMU_LUT70L_LVB_0             (0x1u<<16)
#define GFXMMU_LUT70L_FVB               (0xFFu<<8)
#define GFXMMU_LUT70L_FVB_0             (0x1u<<8)
#define GFXMMU_LUT70L_EN                (0x1u<<0)

#define GFXMMU_LUT70L_EN_B_0X0          (0x0u<<0)
#define GFXMMU_LUT70L_EN_B_0X1          (0x1u<<0)

// LUT70H Configuration

#define GFXMMU_LUT70H_LO                (0x3FFFFu<<0)
#define GFXMMU_LUT70H_LO_0              (0x1u<<0)

// LUT71L Configuration

#define GFXMMU_LUT71L_LVB               (0xFFu<<16)
#define GFXMMU_LUT71L_LVB_0             (0x1u<<16)
#define GFXMMU_LUT71L_FVB               (0xFFu<<8)
#define GFXMMU_LUT71L_FVB_0             (0x1u<<8)
#define GFXMMU_LUT71L_EN                (0x1u<<0)

#define GFXMMU_LUT71L_EN_B_0X0          (0x0u<<0)
#define GFXMMU_LUT71L_EN_B_0X1          (0x1u<<0)

// LUT71H Configuration

#define GFXMMU_LUT71H_LO                (0x3FFFFu<<0)
#define GFXMMU_LUT71H_LO_0              (0x1u<<0)

// LUT72L Configuration

#define GFXMMU_LUT72L_LVB               (0xFFu<<16)
#define GFXMMU_LUT72L_LVB_0             (0x1u<<16)
#define GFXMMU_LUT72L_FVB               (0xFFu<<8)
#define GFXMMU_LUT72L_FVB_0             (0x1u<<8)
#define GFXMMU_LUT72L_EN                (0x1u<<0)

#define GFXMMU_LUT72L_EN_B_0X0          (0x0u<<0)
#define GFXMMU_LUT72L_EN_B_0X1          (0x1u<<0)

// LUT72H Configuration

#define GFXMMU_LUT72H_LO                (0x3FFFFu<<0)
#define GFXMMU_LUT72H_LO_0              (0x1u<<0)

// LUT73L Configuration

#define GFXMMU_LUT73L_LVB               (0xFFu<<16)
#define GFXMMU_LUT73L_LVB_0             (0x1u<<16)
#define GFXMMU_LUT73L_FVB               (0xFFu<<8)
#define GFXMMU_LUT73L_FVB_0             (0x1u<<8)
#define GFXMMU_LUT73L_EN                (0x1u<<0)

#define GFXMMU_LUT73L_EN_B_0X0          (0x0u<<0)
#define GFXMMU_LUT73L_EN_B_0X1          (0x1u<<0)

// LUT73H Configuration

#define GFXMMU_LUT73H_LO                (0x3FFFFu<<0)
#define GFXMMU_LUT73H_LO_0              (0x1u<<0)

// LUT74L Configuration

#define GFXMMU_LUT74L_LVB               (0xFFu<<16)
#define GFXMMU_LUT74L_LVB_0             (0x1u<<16)
#define GFXMMU_LUT74L_FVB               (0xFFu<<8)
#define GFXMMU_LUT74L_FVB_0             (0x1u<<8)
#define GFXMMU_LUT74L_EN                (0x1u<<0)

#define GFXMMU_LUT74L_EN_B_0X0          (0x0u<<0)
#define GFXMMU_LUT74L_EN_B_0X1          (0x1u<<0)

// LUT74H Configuration

#define GFXMMU_LUT74H_LO                (0x3FFFFu<<0)
#define GFXMMU_LUT74H_LO_0              (0x1u<<0)

// LUT75L Configuration

#define GFXMMU_LUT75L_LVB               (0xFFu<<16)
#define GFXMMU_LUT75L_LVB_0             (0x1u<<16)
#define GFXMMU_LUT75L_FVB               (0xFFu<<8)
#define GFXMMU_LUT75L_FVB_0             (0x1u<<8)
#define GFXMMU_LUT75L_EN                (0x1u<<0)

#define GFXMMU_LUT75L_EN_B_0X0          (0x0u<<0)
#define GFXMMU_LUT75L_EN_B_0X1          (0x1u<<0)

// LUT75H Configuration

#define GFXMMU_LUT75H_LO                (0x3FFFFu<<0)
#define GFXMMU_LUT75H_LO_0              (0x1u<<0)

// LUT76L Configuration

#define GFXMMU_LUT76L_LVB               (0xFFu<<16)
#define GFXMMU_LUT76L_LVB_0             (0x1u<<16)
#define GFXMMU_LUT76L_FVB               (0xFFu<<8)
#define GFXMMU_LUT76L_FVB_0             (0x1u<<8)
#define GFXMMU_LUT76L_EN                (0x1u<<0)

#define GFXMMU_LUT76L_EN_B_0X0          (0x0u<<0)
#define GFXMMU_LUT76L_EN_B_0X1          (0x1u<<0)

// LUT76H Configuration

#define GFXMMU_LUT76H_LO                (0x3FFFFu<<0)
#define GFXMMU_LUT76H_LO_0              (0x1u<<0)

// LUT77L Configuration

#define GFXMMU_LUT77L_LVB               (0xFFu<<16)
#define GFXMMU_LUT77L_LVB_0             (0x1u<<16)
#define GFXMMU_LUT77L_FVB               (0xFFu<<8)
#define GFXMMU_LUT77L_FVB_0             (0x1u<<8)
#define GFXMMU_LUT77L_EN                (0x1u<<0)

#define GFXMMU_LUT77L_EN_B_0X0          (0x0u<<0)
#define GFXMMU_LUT77L_EN_B_0X1          (0x1u<<0)

// LUT77H Configuration

#define GFXMMU_LUT77H_LO                (0x3FFFFu<<0)
#define GFXMMU_LUT77H_LO_0              (0x1u<<0)

// LUT78L Configuration

#define GFXMMU_LUT78L_LVB               (0xFFu<<16)
#define GFXMMU_LUT78L_LVB_0             (0x1u<<16)
#define GFXMMU_LUT78L_FVB               (0xFFu<<8)
#define GFXMMU_LUT78L_FVB_0             (0x1u<<8)
#define GFXMMU_LUT78L_EN                (0x1u<<0)

#define GFXMMU_LUT78L_EN_B_0X0          (0x0u<<0)
#define GFXMMU_LUT78L_EN_B_0X1          (0x1u<<0)

// LUT78H Configuration

#define GFXMMU_LUT78H_LO                (0x3FFFFu<<0)
#define GFXMMU_LUT78H_LO_0              (0x1u<<0)

// LUT79L Configuration

#define GFXMMU_LUT79L_LVB               (0xFFu<<16)
#define GFXMMU_LUT79L_LVB_0             (0x1u<<16)
#define GFXMMU_LUT79L_FVB               (0xFFu<<8)
#define GFXMMU_LUT79L_FVB_0             (0x1u<<8)
#define GFXMMU_LUT79L_EN                (0x1u<<0)

#define GFXMMU_LUT79L_EN_B_0X0          (0x0u<<0)
#define GFXMMU_LUT79L_EN_B_0X1          (0x1u<<0)

// LUT79H Configuration

#define GFXMMU_LUT79H_LO                (0x3FFFFu<<0)
#define GFXMMU_LUT79H_LO_0              (0x1u<<0)

// LUT80L Configuration

#define GFXMMU_LUT80L_LVB               (0xFFu<<16)
#define GFXMMU_LUT80L_LVB_0             (0x1u<<16)
#define GFXMMU_LUT80L_FVB               (0xFFu<<8)
#define GFXMMU_LUT80L_FVB_0             (0x1u<<8)
#define GFXMMU_LUT80L_EN                (0x1u<<0)

