Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_gfxmmu.h
// LUT92H Configuration

#define GFXMMU_LUT92H_LO                (0x3FFFFu<<0)
#define GFXMMU_LUT92H_LO_0              (0x1u<<0)

// LUT93L Configuration

#define GFXMMU_LUT93L_LVB               (0xFFu<<16)
#define GFXMMU_LUT93L_LVB_0             (0x1u<<16)
#define GFXMMU_LUT93L_FVB               (0xFFu<<8)
#define GFXMMU_LUT93L_FVB_0             (0x1u<<8)
#define GFXMMU_LUT93L_EN                (0x1u<<0)

#define GFXMMU_LUT93L_EN_B_0X0          (0x0u<<0)
#define GFXMMU_LUT93L_EN_B_0X1          (0x1u<<0)

// LUT93H Configuration

#define GFXMMU_LUT93H_LO                (0x3FFFFu<<0)
#define GFXMMU_LUT93H_LO_0              (0x1u<<0)

// LUT94L Configuration

#define GFXMMU_LUT94L_LVB               (0xFFu<<16)
#define GFXMMU_LUT94L_LVB_0             (0x1u<<16)
#define GFXMMU_LUT94L_FVB               (0xFFu<<8)
#define GFXMMU_LUT94L_FVB_0             (0x1u<<8)
#define GFXMMU_LUT94L_EN                (0x1u<<0)

#define GFXMMU_LUT94L_EN_B_0X0          (0x0u<<0)
#define GFXMMU_LUT94L_EN_B_0X1          (0x1u<<0)

// LUT94H Configuration

#define GFXMMU_LUT94H_LO                (0x3FFFFu<<0)
#define GFXMMU_LUT94H_LO_0              (0x1u<<0)

// LUT95L Configuration

#define GFXMMU_LUT95L_LVB               (0xFFu<<16)
#define GFXMMU_LUT95L_LVB_0             (0x1u<<16)
#define GFXMMU_LUT95L_FVB               (0xFFu<<8)
#define GFXMMU_LUT95L_FVB_0             (0x1u<<8)
#define GFXMMU_LUT95L_EN                (0x1u<<0)

#define GFXMMU_LUT95L_EN_B_0X0          (0x0u<<0)
#define GFXMMU_LUT95L_EN_B_0X1          (0x1u<<0)

// LUT95H Configuration

#define GFXMMU_LUT95H_LO                (0x3FFFFu<<0)
#define GFXMMU_LUT95H_LO_0              (0x1u<<0)

// LUT96L Configuration

#define GFXMMU_LUT96L_LVB               (0xFFu<<16)
#define GFXMMU_LUT96L_LVB_0             (0x1u<<16)
#define GFXMMU_LUT96L_FVB               (0xFFu<<8)
#define GFXMMU_LUT96L_FVB_0             (0x1u<<8)
#define GFXMMU_LUT96L_EN                (0x1u<<0)

#define GFXMMU_LUT96L_EN_B_0X0          (0x0u<<0)
#define GFXMMU_LUT96L_EN_B_0X1          (0x1u<<0)

// LUT96H Configuration

#define GFXMMU_LUT96H_LO                (0x3FFFFu<<0)
#define GFXMMU_LUT96H_LO_0              (0x1u<<0)

// LUT97L Configuration

#define GFXMMU_LUT97L_LVB               (0xFFu<<16)
#define GFXMMU_LUT97L_LVB_0             (0x1u<<16)
#define GFXMMU_LUT97L_FVB               (0xFFu<<8)
#define GFXMMU_LUT97L_FVB_0             (0x1u<<8)
#define GFXMMU_LUT97L_EN                (0x1u<<0)

#define GFXMMU_LUT97L_EN_B_0X0          (0x0u<<0)
#define GFXMMU_LUT97L_EN_B_0X1          (0x1u<<0)

// LUT97H Configuration

#define GFXMMU_LUT97H_LO                (0x3FFFFu<<0)
#define GFXMMU_LUT97H_LO_0              (0x1u<<0)

// LUT98L Configuration

#define GFXMMU_LUT98L_LVB               (0xFFu<<16)
#define GFXMMU_LUT98L_LVB_0             (0x1u<<16)
#define GFXMMU_LUT98L_FVB               (0xFFu<<8)
#define GFXMMU_LUT98L_FVB_0             (0x1u<<8)
#define GFXMMU_LUT98L_EN                (0x1u<<0)

#define GFXMMU_LUT98L_EN_B_0X0          (0x0u<<0)
#define GFXMMU_LUT98L_EN_B_0X1          (0x1u<<0)

// LUT98H Configuration

#define GFXMMU_LUT98H_LO                (0x3FFFFu<<0)
#define GFXMMU_LUT98H_LO_0              (0x1u<<0)

// LUT99L Configuration

#define GFXMMU_LUT99L_LVB               (0xFFu<<16)
#define GFXMMU_LUT99L_LVB_0             (0x1u<<16)
#define GFXMMU_LUT99L_FVB               (0xFFu<<8)
#define GFXMMU_LUT99L_FVB_0             (0x1u<<8)
#define GFXMMU_LUT99L_EN                (0x1u<<0)

#define GFXMMU_LUT99L_EN_B_0X0          (0x0u<<0)
#define GFXMMU_LUT99L_EN_B_0X1          (0x1u<<0)

// LUT99H Configuration

#define GFXMMU_LUT99H_LO                (0x3FFFFu<<0)
#define GFXMMU_LUT99H_LO_0              (0x1u<<0)

// LUT100L Configuration

#define GFXMMU_LUT100L_LVB              (0xFFu<<16)
#define GFXMMU_LUT100L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT100L_FVB              (0xFFu<<8)
#define GFXMMU_LUT100L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT100L_EN               (0x1u<<0)

#define GFXMMU_LUT100L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT100L_EN_B_0X1         (0x1u<<0)

// LUT100H Configuration

#define GFXMMU_LUT100H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT100H_LO_0             (0x1u<<0)

// LUT101L Configuration

#define GFXMMU_LUT101L_LVB              (0xFFu<<16)
#define GFXMMU_LUT101L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT101L_FVB              (0xFFu<<8)
#define GFXMMU_LUT101L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT101L_EN               (0x1u<<0)

#define GFXMMU_LUT101L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT101L_EN_B_0X1         (0x1u<<0)

// LUT101H Configuration

#define GFXMMU_LUT101H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT101H_LO_0             (0x1u<<0)

// LUT102L Configuration

#define GFXMMU_LUT102L_LVB              (0xFFu<<16)
#define GFXMMU_LUT102L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT102L_FVB              (0xFFu<<8)
#define GFXMMU_LUT102L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT102L_EN               (0x1u<<0)

#define GFXMMU_LUT102L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT102L_EN_B_0X1         (0x1u<<0)

// LUT102H Configuration

#define GFXMMU_LUT102H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT102H_LO_0             (0x1u<<0)

// LUT103L Configuration

#define GFXMMU_LUT103L_LVB              (0xFFu<<16)
#define GFXMMU_LUT103L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT103L_FVB              (0xFFu<<8)
#define GFXMMU_LUT103L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT103L_EN               (0x1u<<0)

#define GFXMMU_LUT103L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT103L_EN_B_0X1         (0x1u<<0)

// LUT103H Configuration

#define GFXMMU_LUT103H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT103H_LO_0             (0x1u<<0)

// LUT104L Configuration

#define GFXMMU_LUT104L_LVB              (0xFFu<<16)
#define GFXMMU_LUT104L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT104L_FVB              (0xFFu<<8)
#define GFXMMU_LUT104L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT104L_EN               (0x1u<<0)

