Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_gfxmmu.h
#define GFXMMU_LUT104L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT104L_EN_B_0X1         (0x1u<<0)

// LUT104H Configuration

#define GFXMMU_LUT104H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT104H_LO_0             (0x1u<<0)

// LUT105L Configuration

#define GFXMMU_LUT105L_LVB              (0xFFu<<16)
#define GFXMMU_LUT105L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT105L_FVB              (0xFFu<<8)
#define GFXMMU_LUT105L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT105L_EN               (0x1u<<0)

#define GFXMMU_LUT105L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT105L_EN_B_0X1         (0x1u<<0)

// LUT105H Configuration

#define GFXMMU_LUT105H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT105H_LO_0             (0x1u<<0)

// LUT106L Configuration

#define GFXMMU_LUT106L_LVB              (0xFFu<<16)
#define GFXMMU_LUT106L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT106L_FVB              (0xFFu<<8)
#define GFXMMU_LUT106L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT106L_EN               (0x1u<<0)

#define GFXMMU_LUT106L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT106L_EN_B_0X1         (0x1u<<0)

// LUT106H Configuration

#define GFXMMU_LUT106H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT106H_LO_0             (0x1u<<0)

// LUT107L Configuration

#define GFXMMU_LUT107L_LVB              (0xFFu<<16)
#define GFXMMU_LUT107L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT107L_FVB              (0xFFu<<8)
#define GFXMMU_LUT107L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT107L_EN               (0x1u<<0)

#define GFXMMU_LUT107L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT107L_EN_B_0X1         (0x1u<<0)

// LUT107H Configuration

#define GFXMMU_LUT107H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT107H_LO_0             (0x1u<<0)

// LUT108L Configuration

#define GFXMMU_LUT108L_LVB              (0xFFu<<16)
#define GFXMMU_LUT108L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT108L_FVB              (0xFFu<<8)
#define GFXMMU_LUT108L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT108L_EN               (0x1u<<0)

#define GFXMMU_LUT108L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT108L_EN_B_0X1         (0x1u<<0)

// LUT108H Configuration

#define GFXMMU_LUT108H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT108H_LO_0             (0x1u<<0)

// LUT109L Configuration

#define GFXMMU_LUT109L_LVB              (0xFFu<<16)
#define GFXMMU_LUT109L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT109L_FVB              (0xFFu<<8)
#define GFXMMU_LUT109L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT109L_EN               (0x1u<<0)

#define GFXMMU_LUT109L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT109L_EN_B_0X1         (0x1u<<0)

// LUT109H Configuration

#define GFXMMU_LUT109H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT109H_LO_0             (0x1u<<0)

// LUT110L Configuration

#define GFXMMU_LUT110L_LVB              (0xFFu<<16)
#define GFXMMU_LUT110L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT110L_FVB              (0xFFu<<8)
#define GFXMMU_LUT110L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT110L_EN               (0x1u<<0)

#define GFXMMU_LUT110L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT110L_EN_B_0X1         (0x1u<<0)

// LUT110H Configuration

#define GFXMMU_LUT110H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT110H_LO_0             (0x1u<<0)

// LUT111L Configuration

#define GFXMMU_LUT111L_LVB              (0xFFu<<16)
#define GFXMMU_LUT111L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT111L_FVB              (0xFFu<<8)
#define GFXMMU_LUT111L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT111L_EN               (0x1u<<0)

#define GFXMMU_LUT111L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT111L_EN_B_0X1         (0x1u<<0)

// LUT111H Configuration

#define GFXMMU_LUT111H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT111H_LO_0             (0x1u<<0)

// LUT112L Configuration

#define GFXMMU_LUT112L_LVB              (0xFFu<<16)
#define GFXMMU_LUT112L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT112L_FVB              (0xFFu<<8)
#define GFXMMU_LUT112L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT112L_EN               (0x1u<<0)

#define GFXMMU_LUT112L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT112L_EN_B_0X1         (0x1u<<0)

// LUT112H Configuration

#define GFXMMU_LUT112H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT112H_LO_0             (0x1u<<0)

// LUT113L Configuration

#define GFXMMU_LUT113L_LVB              (0xFFu<<16)
#define GFXMMU_LUT113L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT113L_FVB              (0xFFu<<8)
#define GFXMMU_LUT113L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT113L_EN               (0x1u<<0)

#define GFXMMU_LUT113L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT113L_EN_B_0X1         (0x1u<<0)

// LUT113H Configuration

#define GFXMMU_LUT113H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT113H_LO_0             (0x1u<<0)

// LUT114L Configuration

#define GFXMMU_LUT114L_LVB              (0xFFu<<16)
#define GFXMMU_LUT114L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT114L_FVB              (0xFFu<<8)
#define GFXMMU_LUT114L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT114L_EN               (0x1u<<0)

#define GFXMMU_LUT114L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT114L_EN_B_0X1         (0x1u<<0)

// LUT114H Configuration

#define GFXMMU_LUT114H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT114H_LO_0             (0x1u<<0)

// LUT115L Configuration

#define GFXMMU_LUT115L_LVB              (0xFFu<<16)
#define GFXMMU_LUT115L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT115L_FVB              (0xFFu<<8)
#define GFXMMU_LUT115L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT115L_EN               (0x1u<<0)

#define GFXMMU_LUT115L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT115L_EN_B_0X1         (0x1u<<0)

// LUT115H Configuration

#define GFXMMU_LUT115H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT115H_LO_0             (0x1u<<0)

// LUT116L Configuration

#define GFXMMU_LUT116L_LVB              (0xFFu<<16)
#define GFXMMU_LUT116L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT116L_FVB              (0xFFu<<8)
#define GFXMMU_LUT116L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT116L_EN               (0x1u<<0)

