Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_gfxmmu.h
#define GFXMMU_LUT116L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT116L_EN_B_0X1         (0x1u<<0)

// LUT116H Configuration

#define GFXMMU_LUT116H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT116H_LO_0             (0x1u<<0)

// LUT117L Configuration

#define GFXMMU_LUT117L_LVB              (0xFFu<<16)
#define GFXMMU_LUT117L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT117L_FVB              (0xFFu<<8)
#define GFXMMU_LUT117L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT117L_EN               (0x1u<<0)

#define GFXMMU_LUT117L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT117L_EN_B_0X1         (0x1u<<0)

// LUT117H Configuration

#define GFXMMU_LUT117H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT117H_LO_0             (0x1u<<0)

// LUT118L Configuration

#define GFXMMU_LUT118L_LVB              (0xFFu<<16)
#define GFXMMU_LUT118L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT118L_FVB              (0xFFu<<8)
#define GFXMMU_LUT118L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT118L_EN               (0x1u<<0)

#define GFXMMU_LUT118L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT118L_EN_B_0X1         (0x1u<<0)

// LUT118H Configuration

#define GFXMMU_LUT118H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT118H_LO_0             (0x1u<<0)

// LUT119L Configuration

#define GFXMMU_LUT119L_LVB              (0xFFu<<16)
#define GFXMMU_LUT119L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT119L_FVB              (0xFFu<<8)
#define GFXMMU_LUT119L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT119L_EN               (0x1u<<0)

#define GFXMMU_LUT119L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT119L_EN_B_0X1         (0x1u<<0)

// LUT119H Configuration

#define GFXMMU_LUT119H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT119H_LO_0             (0x1u<<0)

// LUT120L Configuration

#define GFXMMU_LUT120L_LVB              (0xFFu<<16)
#define GFXMMU_LUT120L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT120L_FVB              (0xFFu<<8)
#define GFXMMU_LUT120L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT120L_EN               (0x1u<<0)

#define GFXMMU_LUT120L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT120L_EN_B_0X1         (0x1u<<0)

// LUT120H Configuration

#define GFXMMU_LUT120H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT120H_LO_0             (0x1u<<0)

// LUT121L Configuration

#define GFXMMU_LUT121L_LVB              (0xFFu<<16)
#define GFXMMU_LUT121L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT121L_FVB              (0xFFu<<8)
#define GFXMMU_LUT121L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT121L_EN               (0x1u<<0)

#define GFXMMU_LUT121L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT121L_EN_B_0X1         (0x1u<<0)

// LUT121H Configuration

#define GFXMMU_LUT121H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT121H_LO_0             (0x1u<<0)

// LUT122L Configuration

#define GFXMMU_LUT122L_LVB              (0xFFu<<16)
#define GFXMMU_LUT122L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT122L_FVB              (0xFFu<<8)
#define GFXMMU_LUT122L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT122L_EN               (0x1u<<0)

#define GFXMMU_LUT122L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT122L_EN_B_0X1         (0x1u<<0)

// LUT122H Configuration

#define GFXMMU_LUT122H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT122H_LO_0             (0x1u<<0)

// LUT123L Configuration

#define GFXMMU_LUT123L_LVB              (0xFFu<<16)
#define GFXMMU_LUT123L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT123L_FVB              (0xFFu<<8)
#define GFXMMU_LUT123L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT123L_EN               (0x1u<<0)

#define GFXMMU_LUT123L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT123L_EN_B_0X1         (0x1u<<0)

// LUT123H Configuration

#define GFXMMU_LUT123H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT123H_LO_0             (0x1u<<0)

// LUT124L Configuration

#define GFXMMU_LUT124L_LVB              (0xFFu<<16)
#define GFXMMU_LUT124L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT124L_FVB              (0xFFu<<8)
#define GFXMMU_LUT124L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT124L_EN               (0x1u<<0)

#define GFXMMU_LUT124L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT124L_EN_B_0X1         (0x1u<<0)

// LUT124H Configuration

#define GFXMMU_LUT124H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT124H_LO_0             (0x1u<<0)

// LUT125L Configuration

#define GFXMMU_LUT125L_LVB              (0xFFu<<16)
#define GFXMMU_LUT125L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT125L_FVB              (0xFFu<<8)
#define GFXMMU_LUT125L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT125L_EN               (0x1u<<0)

#define GFXMMU_LUT125L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT125L_EN_B_0X1         (0x1u<<0)

// LUT125H Configuration

#define GFXMMU_LUT125H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT125H_LO_0             (0x1u<<0)

// LUT126L Configuration

#define GFXMMU_LUT126L_LVB              (0xFFu<<16)
#define GFXMMU_LUT126L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT126L_FVB              (0xFFu<<8)
#define GFXMMU_LUT126L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT126L_EN               (0x1u<<0)

#define GFXMMU_LUT126L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT126L_EN_B_0X1         (0x1u<<0)

// LUT126H Configuration

#define GFXMMU_LUT126H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT126H_LO_0             (0x1u<<0)

// LUT127L Configuration

#define GFXMMU_LUT127L_LVB              (0xFFu<<16)
#define GFXMMU_LUT127L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT127L_FVB              (0xFFu<<8)
#define GFXMMU_LUT127L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT127L_EN               (0x1u<<0)

#define GFXMMU_LUT127L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT127L_EN_B_0X1         (0x1u<<0)

// LUT127H Configuration

#define GFXMMU_LUT127H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT127H_LO_0             (0x1u<<0)

// LUT128L Configuration

#define GFXMMU_LUT128L_LVB              (0xFFu<<16)
#define GFXMMU_LUT128L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT128L_FVB              (0xFFu<<8)
#define GFXMMU_LUT128L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT128L_EN               (0x1u<<0)

#define GFXMMU_LUT128L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT128L_EN_B_0X1         (0x1u<<0)

// LUT128H Configuration

