Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_gfxmmu.h
#define GFXMMU_LUT128H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT128H_LO_0             (0x1u<<0)

// LUT129L Configuration

#define GFXMMU_LUT129L_LVB              (0xFFu<<16)
#define GFXMMU_LUT129L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT129L_FVB              (0xFFu<<8)
#define GFXMMU_LUT129L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT129L_EN               (0x1u<<0)

#define GFXMMU_LUT129L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT129L_EN_B_0X1         (0x1u<<0)

// LUT129H Configuration

#define GFXMMU_LUT129H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT129H_LO_0             (0x1u<<0)

// LUT130L Configuration

#define GFXMMU_LUT130L_LVB              (0xFFu<<16)
#define GFXMMU_LUT130L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT130L_FVB              (0xFFu<<8)
#define GFXMMU_LUT130L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT130L_EN               (0x1u<<0)

#define GFXMMU_LUT130L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT130L_EN_B_0X1         (0x1u<<0)

// LUT130H Configuration

#define GFXMMU_LUT130H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT130H_LO_0             (0x1u<<0)

// LUT131L Configuration

#define GFXMMU_LUT131L_LVB              (0xFFu<<16)
#define GFXMMU_LUT131L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT131L_FVB              (0xFFu<<8)
#define GFXMMU_LUT131L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT131L_EN               (0x1u<<0)

#define GFXMMU_LUT131L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT131L_EN_B_0X1         (0x1u<<0)

// LUT131H Configuration

#define GFXMMU_LUT131H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT131H_LO_0             (0x1u<<0)

// LUT132L Configuration

#define GFXMMU_LUT132L_LVB              (0xFFu<<16)
#define GFXMMU_LUT132L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT132L_FVB              (0xFFu<<8)
#define GFXMMU_LUT132L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT132L_EN               (0x1u<<0)

#define GFXMMU_LUT132L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT132L_EN_B_0X1         (0x1u<<0)

// LUT132H Configuration

#define GFXMMU_LUT132H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT132H_LO_0             (0x1u<<0)

// LUT133L Configuration

#define GFXMMU_LUT133L_LVB              (0xFFu<<16)
#define GFXMMU_LUT133L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT133L_FVB              (0xFFu<<8)
#define GFXMMU_LUT133L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT133L_EN               (0x1u<<0)

#define GFXMMU_LUT133L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT133L_EN_B_0X1         (0x1u<<0)

// LUT133H Configuration

#define GFXMMU_LUT133H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT133H_LO_0             (0x1u<<0)

// LUT134L Configuration

#define GFXMMU_LUT134L_LVB              (0xFFu<<16)
#define GFXMMU_LUT134L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT134L_FVB              (0xFFu<<8)
#define GFXMMU_LUT134L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT134L_EN               (0x1u<<0)

#define GFXMMU_LUT134L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT134L_EN_B_0X1         (0x1u<<0)

// LUT134H Configuration

#define GFXMMU_LUT134H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT134H_LO_0             (0x1u<<0)

// LUT135L Configuration

#define GFXMMU_LUT135L_LVB              (0xFFu<<16)
#define GFXMMU_LUT135L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT135L_FVB              (0xFFu<<8)
#define GFXMMU_LUT135L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT135L_EN               (0x1u<<0)

#define GFXMMU_LUT135L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT135L_EN_B_0X1         (0x1u<<0)

// LUT135H Configuration

#define GFXMMU_LUT135H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT135H_LO_0             (0x1u<<0)

// LUT136L Configuration

#define GFXMMU_LUT136L_LVB              (0xFFu<<16)
#define GFXMMU_LUT136L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT136L_FVB              (0xFFu<<8)
#define GFXMMU_LUT136L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT136L_EN               (0x1u<<0)

#define GFXMMU_LUT136L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT136L_EN_B_0X1         (0x1u<<0)

// LUT136H Configuration

#define GFXMMU_LUT136H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT136H_LO_0             (0x1u<<0)

// LUT137L Configuration

#define GFXMMU_LUT137L_LVB              (0xFFu<<16)
#define GFXMMU_LUT137L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT137L_FVB              (0xFFu<<8)
#define GFXMMU_LUT137L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT137L_EN               (0x1u<<0)

#define GFXMMU_LUT137L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT137L_EN_B_0X1         (0x1u<<0)

// LUT137H Configuration

#define GFXMMU_LUT137H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT137H_LO_0             (0x1u<<0)

// LUT138L Configuration

#define GFXMMU_LUT138L_LVB              (0xFFu<<16)
#define GFXMMU_LUT138L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT138L_FVB              (0xFFu<<8)
#define GFXMMU_LUT138L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT138L_EN               (0x1u<<0)

#define GFXMMU_LUT138L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT138L_EN_B_0X1         (0x1u<<0)

// LUT138H Configuration

#define GFXMMU_LUT138H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT138H_LO_0             (0x1u<<0)

// LUT139L Configuration

#define GFXMMU_LUT139L_LVB              (0xFFu<<16)
#define GFXMMU_LUT139L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT139L_FVB              (0xFFu<<8)
#define GFXMMU_LUT139L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT139L_EN               (0x1u<<0)

#define GFXMMU_LUT139L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT139L_EN_B_0X1         (0x1u<<0)

// LUT139H Configuration

#define GFXMMU_LUT139H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT139H_LO_0             (0x1u<<0)

// LUT140L Configuration

#define GFXMMU_LUT140L_LVB              (0xFFu<<16)
#define GFXMMU_LUT140L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT140L_FVB              (0xFFu<<8)
#define GFXMMU_LUT140L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT140L_EN               (0x1u<<0)

#define GFXMMU_LUT140L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT140L_EN_B_0X1         (0x1u<<0)

