Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_gfxmmu.h
// LUT140H Configuration

#define GFXMMU_LUT140H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT140H_LO_0             (0x1u<<0)

// LUT141L Configuration

#define GFXMMU_LUT141L_LVB              (0xFFu<<16)
#define GFXMMU_LUT141L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT141L_FVB              (0xFFu<<8)
#define GFXMMU_LUT141L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT141L_EN               (0x1u<<0)

#define GFXMMU_LUT141L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT141L_EN_B_0X1         (0x1u<<0)

// LUT141H Configuration

#define GFXMMU_LUT141H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT141H_LO_0             (0x1u<<0)

// LUT142L Configuration

#define GFXMMU_LUT142L_LVB              (0xFFu<<16)
#define GFXMMU_LUT142L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT142L_FVB              (0xFFu<<8)
#define GFXMMU_LUT142L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT142L_EN               (0x1u<<0)

#define GFXMMU_LUT142L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT142L_EN_B_0X1         (0x1u<<0)

// LUT142H Configuration

#define GFXMMU_LUT142H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT142H_LO_0             (0x1u<<0)

// LUT143L Configuration

#define GFXMMU_LUT143L_LVB              (0xFFu<<16)
#define GFXMMU_LUT143L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT143L_FVB              (0xFFu<<8)
#define GFXMMU_LUT143L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT143L_EN               (0x1u<<0)

#define GFXMMU_LUT143L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT143L_EN_B_0X1         (0x1u<<0)

// LUT143H Configuration

#define GFXMMU_LUT143H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT143H_LO_0             (0x1u<<0)

// LUT144L Configuration

#define GFXMMU_LUT144L_LVB              (0xFFu<<16)
#define GFXMMU_LUT144L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT144L_FVB              (0xFFu<<8)
#define GFXMMU_LUT144L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT144L_EN               (0x1u<<0)

#define GFXMMU_LUT144L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT144L_EN_B_0X1         (0x1u<<0)

// LUT144H Configuration

#define GFXMMU_LUT144H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT144H_LO_0             (0x1u<<0)

// LUT145L Configuration

#define GFXMMU_LUT145L_LVB              (0xFFu<<16)
#define GFXMMU_LUT145L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT145L_FVB              (0xFFu<<8)
#define GFXMMU_LUT145L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT145L_EN               (0x1u<<0)

#define GFXMMU_LUT145L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT145L_EN_B_0X1         (0x1u<<0)

// LUT145H Configuration

#define GFXMMU_LUT145H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT145H_LO_0             (0x1u<<0)

// LUT146L Configuration

#define GFXMMU_LUT146L_LVB              (0xFFu<<16)
#define GFXMMU_LUT146L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT146L_FVB              (0xFFu<<8)
#define GFXMMU_LUT146L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT146L_EN               (0x1u<<0)

#define GFXMMU_LUT146L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT146L_EN_B_0X1         (0x1u<<0)

// LUT146H Configuration

#define GFXMMU_LUT146H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT146H_LO_0             (0x1u<<0)

// LUT147L Configuration

#define GFXMMU_LUT147L_LVB              (0xFFu<<16)
#define GFXMMU_LUT147L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT147L_FVB              (0xFFu<<8)
#define GFXMMU_LUT147L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT147L_EN               (0x1u<<0)

#define GFXMMU_LUT147L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT147L_EN_B_0X1         (0x1u<<0)

// LUT147H Configuration

#define GFXMMU_LUT147H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT147H_LO_0             (0x1u<<0)

// LUT148L Configuration

#define GFXMMU_LUT148L_LVB              (0xFFu<<16)
#define GFXMMU_LUT148L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT148L_FVB              (0xFFu<<8)
#define GFXMMU_LUT148L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT148L_EN               (0x1u<<0)

#define GFXMMU_LUT148L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT148L_EN_B_0X1         (0x1u<<0)

// LUT148H Configuration

#define GFXMMU_LUT148H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT148H_LO_0             (0x1u<<0)

// LUT149L Configuration

#define GFXMMU_LUT149L_LVB              (0xFFu<<16)
#define GFXMMU_LUT149L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT149L_FVB              (0xFFu<<8)
#define GFXMMU_LUT149L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT149L_EN               (0x1u<<0)

#define GFXMMU_LUT149L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT149L_EN_B_0X1         (0x1u<<0)

// LUT149H Configuration

#define GFXMMU_LUT149H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT149H_LO_0             (0x1u<<0)

// LUT150L Configuration

#define GFXMMU_LUT150L_LVB              (0xFFu<<16)
#define GFXMMU_LUT150L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT150L_FVB              (0xFFu<<8)
#define GFXMMU_LUT150L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT150L_EN               (0x1u<<0)

#define GFXMMU_LUT150L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT150L_EN_B_0X1         (0x1u<<0)

// LUT150H Configuration

#define GFXMMU_LUT150H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT150H_LO_0             (0x1u<<0)

// LUT151L Configuration

#define GFXMMU_LUT151L_LVB              (0xFFu<<16)
#define GFXMMU_LUT151L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT151L_FVB              (0xFFu<<8)
#define GFXMMU_LUT151L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT151L_EN               (0x1u<<0)

#define GFXMMU_LUT151L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT151L_EN_B_0X1         (0x1u<<0)

// LUT151H Configuration

#define GFXMMU_LUT151H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT151H_LO_0             (0x1u<<0)

// LUT152L Configuration

#define GFXMMU_LUT152L_LVB              (0xFFu<<16)
#define GFXMMU_LUT152L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT152L_FVB              (0xFFu<<8)
#define GFXMMU_LUT152L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT152L_EN               (0x1u<<0)

#define GFXMMU_LUT152L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT152L_EN_B_0X1         (0x1u<<0)

