Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_gfxmmu.h
// LUT152H Configuration

#define GFXMMU_LUT152H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT152H_LO_0             (0x1u<<0)

// LUT153L Configuration

#define GFXMMU_LUT153L_LVB              (0xFFu<<16)
#define GFXMMU_LUT153L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT153L_FVB              (0xFFu<<8)
#define GFXMMU_LUT153L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT153L_EN               (0x1u<<0)

#define GFXMMU_LUT153L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT153L_EN_B_0X1         (0x1u<<0)

// LUT153H Configuration

#define GFXMMU_LUT153H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT153H_LO_0             (0x1u<<0)

// LUT154L Configuration

#define GFXMMU_LUT154L_LVB              (0xFFu<<16)
#define GFXMMU_LUT154L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT154L_FVB              (0xFFu<<8)
#define GFXMMU_LUT154L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT154L_EN               (0x1u<<0)

#define GFXMMU_LUT154L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT154L_EN_B_0X1         (0x1u<<0)

// LUT154H Configuration

#define GFXMMU_LUT154H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT154H_LO_0             (0x1u<<0)

// LUT155L Configuration

#define GFXMMU_LUT155L_LVB              (0xFFu<<16)
#define GFXMMU_LUT155L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT155L_FVB              (0xFFu<<8)
#define GFXMMU_LUT155L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT155L_EN               (0x1u<<0)

#define GFXMMU_LUT155L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT155L_EN_B_0X1         (0x1u<<0)

// LUT155H Configuration

#define GFXMMU_LUT155H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT155H_LO_0             (0x1u<<0)

// LUT156L Configuration

#define GFXMMU_LUT156L_LVB              (0xFFu<<16)
#define GFXMMU_LUT156L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT156L_FVB              (0xFFu<<8)
#define GFXMMU_LUT156L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT156L_EN               (0x1u<<0)

#define GFXMMU_LUT156L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT156L_EN_B_0X1         (0x1u<<0)

// LUT156H Configuration

#define GFXMMU_LUT156H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT156H_LO_0             (0x1u<<0)

// LUT157L Configuration

#define GFXMMU_LUT157L_LVB              (0xFFu<<16)
#define GFXMMU_LUT157L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT157L_FVB              (0xFFu<<8)
#define GFXMMU_LUT157L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT157L_EN               (0x1u<<0)

#define GFXMMU_LUT157L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT157L_EN_B_0X1         (0x1u<<0)

// LUT157H Configuration

#define GFXMMU_LUT157H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT157H_LO_0             (0x1u<<0)

// LUT158L Configuration

#define GFXMMU_LUT158L_LVB              (0xFFu<<16)
#define GFXMMU_LUT158L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT158L_FVB              (0xFFu<<8)
#define GFXMMU_LUT158L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT158L_EN               (0x1u<<0)

#define GFXMMU_LUT158L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT158L_EN_B_0X1         (0x1u<<0)

// LUT158H Configuration

#define GFXMMU_LUT158H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT158H_LO_0             (0x1u<<0)

// LUT159L Configuration

#define GFXMMU_LUT159L_LVB              (0xFFu<<16)
#define GFXMMU_LUT159L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT159L_FVB              (0xFFu<<8)
#define GFXMMU_LUT159L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT159L_EN               (0x1u<<0)

#define GFXMMU_LUT159L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT159L_EN_B_0X1         (0x1u<<0)

// LUT159H Configuration

#define GFXMMU_LUT159H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT159H_LO_0             (0x1u<<0)

// LUT160L Configuration

#define GFXMMU_LUT160L_LVB              (0xFFu<<16)
#define GFXMMU_LUT160L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT160L_FVB              (0xFFu<<8)
#define GFXMMU_LUT160L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT160L_EN               (0x1u<<0)

#define GFXMMU_LUT160L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT160L_EN_B_0X1         (0x1u<<0)

// LUT160H Configuration

#define GFXMMU_LUT160H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT160H_LO_0             (0x1u<<0)

// LUT161L Configuration

#define GFXMMU_LUT161L_LVB              (0xFFu<<16)
#define GFXMMU_LUT161L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT161L_FVB              (0xFFu<<8)
#define GFXMMU_LUT161L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT161L_EN               (0x1u<<0)

#define GFXMMU_LUT161L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT161L_EN_B_0X1         (0x1u<<0)

// LUT161H Configuration

#define GFXMMU_LUT161H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT161H_LO_0             (0x1u<<0)

// LUT162L Configuration

#define GFXMMU_LUT162L_LVB              (0xFFu<<16)
#define GFXMMU_LUT162L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT162L_FVB              (0xFFu<<8)
#define GFXMMU_LUT162L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT162L_EN               (0x1u<<0)

#define GFXMMU_LUT162L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT162L_EN_B_0X1         (0x1u<<0)

// LUT162H Configuration

#define GFXMMU_LUT162H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT162H_LO_0             (0x1u<<0)

// LUT163L Configuration

#define GFXMMU_LUT163L_LVB              (0xFFu<<16)
#define GFXMMU_LUT163L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT163L_FVB              (0xFFu<<8)
#define GFXMMU_LUT163L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT163L_EN               (0x1u<<0)

#define GFXMMU_LUT163L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT163L_EN_B_0X1         (0x1u<<0)

// LUT163H Configuration

#define GFXMMU_LUT163H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT163H_LO_0             (0x1u<<0)

// LUT164L Configuration

#define GFXMMU_LUT164L_LVB              (0xFFu<<16)
#define GFXMMU_LUT164L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT164L_FVB              (0xFFu<<8)
#define GFXMMU_LUT164L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT164L_EN               (0x1u<<0)

