Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_gfxmmu.h
#define GFXMMU_LUT164L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT164L_EN_B_0X1         (0x1u<<0)

// LUT164H Configuration

#define GFXMMU_LUT164H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT164H_LO_0             (0x1u<<0)

// LUT165L Configuration

#define GFXMMU_LUT165L_LVB              (0xFFu<<16)
#define GFXMMU_LUT165L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT165L_FVB              (0xFFu<<8)
#define GFXMMU_LUT165L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT165L_EN               (0x1u<<0)

#define GFXMMU_LUT165L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT165L_EN_B_0X1         (0x1u<<0)

// LUT165H Configuration

#define GFXMMU_LUT165H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT165H_LO_0             (0x1u<<0)

// LUT166L Configuration

#define GFXMMU_LUT166L_LVB              (0xFFu<<16)
#define GFXMMU_LUT166L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT166L_FVB              (0xFFu<<8)
#define GFXMMU_LUT166L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT166L_EN               (0x1u<<0)

#define GFXMMU_LUT166L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT166L_EN_B_0X1         (0x1u<<0)

// LUT166H Configuration

#define GFXMMU_LUT166H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT166H_LO_0             (0x1u<<0)

// LUT167L Configuration

#define GFXMMU_LUT167L_LVB              (0xFFu<<16)
#define GFXMMU_LUT167L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT167L_FVB              (0xFFu<<8)
#define GFXMMU_LUT167L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT167L_EN               (0x1u<<0)

#define GFXMMU_LUT167L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT167L_EN_B_0X1         (0x1u<<0)

// LUT167H Configuration

#define GFXMMU_LUT167H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT167H_LO_0             (0x1u<<0)

// LUT168L Configuration

#define GFXMMU_LUT168L_LVB              (0xFFu<<16)
#define GFXMMU_LUT168L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT168L_FVB              (0xFFu<<8)
#define GFXMMU_LUT168L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT168L_EN               (0x1u<<0)

#define GFXMMU_LUT168L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT168L_EN_B_0X1         (0x1u<<0)

// LUT168H Configuration

#define GFXMMU_LUT168H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT168H_LO_0             (0x1u<<0)

// LUT169L Configuration

#define GFXMMU_LUT169L_LVB              (0xFFu<<16)
#define GFXMMU_LUT169L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT169L_FVB              (0xFFu<<8)
#define GFXMMU_LUT169L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT169L_EN               (0x1u<<0)

#define GFXMMU_LUT169L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT169L_EN_B_0X1         (0x1u<<0)

// LUT169H Configuration

#define GFXMMU_LUT169H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT169H_LO_0             (0x1u<<0)

// LUT170L Configuration

#define GFXMMU_LUT170L_LVB              (0xFFu<<16)
#define GFXMMU_LUT170L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT170L_FVB              (0xFFu<<8)
#define GFXMMU_LUT170L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT170L_EN               (0x1u<<0)

#define GFXMMU_LUT170L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT170L_EN_B_0X1         (0x1u<<0)

// LUT170H Configuration

#define GFXMMU_LUT170H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT170H_LO_0             (0x1u<<0)

// LUT171L Configuration

#define GFXMMU_LUT171L_LVB              (0xFFu<<16)
#define GFXMMU_LUT171L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT171L_FVB              (0xFFu<<8)
#define GFXMMU_LUT171L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT171L_EN               (0x1u<<0)

#define GFXMMU_LUT171L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT171L_EN_B_0X1         (0x1u<<0)

// LUT171H Configuration

#define GFXMMU_LUT171H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT171H_LO_0             (0x1u<<0)

// LUT172L Configuration

#define GFXMMU_LUT172L_LVB              (0xFFu<<16)
#define GFXMMU_LUT172L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT172L_FVB              (0xFFu<<8)
#define GFXMMU_LUT172L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT172L_EN               (0x1u<<0)

#define GFXMMU_LUT172L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT172L_EN_B_0X1         (0x1u<<0)

// LUT172H Configuration

#define GFXMMU_LUT172H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT172H_LO_0             (0x1u<<0)

// LUT173L Configuration

#define GFXMMU_LUT173L_LVB              (0xFFu<<16)
#define GFXMMU_LUT173L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT173L_FVB              (0xFFu<<8)
#define GFXMMU_LUT173L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT173L_EN               (0x1u<<0)

#define GFXMMU_LUT173L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT173L_EN_B_0X1         (0x1u<<0)

// LUT173H Configuration

#define GFXMMU_LUT173H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT173H_LO_0             (0x1u<<0)

// LUT174L Configuration

#define GFXMMU_LUT174L_LVB              (0xFFu<<16)
#define GFXMMU_LUT174L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT174L_FVB              (0xFFu<<8)
#define GFXMMU_LUT174L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT174L_EN               (0x1u<<0)

#define GFXMMU_LUT174L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT174L_EN_B_0X1         (0x1u<<0)

// LUT174H Configuration

#define GFXMMU_LUT174H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT174H_LO_0             (0x1u<<0)

// LUT175L Configuration

#define GFXMMU_LUT175L_LVB              (0xFFu<<16)
#define GFXMMU_LUT175L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT175L_FVB              (0xFFu<<8)
#define GFXMMU_LUT175L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT175L_EN               (0x1u<<0)

#define GFXMMU_LUT175L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT175L_EN_B_0X1         (0x1u<<0)

// LUT175H Configuration

#define GFXMMU_LUT175H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT175H_LO_0             (0x1u<<0)

// LUT176L Configuration

#define GFXMMU_LUT176L_LVB              (0xFFu<<16)
#define GFXMMU_LUT176L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT176L_FVB              (0xFFu<<8)
#define GFXMMU_LUT176L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT176L_EN               (0x1u<<0)

