Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_gfxmmu.h
#define GFXMMU_LUT176L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT176L_EN_B_0X1         (0x1u<<0)

// LUT176H Configuration

#define GFXMMU_LUT176H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT176H_LO_0             (0x1u<<0)

// LUT177L Configuration

#define GFXMMU_LUT177L_LVB              (0xFFu<<16)
#define GFXMMU_LUT177L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT177L_FVB              (0xFFu<<8)
#define GFXMMU_LUT177L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT177L_EN               (0x1u<<0)

#define GFXMMU_LUT177L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT177L_EN_B_0X1         (0x1u<<0)

// LUT177H Configuration

#define GFXMMU_LUT177H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT177H_LO_0             (0x1u<<0)

// LUT178L Configuration

#define GFXMMU_LUT178L_LVB              (0xFFu<<16)
#define GFXMMU_LUT178L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT178L_FVB              (0xFFu<<8)
#define GFXMMU_LUT178L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT178L_EN               (0x1u<<0)

#define GFXMMU_LUT178L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT178L_EN_B_0X1         (0x1u<<0)

// LUT178H Configuration

#define GFXMMU_LUT178H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT178H_LO_0             (0x1u<<0)

// LUT179L Configuration

#define GFXMMU_LUT179L_LVB              (0xFFu<<16)
#define GFXMMU_LUT179L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT179L_FVB              (0xFFu<<8)
#define GFXMMU_LUT179L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT179L_EN               (0x1u<<0)

#define GFXMMU_LUT179L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT179L_EN_B_0X1         (0x1u<<0)

// LUT179H Configuration

#define GFXMMU_LUT179H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT179H_LO_0             (0x1u<<0)

// LUT180L Configuration

#define GFXMMU_LUT180L_LVB              (0xFFu<<16)
#define GFXMMU_LUT180L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT180L_FVB              (0xFFu<<8)
#define GFXMMU_LUT180L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT180L_EN               (0x1u<<0)

#define GFXMMU_LUT180L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT180L_EN_B_0X1         (0x1u<<0)

// LUT180H Configuration

#define GFXMMU_LUT180H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT180H_LO_0             (0x1u<<0)

// LUT181L Configuration

#define GFXMMU_LUT181L_LVB              (0xFFu<<16)
#define GFXMMU_LUT181L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT181L_FVB              (0xFFu<<8)
#define GFXMMU_LUT181L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT181L_EN               (0x1u<<0)

#define GFXMMU_LUT181L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT181L_EN_B_0X1         (0x1u<<0)

// LUT181H Configuration

#define GFXMMU_LUT181H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT181H_LO_0             (0x1u<<0)

// LUT182L Configuration

#define GFXMMU_LUT182L_LVB              (0xFFu<<16)
#define GFXMMU_LUT182L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT182L_FVB              (0xFFu<<8)
#define GFXMMU_LUT182L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT182L_EN               (0x1u<<0)

#define GFXMMU_LUT182L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT182L_EN_B_0X1         (0x1u<<0)

// LUT182H Configuration

#define GFXMMU_LUT182H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT182H_LO_0             (0x1u<<0)

// LUT183L Configuration

#define GFXMMU_LUT183L_LVB              (0xFFu<<16)
#define GFXMMU_LUT183L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT183L_FVB              (0xFFu<<8)
#define GFXMMU_LUT183L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT183L_EN               (0x1u<<0)

#define GFXMMU_LUT183L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT183L_EN_B_0X1         (0x1u<<0)

// LUT183H Configuration

#define GFXMMU_LUT183H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT183H_LO_0             (0x1u<<0)

// LUT184L Configuration

#define GFXMMU_LUT184L_LVB              (0xFFu<<16)
#define GFXMMU_LUT184L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT184L_FVB              (0xFFu<<8)
#define GFXMMU_LUT184L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT184L_EN               (0x1u<<0)

#define GFXMMU_LUT184L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT184L_EN_B_0X1         (0x1u<<0)

// LUT184H Configuration

#define GFXMMU_LUT184H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT184H_LO_0             (0x1u<<0)

// LUT185L Configuration

#define GFXMMU_LUT185L_LVB              (0xFFu<<16)
#define GFXMMU_LUT185L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT185L_FVB              (0xFFu<<8)
#define GFXMMU_LUT185L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT185L_EN               (0x1u<<0)

#define GFXMMU_LUT185L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT185L_EN_B_0X1         (0x1u<<0)

// LUT185H Configuration

#define GFXMMU_LUT185H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT185H_LO_0             (0x1u<<0)

// LUT186L Configuration

#define GFXMMU_LUT186L_LVB              (0xFFu<<16)
#define GFXMMU_LUT186L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT186L_FVB              (0xFFu<<8)
#define GFXMMU_LUT186L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT186L_EN               (0x1u<<0)

#define GFXMMU_LUT186L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT186L_EN_B_0X1         (0x1u<<0)

// LUT186H Configuration

#define GFXMMU_LUT186H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT186H_LO_0             (0x1u<<0)

// LUT187L Configuration

#define GFXMMU_LUT187L_LVB              (0xFFu<<16)
#define GFXMMU_LUT187L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT187L_FVB              (0xFFu<<8)
#define GFXMMU_LUT187L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT187L_EN               (0x1u<<0)

#define GFXMMU_LUT187L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT187L_EN_B_0X1         (0x1u<<0)

// LUT187H Configuration

#define GFXMMU_LUT187H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT187H_LO_0             (0x1u<<0)

// LUT188L Configuration

#define GFXMMU_LUT188L_LVB              (0xFFu<<16)
#define GFXMMU_LUT188L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT188L_FVB              (0xFFu<<8)
#define GFXMMU_LUT188L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT188L_EN               (0x1u<<0)

#define GFXMMU_LUT188L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT188L_EN_B_0X1         (0x1u<<0)

// LUT188H Configuration

#define GFXMMU_LUT188H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT188H_LO_0             (0x1u<<0)

