Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_gfxmmu.h
// LUT189L Configuration

#define GFXMMU_LUT189L_LVB              (0xFFu<<16)
#define GFXMMU_LUT189L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT189L_FVB              (0xFFu<<8)
#define GFXMMU_LUT189L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT189L_EN               (0x1u<<0)

#define GFXMMU_LUT189L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT189L_EN_B_0X1         (0x1u<<0)

// LUT189H Configuration

#define GFXMMU_LUT189H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT189H_LO_0             (0x1u<<0)

// LUT190L Configuration

#define GFXMMU_LUT190L_LVB              (0xFFu<<16)
#define GFXMMU_LUT190L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT190L_FVB              (0xFFu<<8)
#define GFXMMU_LUT190L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT190L_EN               (0x1u<<0)

#define GFXMMU_LUT190L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT190L_EN_B_0X1         (0x1u<<0)

// LUT190H Configuration

#define GFXMMU_LUT190H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT190H_LO_0             (0x1u<<0)

// LUT191L Configuration

#define GFXMMU_LUT191L_LVB              (0xFFu<<16)
#define GFXMMU_LUT191L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT191L_FVB              (0xFFu<<8)
#define GFXMMU_LUT191L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT191L_EN               (0x1u<<0)

#define GFXMMU_LUT191L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT191L_EN_B_0X1         (0x1u<<0)

// LUT191H Configuration

#define GFXMMU_LUT191H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT191H_LO_0             (0x1u<<0)

// LUT192L Configuration

#define GFXMMU_LUT192L_LVB              (0xFFu<<16)
#define GFXMMU_LUT192L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT192L_FVB              (0xFFu<<8)
#define GFXMMU_LUT192L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT192L_EN               (0x1u<<0)

#define GFXMMU_LUT192L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT192L_EN_B_0X1         (0x1u<<0)

// LUT192H Configuration

#define GFXMMU_LUT192H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT192H_LO_0             (0x1u<<0)

// LUT193L Configuration

#define GFXMMU_LUT193L_LVB              (0xFFu<<16)
#define GFXMMU_LUT193L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT193L_FVB              (0xFFu<<8)
#define GFXMMU_LUT193L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT193L_EN               (0x1u<<0)

#define GFXMMU_LUT193L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT193L_EN_B_0X1         (0x1u<<0)

// LUT193H Configuration

#define GFXMMU_LUT193H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT193H_LO_0             (0x1u<<0)

// LUT194L Configuration

#define GFXMMU_LUT194L_LVB              (0xFFu<<16)
#define GFXMMU_LUT194L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT194L_FVB              (0xFFu<<8)
#define GFXMMU_LUT194L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT194L_EN               (0x1u<<0)

#define GFXMMU_LUT194L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT194L_EN_B_0X1         (0x1u<<0)

// LUT194H Configuration

#define GFXMMU_LUT194H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT194H_LO_0             (0x1u<<0)

// LUT195L Configuration

#define GFXMMU_LUT195L_LVB              (0xFFu<<16)
#define GFXMMU_LUT195L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT195L_FVB              (0xFFu<<8)
#define GFXMMU_LUT195L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT195L_EN               (0x1u<<0)

#define GFXMMU_LUT195L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT195L_EN_B_0X1         (0x1u<<0)

// LUT195H Configuration

#define GFXMMU_LUT195H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT195H_LO_0             (0x1u<<0)

// LUT196L Configuration

#define GFXMMU_LUT196L_LVB              (0xFFu<<16)
#define GFXMMU_LUT196L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT196L_FVB              (0xFFu<<8)
#define GFXMMU_LUT196L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT196L_EN               (0x1u<<0)

#define GFXMMU_LUT196L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT196L_EN_B_0X1         (0x1u<<0)

// LUT196H Configuration

#define GFXMMU_LUT196H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT196H_LO_0             (0x1u<<0)

// LUT197L Configuration

#define GFXMMU_LUT197L_LVB              (0xFFu<<16)
#define GFXMMU_LUT197L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT197L_FVB              (0xFFu<<8)
#define GFXMMU_LUT197L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT197L_EN               (0x1u<<0)

#define GFXMMU_LUT197L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT197L_EN_B_0X1         (0x1u<<0)

// LUT197H Configuration

#define GFXMMU_LUT197H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT197H_LO_0             (0x1u<<0)

// LUT198L Configuration

#define GFXMMU_LUT198L_LVB              (0xFFu<<16)
#define GFXMMU_LUT198L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT198L_FVB              (0xFFu<<8)
#define GFXMMU_LUT198L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT198L_EN               (0x1u<<0)

#define GFXMMU_LUT198L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT198L_EN_B_0X1         (0x1u<<0)

// LUT198H Configuration

#define GFXMMU_LUT198H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT198H_LO_0             (0x1u<<0)

// LUT199L Configuration

#define GFXMMU_LUT199L_LVB              (0xFFu<<16)
#define GFXMMU_LUT199L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT199L_FVB              (0xFFu<<8)
#define GFXMMU_LUT199L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT199L_EN               (0x1u<<0)

#define GFXMMU_LUT199L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT199L_EN_B_0X1         (0x1u<<0)

// LUT199H Configuration

#define GFXMMU_LUT199H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT199H_LO_0             (0x1u<<0)

// LUT200L Configuration

#define GFXMMU_LUT200L_LVB              (0xFFu<<16)
#define GFXMMU_LUT200L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT200L_FVB              (0xFFu<<8)
#define GFXMMU_LUT200L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT200L_EN               (0x1u<<0)

#define GFXMMU_LUT200L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT200L_EN_B_0X1         (0x1u<<0)

// LUT200H Configuration

