Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_gfxmmu.h
#define GFXMMU_LUT200H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT200H_LO_0             (0x1u<<0)

// LUT201L Configuration

#define GFXMMU_LUT201L_LVB              (0xFFu<<16)
#define GFXMMU_LUT201L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT201L_FVB              (0xFFu<<8)
#define GFXMMU_LUT201L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT201L_EN               (0x1u<<0)

#define GFXMMU_LUT201L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT201L_EN_B_0X1         (0x1u<<0)

// LUT201H Configuration

#define GFXMMU_LUT201H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT201H_LO_0             (0x1u<<0)

// LUT202L Configuration

#define GFXMMU_LUT202L_LVB              (0xFFu<<16)
#define GFXMMU_LUT202L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT202L_FVB              (0xFFu<<8)
#define GFXMMU_LUT202L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT202L_EN               (0x1u<<0)

#define GFXMMU_LUT202L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT202L_EN_B_0X1         (0x1u<<0)

// LUT202H Configuration

#define GFXMMU_LUT202H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT202H_LO_0             (0x1u<<0)

// LUT203L Configuration

#define GFXMMU_LUT203L_LVB              (0xFFu<<16)
#define GFXMMU_LUT203L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT203L_FVB              (0xFFu<<8)
#define GFXMMU_LUT203L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT203L_EN               (0x1u<<0)

#define GFXMMU_LUT203L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT203L_EN_B_0X1         (0x1u<<0)

// LUT203H Configuration

#define GFXMMU_LUT203H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT203H_LO_0             (0x1u<<0)

// LUT204L Configuration

#define GFXMMU_LUT204L_LVB              (0xFFu<<16)
#define GFXMMU_LUT204L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT204L_FVB              (0xFFu<<8)
#define GFXMMU_LUT204L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT204L_EN               (0x1u<<0)

#define GFXMMU_LUT204L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT204L_EN_B_0X1         (0x1u<<0)

// LUT204H Configuration

#define GFXMMU_LUT204H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT204H_LO_0             (0x1u<<0)

// LUT205L Configuration

#define GFXMMU_LUT205L_LVB              (0xFFu<<16)
#define GFXMMU_LUT205L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT205L_FVB              (0xFFu<<8)
#define GFXMMU_LUT205L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT205L_EN               (0x1u<<0)

#define GFXMMU_LUT205L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT205L_EN_B_0X1         (0x1u<<0)

// LUT205H Configuration

#define GFXMMU_LUT205H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT205H_LO_0             (0x1u<<0)

// LUT206L Configuration

#define GFXMMU_LUT206L_LVB              (0xFFu<<16)
#define GFXMMU_LUT206L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT206L_FVB              (0xFFu<<8)
#define GFXMMU_LUT206L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT206L_EN               (0x1u<<0)

#define GFXMMU_LUT206L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT206L_EN_B_0X1         (0x1u<<0)

// LUT206H Configuration

#define GFXMMU_LUT206H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT206H_LO_0             (0x1u<<0)

// LUT207L Configuration

#define GFXMMU_LUT207L_LVB              (0xFFu<<16)
#define GFXMMU_LUT207L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT207L_FVB              (0xFFu<<8)
#define GFXMMU_LUT207L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT207L_EN               (0x1u<<0)

#define GFXMMU_LUT207L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT207L_EN_B_0X1         (0x1u<<0)

// LUT207H Configuration

#define GFXMMU_LUT207H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT207H_LO_0             (0x1u<<0)

// LUT208L Configuration

#define GFXMMU_LUT208L_LVB              (0xFFu<<16)
#define GFXMMU_LUT208L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT208L_FVB              (0xFFu<<8)
#define GFXMMU_LUT208L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT208L_EN               (0x1u<<0)

#define GFXMMU_LUT208L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT208L_EN_B_0X1         (0x1u<<0)

// LUT208H Configuration

#define GFXMMU_LUT208H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT208H_LO_0             (0x1u<<0)

// LUT209L Configuration

#define GFXMMU_LUT209L_LVB              (0xFFu<<16)
#define GFXMMU_LUT209L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT209L_FVB              (0xFFu<<8)
#define GFXMMU_LUT209L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT209L_EN               (0x1u<<0)

#define GFXMMU_LUT209L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT209L_EN_B_0X1         (0x1u<<0)

// LUT209H Configuration

#define GFXMMU_LUT209H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT209H_LO_0             (0x1u<<0)

// LUT210L Configuration

#define GFXMMU_LUT210L_LVB              (0xFFu<<16)
#define GFXMMU_LUT210L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT210L_FVB              (0xFFu<<8)
#define GFXMMU_LUT210L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT210L_EN               (0x1u<<0)

#define GFXMMU_LUT210L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT210L_EN_B_0X1         (0x1u<<0)

// LUT210H Configuration

#define GFXMMU_LUT210H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT210H_LO_0             (0x1u<<0)

// LUT211L Configuration

#define GFXMMU_LUT211L_LVB              (0xFFu<<16)
#define GFXMMU_LUT211L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT211L_FVB              (0xFFu<<8)
#define GFXMMU_LUT211L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT211L_EN               (0x1u<<0)

#define GFXMMU_LUT211L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT211L_EN_B_0X1         (0x1u<<0)

// LUT211H Configuration

#define GFXMMU_LUT211H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT211H_LO_0             (0x1u<<0)

// LUT212L Configuration

#define GFXMMU_LUT212L_LVB              (0xFFu<<16)
#define GFXMMU_LUT212L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT212L_FVB              (0xFFu<<8)
#define GFXMMU_LUT212L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT212L_EN               (0x1u<<0)

#define GFXMMU_LUT212L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT212L_EN_B_0X1         (0x1u<<0)

// LUT212H Configuration

