Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_gfxmmu.h
#define GFXMMU_LUT212H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT212H_LO_0             (0x1u<<0)

// LUT213L Configuration

#define GFXMMU_LUT213L_LVB              (0xFFu<<16)
#define GFXMMU_LUT213L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT213L_FVB              (0xFFu<<8)
#define GFXMMU_LUT213L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT213L_EN               (0x1u<<0)

#define GFXMMU_LUT213L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT213L_EN_B_0X1         (0x1u<<0)

// LUT213H Configuration

#define GFXMMU_LUT213H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT213H_LO_0             (0x1u<<0)

// LUT214L Configuration

#define GFXMMU_LUT214L_LVB              (0xFFu<<16)
#define GFXMMU_LUT214L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT214L_FVB              (0xFFu<<8)
#define GFXMMU_LUT214L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT214L_EN               (0x1u<<0)

#define GFXMMU_LUT214L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT214L_EN_B_0X1         (0x1u<<0)

// LUT214H Configuration

#define GFXMMU_LUT214H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT214H_LO_0             (0x1u<<0)

// LUT215L Configuration

#define GFXMMU_LUT215L_LVB              (0xFFu<<16)
#define GFXMMU_LUT215L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT215L_FVB              (0xFFu<<8)
#define GFXMMU_LUT215L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT215L_EN               (0x1u<<0)

#define GFXMMU_LUT215L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT215L_EN_B_0X1         (0x1u<<0)

// LUT215H Configuration

#define GFXMMU_LUT215H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT215H_LO_0             (0x1u<<0)

// LUT216L Configuration

#define GFXMMU_LUT216L_LVB              (0xFFu<<16)
#define GFXMMU_LUT216L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT216L_FVB              (0xFFu<<8)
#define GFXMMU_LUT216L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT216L_EN               (0x1u<<0)

#define GFXMMU_LUT216L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT216L_EN_B_0X1         (0x1u<<0)

// LUT216H Configuration

#define GFXMMU_LUT216H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT216H_LO_0             (0x1u<<0)

// LUT217L Configuration

#define GFXMMU_LUT217L_LVB              (0xFFu<<16)
#define GFXMMU_LUT217L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT217L_FVB              (0xFFu<<8)
#define GFXMMU_LUT217L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT217L_EN               (0x1u<<0)

#define GFXMMU_LUT217L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT217L_EN_B_0X1         (0x1u<<0)

// LUT217H Configuration

#define GFXMMU_LUT217H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT217H_LO_0             (0x1u<<0)

// LUT218L Configuration

#define GFXMMU_LUT218L_LVB              (0xFFu<<16)
#define GFXMMU_LUT218L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT218L_FVB              (0xFFu<<8)
#define GFXMMU_LUT218L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT218L_EN               (0x1u<<0)

#define GFXMMU_LUT218L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT218L_EN_B_0X1         (0x1u<<0)

// LUT218H Configuration

#define GFXMMU_LUT218H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT218H_LO_0             (0x1u<<0)

// LUT219L Configuration

#define GFXMMU_LUT219L_LVB              (0xFFu<<16)
#define GFXMMU_LUT219L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT219L_FVB              (0xFFu<<8)
#define GFXMMU_LUT219L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT219L_EN               (0x1u<<0)

#define GFXMMU_LUT219L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT219L_EN_B_0X1         (0x1u<<0)

// LUT219H Configuration

#define GFXMMU_LUT219H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT219H_LO_0             (0x1u<<0)

// LUT220L Configuration

#define GFXMMU_LUT220L_LVB              (0xFFu<<16)
#define GFXMMU_LUT220L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT220L_FVB              (0xFFu<<8)
#define GFXMMU_LUT220L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT220L_EN               (0x1u<<0)

#define GFXMMU_LUT220L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT220L_EN_B_0X1         (0x1u<<0)

// LUT220H Configuration

#define GFXMMU_LUT220H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT220H_LO_0             (0x1u<<0)

// LUT221L Configuration

#define GFXMMU_LUT221L_LVB              (0xFFu<<16)
#define GFXMMU_LUT221L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT221L_FVB              (0xFFu<<8)
#define GFXMMU_LUT221L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT221L_EN               (0x1u<<0)

#define GFXMMU_LUT221L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT221L_EN_B_0X1         (0x1u<<0)

// LUT221H Configuration

#define GFXMMU_LUT221H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT221H_LO_0             (0x1u<<0)

// LUT222L Configuration

#define GFXMMU_LUT222L_LVB              (0xFFu<<16)
#define GFXMMU_LUT222L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT222L_FVB              (0xFFu<<8)
#define GFXMMU_LUT222L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT222L_EN               (0x1u<<0)

#define GFXMMU_LUT222L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT222L_EN_B_0X1         (0x1u<<0)

// LUT222H Configuration

#define GFXMMU_LUT222H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT222H_LO_0             (0x1u<<0)

// LUT223L Configuration

#define GFXMMU_LUT223L_LVB              (0xFFu<<16)
#define GFXMMU_LUT223L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT223L_FVB              (0xFFu<<8)
#define GFXMMU_LUT223L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT223L_EN               (0x1u<<0)

#define GFXMMU_LUT223L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT223L_EN_B_0X1         (0x1u<<0)

// LUT223H Configuration

#define GFXMMU_LUT223H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT223H_LO_0             (0x1u<<0)

// LUT224L Configuration

#define GFXMMU_LUT224L_LVB              (0xFFu<<16)
#define GFXMMU_LUT224L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT224L_FVB              (0xFFu<<8)
#define GFXMMU_LUT224L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT224L_EN               (0x1u<<0)

#define GFXMMU_LUT224L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT224L_EN_B_0X1         (0x1u<<0)

// LUT224H Configuration

