Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_gfxmmu.h
#define GFXMMU_LUT248L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT248L_EN_B_0X1         (0x1u<<0)

// LUT248H Configuration

#define GFXMMU_LUT248H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT248H_LO_0             (0x1u<<0)

// LUT249L Configuration

#define GFXMMU_LUT249L_LVB              (0xFFu<<16)
#define GFXMMU_LUT249L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT249L_FVB              (0xFFu<<8)
#define GFXMMU_LUT249L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT249L_EN               (0x1u<<0)

#define GFXMMU_LUT249L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT249L_EN_B_0X1         (0x1u<<0)

// LUT249H Configuration

#define GFXMMU_LUT249H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT249H_LO_0             (0x1u<<0)

// LUT250L Configuration

#define GFXMMU_LUT250L_LVB              (0xFFu<<16)
#define GFXMMU_LUT250L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT250L_FVB              (0xFFu<<8)
#define GFXMMU_LUT250L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT250L_EN               (0x1u<<0)

#define GFXMMU_LUT250L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT250L_EN_B_0X1         (0x1u<<0)

// LUT250H Configuration

#define GFXMMU_LUT250H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT250H_LO_0             (0x1u<<0)

// LUT251L Configuration

#define GFXMMU_LUT251L_LVB              (0xFFu<<16)
#define GFXMMU_LUT251L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT251L_FVB              (0xFFu<<8)
#define GFXMMU_LUT251L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT251L_EN               (0x1u<<0)

#define GFXMMU_LUT251L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT251L_EN_B_0X1         (0x1u<<0)

// LUT251H Configuration

#define GFXMMU_LUT251H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT251H_LO_0             (0x1u<<0)

// LUT252L Configuration

#define GFXMMU_LUT252L_LVB              (0xFFu<<16)
#define GFXMMU_LUT252L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT252L_FVB              (0xFFu<<8)
#define GFXMMU_LUT252L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT252L_EN               (0x1u<<0)

#define GFXMMU_LUT252L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT252L_EN_B_0X1         (0x1u<<0)

// LUT252H Configuration

#define GFXMMU_LUT252H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT252H_LO_0             (0x1u<<0)

// LUT253L Configuration

#define GFXMMU_LUT253L_LVB              (0xFFu<<16)
#define GFXMMU_LUT253L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT253L_FVB              (0xFFu<<8)
#define GFXMMU_LUT253L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT253L_EN               (0x1u<<0)

#define GFXMMU_LUT253L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT253L_EN_B_0X1         (0x1u<<0)

// LUT253H Configuration

#define GFXMMU_LUT253H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT253H_LO_0             (0x1u<<0)

// LUT254L Configuration

#define GFXMMU_LUT254L_LVB              (0xFFu<<16)
#define GFXMMU_LUT254L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT254L_FVB              (0xFFu<<8)
#define GFXMMU_LUT254L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT254L_EN               (0x1u<<0)

#define GFXMMU_LUT254L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT254L_EN_B_0X1         (0x1u<<0)

// LUT254H Configuration

#define GFXMMU_LUT254H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT254H_LO_0             (0x1u<<0)

// LUT255L Configuration

#define GFXMMU_LUT255L_LVB              (0xFFu<<16)
#define GFXMMU_LUT255L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT255L_FVB              (0xFFu<<8)
#define GFXMMU_LUT255L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT255L_EN               (0x1u<<0)

#define GFXMMU_LUT255L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT255L_EN_B_0X1         (0x1u<<0)

// LUT255H Configuration

#define GFXMMU_LUT255H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT255H_LO_0             (0x1u<<0)

// LUT256L Configuration

#define GFXMMU_LUT256L_LVB              (0xFFu<<16)
#define GFXMMU_LUT256L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT256L_FVB              (0xFFu<<8)
#define GFXMMU_LUT256L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT256L_EN               (0x1u<<0)

#define GFXMMU_LUT256L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT256L_EN_B_0X1         (0x1u<<0)

// LUT256H Configuration

#define GFXMMU_LUT256H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT256H_LO_0             (0x1u<<0)

// LUT257L Configuration

#define GFXMMU_LUT257L_LVB              (0xFFu<<16)
#define GFXMMU_LUT257L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT257L_FVB              (0xFFu<<8)
#define GFXMMU_LUT257L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT257L_EN               (0x1u<<0)

#define GFXMMU_LUT257L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT257L_EN_B_0X1         (0x1u<<0)

// LUT257H Configuration

#define GFXMMU_LUT257H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT257H_LO_0             (0x1u<<0)

// LUT258L Configuration

#define GFXMMU_LUT258L_LVB              (0xFFu<<16)
#define GFXMMU_LUT258L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT258L_FVB              (0xFFu<<8)
#define GFXMMU_LUT258L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT258L_EN               (0x1u<<0)

#define GFXMMU_LUT258L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT258L_EN_B_0X1         (0x1u<<0)

// LUT258H Configuration

#define GFXMMU_LUT258H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT258H_LO_0             (0x1u<<0)

// LUT259L Configuration

#define GFXMMU_LUT259L_LVB              (0xFFu<<16)
#define GFXMMU_LUT259L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT259L_FVB              (0xFFu<<8)
#define GFXMMU_LUT259L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT259L_EN               (0x1u<<0)

#define GFXMMU_LUT259L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT259L_EN_B_0X1         (0x1u<<0)

// LUT259H Configuration

#define GFXMMU_LUT259H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT259H_LO_0             (0x1u<<0)

// LUT260L Configuration

#define GFXMMU_LUT260L_LVB              (0xFFu<<16)
#define GFXMMU_LUT260L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT260L_FVB              (0xFFu<<8)
#define GFXMMU_LUT260L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT260L_EN               (0x1u<<0)

#define GFXMMU_LUT260L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT260L_EN_B_0X1         (0x1u<<0)

// LUT260H Configuration

