Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_gfxmmu.h
// LUT296H Configuration

#define GFXMMU_LUT296H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT296H_LO_0             (0x1u<<0)

// LUT297L Configuration

#define GFXMMU_LUT297L_LVB              (0xFFu<<16)
#define GFXMMU_LUT297L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT297L_FVB              (0xFFu<<8)
#define GFXMMU_LUT297L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT297L_EN               (0x1u<<0)

#define GFXMMU_LUT297L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT297L_EN_B_0X1         (0x1u<<0)

// LUT297H Configuration

#define GFXMMU_LUT297H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT297H_LO_0             (0x1u<<0)

// LUT298L Configuration

#define GFXMMU_LUT298L_LVB              (0xFFu<<16)
#define GFXMMU_LUT298L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT298L_FVB              (0xFFu<<8)
#define GFXMMU_LUT298L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT298L_EN               (0x1u<<0)

#define GFXMMU_LUT298L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT298L_EN_B_0X1         (0x1u<<0)

// LUT298H Configuration

#define GFXMMU_LUT298H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT298H_LO_0             (0x1u<<0)

// LUT299L Configuration

#define GFXMMU_LUT299L_LVB              (0xFFu<<16)
#define GFXMMU_LUT299L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT299L_FVB              (0xFFu<<8)
#define GFXMMU_LUT299L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT299L_EN               (0x1u<<0)

#define GFXMMU_LUT299L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT299L_EN_B_0X1         (0x1u<<0)

// LUT299H Configuration

#define GFXMMU_LUT299H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT299H_LO_0             (0x1u<<0)

// LUT300L Configuration

#define GFXMMU_LUT300L_LVB              (0xFFu<<16)
#define GFXMMU_LUT300L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT300L_FVB              (0xFFu<<8)
#define GFXMMU_LUT300L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT300L_EN               (0x1u<<0)

#define GFXMMU_LUT300L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT300L_EN_B_0X1         (0x1u<<0)

// LUT300H Configuration

#define GFXMMU_LUT300H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT300H_LO_0             (0x1u<<0)

// LUT301L Configuration

#define GFXMMU_LUT301L_LVB              (0xFFu<<16)
#define GFXMMU_LUT301L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT301L_FVB              (0xFFu<<8)
#define GFXMMU_LUT301L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT301L_EN               (0x1u<<0)

#define GFXMMU_LUT301L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT301L_EN_B_0X1         (0x1u<<0)

// LUT301H Configuration

#define GFXMMU_LUT301H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT301H_LO_0             (0x1u<<0)

// LUT302L Configuration

#define GFXMMU_LUT302L_LVB              (0xFFu<<16)
#define GFXMMU_LUT302L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT302L_FVB              (0xFFu<<8)
#define GFXMMU_LUT302L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT302L_EN               (0x1u<<0)

#define GFXMMU_LUT302L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT302L_EN_B_0X1         (0x1u<<0)

// LUT302H Configuration

#define GFXMMU_LUT302H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT302H_LO_0             (0x1u<<0)

// LUT303L Configuration

#define GFXMMU_LUT303L_LVB              (0xFFu<<16)
#define GFXMMU_LUT303L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT303L_FVB              (0xFFu<<8)
#define GFXMMU_LUT303L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT303L_EN               (0x1u<<0)

#define GFXMMU_LUT303L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT303L_EN_B_0X1         (0x1u<<0)

// LUT303H Configuration

#define GFXMMU_LUT303H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT303H_LO_0             (0x1u<<0)

// LUT304L Configuration

#define GFXMMU_LUT304L_LVB              (0xFFu<<16)
#define GFXMMU_LUT304L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT304L_FVB              (0xFFu<<8)
#define GFXMMU_LUT304L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT304L_EN               (0x1u<<0)

#define GFXMMU_LUT304L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT304L_EN_B_0X1         (0x1u<<0)

// LUT304H Configuration

#define GFXMMU_LUT304H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT304H_LO_0             (0x1u<<0)

// LUT305L Configuration

#define GFXMMU_LUT305L_LVB              (0xFFu<<16)
#define GFXMMU_LUT305L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT305L_FVB              (0xFFu<<8)
#define GFXMMU_LUT305L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT305L_EN               (0x1u<<0)

#define GFXMMU_LUT305L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT305L_EN_B_0X1         (0x1u<<0)

// LUT305H Configuration

#define GFXMMU_LUT305H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT305H_LO_0             (0x1u<<0)

// LUT306L Configuration

#define GFXMMU_LUT306L_LVB              (0xFFu<<16)
#define GFXMMU_LUT306L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT306L_FVB              (0xFFu<<8)
#define GFXMMU_LUT306L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT306L_EN               (0x1u<<0)

#define GFXMMU_LUT306L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT306L_EN_B_0X1         (0x1u<<0)

// LUT306H Configuration

#define GFXMMU_LUT306H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT306H_LO_0             (0x1u<<0)

// LUT307L Configuration

#define GFXMMU_LUT307L_LVB              (0xFFu<<16)
#define GFXMMU_LUT307L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT307L_FVB              (0xFFu<<8)
#define GFXMMU_LUT307L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT307L_EN               (0x1u<<0)

#define GFXMMU_LUT307L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT307L_EN_B_0X1         (0x1u<<0)

// LUT307H Configuration

#define GFXMMU_LUT307H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT307H_LO_0             (0x1u<<0)

// LUT308L Configuration

#define GFXMMU_LUT308L_LVB              (0xFFu<<16)
#define GFXMMU_LUT308L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT308L_FVB              (0xFFu<<8)
#define GFXMMU_LUT308L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT308L_EN               (0x1u<<0)

#define GFXMMU_LUT308L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT308L_EN_B_0X1         (0x1u<<0)

// LUT308H Configuration

#define GFXMMU_LUT308H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT308H_LO_0             (0x1u<<0)

// LUT309L Configuration

#define GFXMMU_LUT309L_LVB              (0xFFu<<16)
#define GFXMMU_LUT309L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT309L_FVB              (0xFFu<<8)
#define GFXMMU_LUT309L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT309L_EN               (0x1u<<0)

#define GFXMMU_LUT309L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT309L_EN_B_0X1         (0x1u<<0)

// LUT309H Configuration

#define GFXMMU_LUT309H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT309H_LO_0             (0x1u<<0)

