Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_gfxmmu.h
// LUT322H Configuration

#define GFXMMU_LUT322H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT322H_LO_0             (0x1u<<0)

// LUT323L Configuration

#define GFXMMU_LUT323L_LVB              (0xFFu<<16)
#define GFXMMU_LUT323L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT323L_FVB              (0xFFu<<8)
#define GFXMMU_LUT323L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT323L_EN               (0x1u<<0)

#define GFXMMU_LUT323L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT323L_EN_B_0X1         (0x1u<<0)

// LUT323H Configuration

#define GFXMMU_LUT323H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT323H_LO_0             (0x1u<<0)

// LUT324L Configuration

#define GFXMMU_LUT324L_LVB              (0xFFu<<16)
#define GFXMMU_LUT324L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT324L_FVB              (0xFFu<<8)
#define GFXMMU_LUT324L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT324L_EN               (0x1u<<0)

#define GFXMMU_LUT324L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT324L_EN_B_0X1         (0x1u<<0)

// LUT324H Configuration

#define GFXMMU_LUT324H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT324H_LO_0             (0x1u<<0)

// LUT325L Configuration

#define GFXMMU_LUT325L_LVB              (0xFFu<<16)
#define GFXMMU_LUT325L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT325L_FVB              (0xFFu<<8)
#define GFXMMU_LUT325L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT325L_EN               (0x1u<<0)

#define GFXMMU_LUT325L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT325L_EN_B_0X1         (0x1u<<0)

// LUT325H Configuration

#define GFXMMU_LUT325H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT325H_LO_0             (0x1u<<0)

// LUT326L Configuration

#define GFXMMU_LUT326L_LVB              (0xFFu<<16)
#define GFXMMU_LUT326L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT326L_FVB              (0xFFu<<8)
#define GFXMMU_LUT326L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT326L_EN               (0x1u<<0)

#define GFXMMU_LUT326L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT326L_EN_B_0X1         (0x1u<<0)

// LUT326H Configuration

#define GFXMMU_LUT326H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT326H_LO_0             (0x1u<<0)

// LUT327L Configuration

#define GFXMMU_LUT327L_LVB              (0xFFu<<16)
#define GFXMMU_LUT327L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT327L_FVB              (0xFFu<<8)
#define GFXMMU_LUT327L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT327L_EN               (0x1u<<0)

#define GFXMMU_LUT327L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT327L_EN_B_0X1         (0x1u<<0)

// LUT327H Configuration

#define GFXMMU_LUT327H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT327H_LO_0             (0x1u<<0)

// LUT328L Configuration

#define GFXMMU_LUT328L_LVB              (0xFFu<<16)
#define GFXMMU_LUT328L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT328L_FVB              (0xFFu<<8)
#define GFXMMU_LUT328L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT328L_EN               (0x1u<<0)

#define GFXMMU_LUT328L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT328L_EN_B_0X1         (0x1u<<0)

// LUT328H Configuration

#define GFXMMU_LUT328H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT328H_LO_0             (0x1u<<0)

// LUT329L Configuration

#define GFXMMU_LUT329L_LVB              (0xFFu<<16)
#define GFXMMU_LUT329L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT329L_FVB              (0xFFu<<8)
#define GFXMMU_LUT329L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT329L_EN               (0x1u<<0)

#define GFXMMU_LUT329L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT329L_EN_B_0X1         (0x1u<<0)

// LUT329H Configuration

#define GFXMMU_LUT329H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT329H_LO_0             (0x1u<<0)

// LUT330L Configuration

#define GFXMMU_LUT330L_LVB              (0xFFu<<16)
#define GFXMMU_LUT330L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT330L_FVB              (0xFFu<<8)
#define GFXMMU_LUT330L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT330L_EN               (0x1u<<0)

#define GFXMMU_LUT330L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT330L_EN_B_0X1         (0x1u<<0)

// LUT330H Configuration

#define GFXMMU_LUT330H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT330H_LO_0             (0x1u<<0)

// LUT331L Configuration

#define GFXMMU_LUT331L_LVB              (0xFFu<<16)
#define GFXMMU_LUT331L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT331L_FVB              (0xFFu<<8)
#define GFXMMU_LUT331L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT331L_EN               (0x1u<<0)

#define GFXMMU_LUT331L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT331L_EN_B_0X1         (0x1u<<0)

// LUT331H Configuration

#define GFXMMU_LUT331H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT331H_LO_0             (0x1u<<0)

// LUT332L Configuration

#define GFXMMU_LUT332L_LVB              (0xFFu<<16)
#define GFXMMU_LUT332L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT332L_FVB              (0xFFu<<8)
#define GFXMMU_LUT332L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT332L_EN               (0x1u<<0)

#define GFXMMU_LUT332L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT332L_EN_B_0X1         (0x1u<<0)

// LUT332H Configuration

#define GFXMMU_LUT332H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT332H_LO_0             (0x1u<<0)

// LUT333L Configuration

#define GFXMMU_LUT333L_LVB              (0xFFu<<16)
#define GFXMMU_LUT333L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT333L_FVB              (0xFFu<<8)
#define GFXMMU_LUT333L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT333L_EN               (0x1u<<0)

#define GFXMMU_LUT333L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT333L_EN_B_0X1         (0x1u<<0)

// LUT333H Configuration

#define GFXMMU_LUT333H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT333H_LO_0             (0x1u<<0)

// LUT334L Configuration

#define GFXMMU_LUT334L_LVB              (0xFFu<<16)
#define GFXMMU_LUT334L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT334L_FVB              (0xFFu<<8)
#define GFXMMU_LUT334L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT334L_EN               (0x1u<<0)

#define GFXMMU_LUT334L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT334L_EN_B_0X1         (0x1u<<0)

// LUT334H Configuration

#define GFXMMU_LUT334H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT334H_LO_0             (0x1u<<0)

// LUT335L Configuration

