Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_gfxmmu.h
#define GFXMMU_LUT335L_LVB              (0xFFu<<16)
#define GFXMMU_LUT335L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT335L_FVB              (0xFFu<<8)
#define GFXMMU_LUT335L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT335L_EN               (0x1u<<0)

#define GFXMMU_LUT335L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT335L_EN_B_0X1         (0x1u<<0)

// LUT335H Configuration

#define GFXMMU_LUT335H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT335H_LO_0             (0x1u<<0)

// LUT336L Configuration

#define GFXMMU_LUT336L_LVB              (0xFFu<<16)
#define GFXMMU_LUT336L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT336L_FVB              (0xFFu<<8)
#define GFXMMU_LUT336L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT336L_EN               (0x1u<<0)

#define GFXMMU_LUT336L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT336L_EN_B_0X1         (0x1u<<0)

// LUT336H Configuration

#define GFXMMU_LUT336H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT336H_LO_0             (0x1u<<0)

// LUT337L Configuration

#define GFXMMU_LUT337L_LVB              (0xFFu<<16)
#define GFXMMU_LUT337L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT337L_FVB              (0xFFu<<8)
#define GFXMMU_LUT337L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT337L_EN               (0x1u<<0)

#define GFXMMU_LUT337L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT337L_EN_B_0X1         (0x1u<<0)

// LUT337H Configuration

#define GFXMMU_LUT337H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT337H_LO_0             (0x1u<<0)

// LUT338L Configuration

#define GFXMMU_LUT338L_LVB              (0xFFu<<16)
#define GFXMMU_LUT338L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT338L_FVB              (0xFFu<<8)
#define GFXMMU_LUT338L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT338L_EN               (0x1u<<0)

#define GFXMMU_LUT338L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT338L_EN_B_0X1         (0x1u<<0)

// LUT338H Configuration

#define GFXMMU_LUT338H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT338H_LO_0             (0x1u<<0)

// LUT339L Configuration

#define GFXMMU_LUT339L_LVB              (0xFFu<<16)
#define GFXMMU_LUT339L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT339L_FVB              (0xFFu<<8)
#define GFXMMU_LUT339L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT339L_EN               (0x1u<<0)

#define GFXMMU_LUT339L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT339L_EN_B_0X1         (0x1u<<0)

// LUT339H Configuration

#define GFXMMU_LUT339H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT339H_LO_0             (0x1u<<0)

// LUT340L Configuration

#define GFXMMU_LUT340L_LVB              (0xFFu<<16)
#define GFXMMU_LUT340L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT340L_FVB              (0xFFu<<8)
#define GFXMMU_LUT340L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT340L_EN               (0x1u<<0)

#define GFXMMU_LUT340L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT340L_EN_B_0X1         (0x1u<<0)

// LUT340H Configuration

#define GFXMMU_LUT340H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT340H_LO_0             (0x1u<<0)

// LUT341L Configuration

#define GFXMMU_LUT341L_LVB              (0xFFu<<16)
#define GFXMMU_LUT341L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT341L_FVB              (0xFFu<<8)
#define GFXMMU_LUT341L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT341L_EN               (0x1u<<0)

#define GFXMMU_LUT341L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT341L_EN_B_0X1         (0x1u<<0)

// LUT341H Configuration

#define GFXMMU_LUT341H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT341H_LO_0             (0x1u<<0)

// LUT342L Configuration

#define GFXMMU_LUT342L_LVB              (0xFFu<<16)
#define GFXMMU_LUT342L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT342L_FVB              (0xFFu<<8)
#define GFXMMU_LUT342L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT342L_EN               (0x1u<<0)

#define GFXMMU_LUT342L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT342L_EN_B_0X1         (0x1u<<0)

// LUT342H Configuration

#define GFXMMU_LUT342H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT342H_LO_0             (0x1u<<0)

// LUT343L Configuration

#define GFXMMU_LUT343L_LVB              (0xFFu<<16)
#define GFXMMU_LUT343L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT343L_FVB              (0xFFu<<8)
#define GFXMMU_LUT343L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT343L_EN               (0x1u<<0)

#define GFXMMU_LUT343L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT343L_EN_B_0X1         (0x1u<<0)

// LUT343H Configuration

#define GFXMMU_LUT343H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT343H_LO_0             (0x1u<<0)

// LUT344L Configuration

#define GFXMMU_LUT344L_LVB              (0xFFu<<16)
#define GFXMMU_LUT344L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT344L_FVB              (0xFFu<<8)
#define GFXMMU_LUT344L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT344L_EN               (0x1u<<0)

#define GFXMMU_LUT344L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT344L_EN_B_0X1         (0x1u<<0)

// LUT344H Configuration

#define GFXMMU_LUT344H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT344H_LO_0             (0x1u<<0)

// LUT345L Configuration

#define GFXMMU_LUT345L_LVB              (0xFFu<<16)
#define GFXMMU_LUT345L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT345L_FVB              (0xFFu<<8)
#define GFXMMU_LUT345L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT345L_EN               (0x1u<<0)

#define GFXMMU_LUT345L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT345L_EN_B_0X1         (0x1u<<0)

// LUT345H Configuration

#define GFXMMU_LUT345H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT345H_LO_0             (0x1u<<0)

// LUT346L Configuration

#define GFXMMU_LUT346L_LVB              (0xFFu<<16)
#define GFXMMU_LUT346L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT346L_FVB              (0xFFu<<8)
#define GFXMMU_LUT346L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT346L_EN               (0x1u<<0)

#define GFXMMU_LUT346L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT346L_EN_B_0X1         (0x1u<<0)

// LUT346H Configuration

#define GFXMMU_LUT346H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT346H_LO_0             (0x1u<<0)

// LUT347L Configuration

#define GFXMMU_LUT347L_LVB              (0xFFu<<16)
#define GFXMMU_LUT347L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT347L_FVB              (0xFFu<<8)
#define GFXMMU_LUT347L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT347L_EN               (0x1u<<0)

#define GFXMMU_LUT347L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT347L_EN_B_0X1         (0x1u<<0)

// LUT347H Configuration

#define GFXMMU_LUT347H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT347H_LO_0             (0x1u<<0)

// LUT348L Configuration

