Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_gfxmmu.h
#define GFXMMU_LUT348L_LVB              (0xFFu<<16)
#define GFXMMU_LUT348L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT348L_FVB              (0xFFu<<8)
#define GFXMMU_LUT348L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT348L_EN               (0x1u<<0)

#define GFXMMU_LUT348L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT348L_EN_B_0X1         (0x1u<<0)

// LUT348H Configuration

#define GFXMMU_LUT348H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT348H_LO_0             (0x1u<<0)

// LUT349L Configuration

#define GFXMMU_LUT349L_LVB              (0xFFu<<16)
#define GFXMMU_LUT349L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT349L_FVB              (0xFFu<<8)
#define GFXMMU_LUT349L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT349L_EN               (0x1u<<0)

#define GFXMMU_LUT349L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT349L_EN_B_0X1         (0x1u<<0)

// LUT349H Configuration

#define GFXMMU_LUT349H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT349H_LO_0             (0x1u<<0)

// LUT350L Configuration

#define GFXMMU_LUT350L_LVB              (0xFFu<<16)
#define GFXMMU_LUT350L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT350L_FVB              (0xFFu<<8)
#define GFXMMU_LUT350L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT350L_EN               (0x1u<<0)

#define GFXMMU_LUT350L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT350L_EN_B_0X1         (0x1u<<0)

// LUT350H Configuration

#define GFXMMU_LUT350H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT350H_LO_0             (0x1u<<0)

// LUT351L Configuration

#define GFXMMU_LUT351L_LVB              (0xFFu<<16)
#define GFXMMU_LUT351L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT351L_FVB              (0xFFu<<8)
#define GFXMMU_LUT351L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT351L_EN               (0x1u<<0)

#define GFXMMU_LUT351L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT351L_EN_B_0X1         (0x1u<<0)

// LUT351H Configuration

#define GFXMMU_LUT351H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT351H_LO_0             (0x1u<<0)

// LUT352L Configuration

#define GFXMMU_LUT352L_LVB              (0xFFu<<16)
#define GFXMMU_LUT352L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT352L_FVB              (0xFFu<<8)
#define GFXMMU_LUT352L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT352L_EN               (0x1u<<0)

#define GFXMMU_LUT352L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT352L_EN_B_0X1         (0x1u<<0)

// LUT352H Configuration

#define GFXMMU_LUT352H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT352H_LO_0             (0x1u<<0)

// LUT353L Configuration

#define GFXMMU_LUT353L_LVB              (0xFFu<<16)
#define GFXMMU_LUT353L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT353L_FVB              (0xFFu<<8)
#define GFXMMU_LUT353L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT353L_EN               (0x1u<<0)

#define GFXMMU_LUT353L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT353L_EN_B_0X1         (0x1u<<0)

// LUT353H Configuration

#define GFXMMU_LUT353H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT353H_LO_0             (0x1u<<0)

// LUT354L Configuration

#define GFXMMU_LUT354L_LVB              (0xFFu<<16)
#define GFXMMU_LUT354L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT354L_FVB              (0xFFu<<8)
#define GFXMMU_LUT354L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT354L_EN               (0x1u<<0)

#define GFXMMU_LUT354L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT354L_EN_B_0X1         (0x1u<<0)

// LUT354H Configuration

#define GFXMMU_LUT354H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT354H_LO_0             (0x1u<<0)

// LUT355L Configuration

#define GFXMMU_LUT355L_LVB              (0xFFu<<16)
#define GFXMMU_LUT355L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT355L_FVB              (0xFFu<<8)
#define GFXMMU_LUT355L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT355L_EN               (0x1u<<0)

#define GFXMMU_LUT355L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT355L_EN_B_0X1         (0x1u<<0)

// LUT355H Configuration

#define GFXMMU_LUT355H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT355H_LO_0             (0x1u<<0)

// LUT356L Configuration

#define GFXMMU_LUT356L_LVB              (0xFFu<<16)
#define GFXMMU_LUT356L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT356L_FVB              (0xFFu<<8)
#define GFXMMU_LUT356L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT356L_EN               (0x1u<<0)

#define GFXMMU_LUT356L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT356L_EN_B_0X1         (0x1u<<0)

// LUT356H Configuration

#define GFXMMU_LUT356H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT356H_LO_0             (0x1u<<0)

// LUT357L Configuration

#define GFXMMU_LUT357L_LVB              (0xFFu<<16)
#define GFXMMU_LUT357L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT357L_FVB              (0xFFu<<8)
#define GFXMMU_LUT357L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT357L_EN               (0x1u<<0)

#define GFXMMU_LUT357L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT357L_EN_B_0X1         (0x1u<<0)

// LUT357H Configuration

#define GFXMMU_LUT357H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT357H_LO_0             (0x1u<<0)

// LUT358L Configuration

#define GFXMMU_LUT358L_LVB              (0xFFu<<16)
#define GFXMMU_LUT358L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT358L_FVB              (0xFFu<<8)
#define GFXMMU_LUT358L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT358L_EN               (0x1u<<0)

#define GFXMMU_LUT358L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT358L_EN_B_0X1         (0x1u<<0)

// LUT358H Configuration

#define GFXMMU_LUT358H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT358H_LO_0             (0x1u<<0)

// LUT359L Configuration

#define GFXMMU_LUT359L_LVB              (0xFFu<<16)
#define GFXMMU_LUT359L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT359L_FVB              (0xFFu<<8)
#define GFXMMU_LUT359L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT359L_EN               (0x1u<<0)

#define GFXMMU_LUT359L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT359L_EN_B_0X1         (0x1u<<0)

// LUT359H Configuration

