Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_gfxmmu.h
// LUT385H Configuration

#define GFXMMU_LUT385H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT385H_LO_0             (0x1u<<0)

// LUT386L Configuration

#define GFXMMU_LUT386L_LVB              (0xFFu<<16)
#define GFXMMU_LUT386L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT386L_FVB              (0xFFu<<8)
#define GFXMMU_LUT386L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT386L_EN               (0x1u<<0)

#define GFXMMU_LUT386L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT386L_EN_B_0X1         (0x1u<<0)

// LUT386H Configuration

#define GFXMMU_LUT386H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT386H_LO_0             (0x1u<<0)

// LUT387L Configuration

#define GFXMMU_LUT387L_LVB              (0xFFu<<16)
#define GFXMMU_LUT387L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT387L_FVB              (0xFFu<<8)
#define GFXMMU_LUT387L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT387L_EN               (0x1u<<0)

#define GFXMMU_LUT387L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT387L_EN_B_0X1         (0x1u<<0)

// LUT387H Configuration

#define GFXMMU_LUT387H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT387H_LO_0             (0x1u<<0)

// LUT388L Configuration

#define GFXMMU_LUT388L_LVB              (0xFFu<<16)
#define GFXMMU_LUT388L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT388L_FVB              (0xFFu<<8)
#define GFXMMU_LUT388L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT388L_EN               (0x1u<<0)

#define GFXMMU_LUT388L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT388L_EN_B_0X1         (0x1u<<0)

// LUT388H Configuration

#define GFXMMU_LUT388H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT388H_LO_0             (0x1u<<0)

// LUT389L Configuration

#define GFXMMU_LUT389L_LVB              (0xFFu<<16)
#define GFXMMU_LUT389L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT389L_FVB              (0xFFu<<8)
#define GFXMMU_LUT389L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT389L_EN               (0x1u<<0)

#define GFXMMU_LUT389L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT389L_EN_B_0X1         (0x1u<<0)

// LUT389H Configuration

#define GFXMMU_LUT389H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT389H_LO_0             (0x1u<<0)

// LUT390L Configuration

#define GFXMMU_LUT390L_LVB              (0xFFu<<16)
#define GFXMMU_LUT390L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT390L_FVB              (0xFFu<<8)
#define GFXMMU_LUT390L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT390L_EN               (0x1u<<0)

#define GFXMMU_LUT390L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT390L_EN_B_0X1         (0x1u<<0)

// LUT390H Configuration

#define GFXMMU_LUT390H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT390H_LO_0             (0x1u<<0)

// LUT391L Configuration

#define GFXMMU_LUT391L_LVB              (0xFFu<<16)
#define GFXMMU_LUT391L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT391L_FVB              (0xFFu<<8)
#define GFXMMU_LUT391L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT391L_EN               (0x1u<<0)

#define GFXMMU_LUT391L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT391L_EN_B_0X1         (0x1u<<0)

// LUT391H Configuration

#define GFXMMU_LUT391H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT391H_LO_0             (0x1u<<0)

// LUT392L Configuration

#define GFXMMU_LUT392L_LVB              (0xFFu<<16)
#define GFXMMU_LUT392L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT392L_FVB              (0xFFu<<8)
#define GFXMMU_LUT392L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT392L_EN               (0x1u<<0)

#define GFXMMU_LUT392L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT392L_EN_B_0X1         (0x1u<<0)

// LUT392H Configuration

#define GFXMMU_LUT392H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT392H_LO_0             (0x1u<<0)

// LUT393L Configuration

#define GFXMMU_LUT393L_LVB              (0xFFu<<16)
#define GFXMMU_LUT393L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT393L_FVB              (0xFFu<<8)
#define GFXMMU_LUT393L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT393L_EN               (0x1u<<0)

#define GFXMMU_LUT393L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT393L_EN_B_0X1         (0x1u<<0)

// LUT393H Configuration

#define GFXMMU_LUT393H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT393H_LO_0             (0x1u<<0)

// LUT394L Configuration

#define GFXMMU_LUT394L_LVB              (0xFFu<<16)
#define GFXMMU_LUT394L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT394L_FVB              (0xFFu<<8)
#define GFXMMU_LUT394L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT394L_EN               (0x1u<<0)

#define GFXMMU_LUT394L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT394L_EN_B_0X1         (0x1u<<0)

// LUT394H Configuration

#define GFXMMU_LUT394H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT394H_LO_0             (0x1u<<0)

// LUT395L Configuration

#define GFXMMU_LUT395L_LVB              (0xFFu<<16)
#define GFXMMU_LUT395L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT395L_FVB              (0xFFu<<8)
#define GFXMMU_LUT395L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT395L_EN               (0x1u<<0)

#define GFXMMU_LUT395L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT395L_EN_B_0X1         (0x1u<<0)

// LUT395H Configuration

#define GFXMMU_LUT395H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT395H_LO_0             (0x1u<<0)

// LUT396L Configuration

#define GFXMMU_LUT396L_LVB              (0xFFu<<16)
#define GFXMMU_LUT396L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT396L_FVB              (0xFFu<<8)
#define GFXMMU_LUT396L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT396L_EN               (0x1u<<0)

#define GFXMMU_LUT396L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT396L_EN_B_0X1         (0x1u<<0)

// LUT396H Configuration

#define GFXMMU_LUT396H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT396H_LO_0             (0x1u<<0)

// LUT397L Configuration

#define GFXMMU_LUT397L_LVB              (0xFFu<<16)
#define GFXMMU_LUT397L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT397L_FVB              (0xFFu<<8)
#define GFXMMU_LUT397L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT397L_EN               (0x1u<<0)

#define GFXMMU_LUT397L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT397L_EN_B_0X1         (0x1u<<0)

