Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_gfxmmu.h
#define GFXMMU_LUT421H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT421H_LO_0             (0x1u<<0)

// LUT422L Configuration

#define GFXMMU_LUT422L_LVB              (0xFFu<<16)
#define GFXMMU_LUT422L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT422L_FVB              (0xFFu<<8)
#define GFXMMU_LUT422L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT422L_EN               (0x1u<<0)

#define GFXMMU_LUT422L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT422L_EN_B_0X1         (0x1u<<0)

// LUT422H Configuration

#define GFXMMU_LUT422H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT422H_LO_0             (0x1u<<0)

// LUT423L Configuration

#define GFXMMU_LUT423L_LVB              (0xFFu<<16)
#define GFXMMU_LUT423L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT423L_FVB              (0xFFu<<8)
#define GFXMMU_LUT423L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT423L_EN               (0x1u<<0)

#define GFXMMU_LUT423L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT423L_EN_B_0X1         (0x1u<<0)

// LUT423H Configuration

#define GFXMMU_LUT423H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT423H_LO_0             (0x1u<<0)

// LUT424L Configuration

#define GFXMMU_LUT424L_LVB              (0xFFu<<16)
#define GFXMMU_LUT424L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT424L_FVB              (0xFFu<<8)
#define GFXMMU_LUT424L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT424L_EN               (0x1u<<0)

#define GFXMMU_LUT424L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT424L_EN_B_0X1         (0x1u<<0)

// LUT424H Configuration

#define GFXMMU_LUT424H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT424H_LO_0             (0x1u<<0)

// LUT425L Configuration

#define GFXMMU_LUT425L_LVB              (0xFFu<<16)
#define GFXMMU_LUT425L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT425L_FVB              (0xFFu<<8)
#define GFXMMU_LUT425L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT425L_EN               (0x1u<<0)

#define GFXMMU_LUT425L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT425L_EN_B_0X1         (0x1u<<0)

// LUT425H Configuration

#define GFXMMU_LUT425H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT425H_LO_0             (0x1u<<0)

// LUT426L Configuration

#define GFXMMU_LUT426L_LVB              (0xFFu<<16)
#define GFXMMU_LUT426L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT426L_FVB              (0xFFu<<8)
#define GFXMMU_LUT426L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT426L_EN               (0x1u<<0)

#define GFXMMU_LUT426L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT426L_EN_B_0X1         (0x1u<<0)

// LUT426H Configuration

#define GFXMMU_LUT426H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT426H_LO_0             (0x1u<<0)

// LUT427L Configuration

#define GFXMMU_LUT427L_LVB              (0xFFu<<16)
#define GFXMMU_LUT427L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT427L_FVB              (0xFFu<<8)
#define GFXMMU_LUT427L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT427L_EN               (0x1u<<0)

#define GFXMMU_LUT427L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT427L_EN_B_0X1         (0x1u<<0)

// LUT427H Configuration

#define GFXMMU_LUT427H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT427H_LO_0             (0x1u<<0)

// LUT428L Configuration

#define GFXMMU_LUT428L_LVB              (0xFFu<<16)
#define GFXMMU_LUT428L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT428L_FVB              (0xFFu<<8)
#define GFXMMU_LUT428L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT428L_EN               (0x1u<<0)

#define GFXMMU_LUT428L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT428L_EN_B_0X1         (0x1u<<0)

// LUT428H Configuration

#define GFXMMU_LUT428H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT428H_LO_0             (0x1u<<0)

// LUT429L Configuration

#define GFXMMU_LUT429L_LVB              (0xFFu<<16)
#define GFXMMU_LUT429L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT429L_FVB              (0xFFu<<8)
#define GFXMMU_LUT429L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT429L_EN               (0x1u<<0)

#define GFXMMU_LUT429L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT429L_EN_B_0X1         (0x1u<<0)

// LUT429H Configuration

#define GFXMMU_LUT429H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT429H_LO_0             (0x1u<<0)

// LUT430L Configuration

#define GFXMMU_LUT430L_LVB              (0xFFu<<16)
#define GFXMMU_LUT430L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT430L_FVB              (0xFFu<<8)
#define GFXMMU_LUT430L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT430L_EN               (0x1u<<0)

#define GFXMMU_LUT430L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT430L_EN_B_0X1         (0x1u<<0)

// LUT430H Configuration

#define GFXMMU_LUT430H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT430H_LO_0             (0x1u<<0)

// LUT431L Configuration

#define GFXMMU_LUT431L_LVB              (0xFFu<<16)
#define GFXMMU_LUT431L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT431L_FVB              (0xFFu<<8)
#define GFXMMU_LUT431L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT431L_EN               (0x1u<<0)

#define GFXMMU_LUT431L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT431L_EN_B_0X1         (0x1u<<0)

// LUT431H Configuration

#define GFXMMU_LUT431H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT431H_LO_0             (0x1u<<0)

// LUT432L Configuration

#define GFXMMU_LUT432L_LVB              (0xFFu<<16)
#define GFXMMU_LUT432L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT432L_FVB              (0xFFu<<8)
#define GFXMMU_LUT432L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT432L_EN               (0x1u<<0)

#define GFXMMU_LUT432L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT432L_EN_B_0X1         (0x1u<<0)

// LUT432H Configuration

#define GFXMMU_LUT432H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT432H_LO_0             (0x1u<<0)

// LUT433L Configuration

#define GFXMMU_LUT433L_LVB              (0xFFu<<16)
#define GFXMMU_LUT433L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT433L_FVB              (0xFFu<<8)
#define GFXMMU_LUT433L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT433L_EN               (0x1u<<0)

