Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_gfxmmu.h
#define GFXMMU_LUT433L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT433L_EN_B_0X1         (0x1u<<0)

// LUT433H Configuration

#define GFXMMU_LUT433H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT433H_LO_0             (0x1u<<0)

// LUT434L Configuration

#define GFXMMU_LUT434L_LVB              (0xFFu<<16)
#define GFXMMU_LUT434L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT434L_FVB              (0xFFu<<8)
#define GFXMMU_LUT434L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT434L_EN               (0x1u<<0)

#define GFXMMU_LUT434L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT434L_EN_B_0X1         (0x1u<<0)

// LUT434H Configuration

#define GFXMMU_LUT434H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT434H_LO_0             (0x1u<<0)

// LUT435L Configuration

#define GFXMMU_LUT435L_LVB              (0xFFu<<16)
#define GFXMMU_LUT435L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT435L_FVB              (0xFFu<<8)
#define GFXMMU_LUT435L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT435L_EN               (0x1u<<0)

#define GFXMMU_LUT435L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT435L_EN_B_0X1         (0x1u<<0)

// LUT435H Configuration

#define GFXMMU_LUT435H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT435H_LO_0             (0x1u<<0)

// LUT436L Configuration

#define GFXMMU_LUT436L_LVB              (0xFFu<<16)
#define GFXMMU_LUT436L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT436L_FVB              (0xFFu<<8)
#define GFXMMU_LUT436L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT436L_EN               (0x1u<<0)

#define GFXMMU_LUT436L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT436L_EN_B_0X1         (0x1u<<0)

// LUT436H Configuration

#define GFXMMU_LUT436H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT436H_LO_0             (0x1u<<0)

// LUT437L Configuration

#define GFXMMU_LUT437L_LVB              (0xFFu<<16)
#define GFXMMU_LUT437L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT437L_FVB              (0xFFu<<8)
#define GFXMMU_LUT437L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT437L_EN               (0x1u<<0)

#define GFXMMU_LUT437L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT437L_EN_B_0X1         (0x1u<<0)

// LUT437H Configuration

#define GFXMMU_LUT437H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT437H_LO_0             (0x1u<<0)

// LUT438L Configuration

#define GFXMMU_LUT438L_LVB              (0xFFu<<16)
#define GFXMMU_LUT438L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT438L_FVB              (0xFFu<<8)
#define GFXMMU_LUT438L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT438L_EN               (0x1u<<0)

#define GFXMMU_LUT438L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT438L_EN_B_0X1         (0x1u<<0)

// LUT438H Configuration

#define GFXMMU_LUT438H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT438H_LO_0             (0x1u<<0)

// LUT439L Configuration

#define GFXMMU_LUT439L_LVB              (0xFFu<<16)
#define GFXMMU_LUT439L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT439L_FVB              (0xFFu<<8)
#define GFXMMU_LUT439L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT439L_EN               (0x1u<<0)

#define GFXMMU_LUT439L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT439L_EN_B_0X1         (0x1u<<0)

// LUT439H Configuration

#define GFXMMU_LUT439H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT439H_LO_0             (0x1u<<0)

// LUT440L Configuration

#define GFXMMU_LUT440L_LVB              (0xFFu<<16)
#define GFXMMU_LUT440L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT440L_FVB              (0xFFu<<8)
#define GFXMMU_LUT440L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT440L_EN               (0x1u<<0)

#define GFXMMU_LUT440L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT440L_EN_B_0X1         (0x1u<<0)

// LUT440H Configuration

#define GFXMMU_LUT440H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT440H_LO_0             (0x1u<<0)

// LUT441L Configuration

#define GFXMMU_LUT441L_LVB              (0xFFu<<16)
#define GFXMMU_LUT441L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT441L_FVB              (0xFFu<<8)
#define GFXMMU_LUT441L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT441L_EN               (0x1u<<0)

#define GFXMMU_LUT441L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT441L_EN_B_0X1         (0x1u<<0)

// LUT441H Configuration

#define GFXMMU_LUT441H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT441H_LO_0             (0x1u<<0)

// LUT442L Configuration

#define GFXMMU_LUT442L_LVB              (0xFFu<<16)
#define GFXMMU_LUT442L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT442L_FVB              (0xFFu<<8)
#define GFXMMU_LUT442L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT442L_EN               (0x1u<<0)

#define GFXMMU_LUT442L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT442L_EN_B_0X1         (0x1u<<0)

// LUT442H Configuration

#define GFXMMU_LUT442H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT442H_LO_0             (0x1u<<0)

// LUT443L Configuration

#define GFXMMU_LUT443L_LVB              (0xFFu<<16)
#define GFXMMU_LUT443L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT443L_FVB              (0xFFu<<8)
#define GFXMMU_LUT443L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT443L_EN               (0x1u<<0)

#define GFXMMU_LUT443L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT443L_EN_B_0X1         (0x1u<<0)

// LUT443H Configuration

#define GFXMMU_LUT443H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT443H_LO_0             (0x1u<<0)

// LUT444L Configuration

#define GFXMMU_LUT444L_LVB              (0xFFu<<16)
#define GFXMMU_LUT444L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT444L_FVB              (0xFFu<<8)
#define GFXMMU_LUT444L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT444L_EN               (0x1u<<0)

#define GFXMMU_LUT444L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT444L_EN_B_0X1         (0x1u<<0)

// LUT444H Configuration

#define GFXMMU_LUT444H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT444H_LO_0             (0x1u<<0)

// LUT445L Configuration

#define GFXMMU_LUT445L_LVB              (0xFFu<<16)
#define GFXMMU_LUT445L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT445L_FVB              (0xFFu<<8)
#define GFXMMU_LUT445L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT445L_EN               (0x1u<<0)

#define GFXMMU_LUT445L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT445L_EN_B_0X1         (0x1u<<0)

// LUT445H Configuration

