Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_gfxmmu.h
#define GFXMMU_LUT457H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT457H_LO_0             (0x1u<<0)

// LUT458L Configuration

#define GFXMMU_LUT458L_LVB              (0xFFu<<16)
#define GFXMMU_LUT458L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT458L_FVB              (0xFFu<<8)
#define GFXMMU_LUT458L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT458L_EN               (0x1u<<0)

#define GFXMMU_LUT458L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT458L_EN_B_0X1         (0x1u<<0)

// LUT458H Configuration

#define GFXMMU_LUT458H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT458H_LO_0             (0x1u<<0)

// LUT459L Configuration

#define GFXMMU_LUT459L_LVB              (0xFFu<<16)
#define GFXMMU_LUT459L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT459L_FVB              (0xFFu<<8)
#define GFXMMU_LUT459L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT459L_EN               (0x1u<<0)

#define GFXMMU_LUT459L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT459L_EN_B_0X1         (0x1u<<0)

// LUT459H Configuration

#define GFXMMU_LUT459H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT459H_LO_0             (0x1u<<0)

// LUT460L Configuration

#define GFXMMU_LUT460L_LVB              (0xFFu<<16)
#define GFXMMU_LUT460L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT460L_FVB              (0xFFu<<8)
#define GFXMMU_LUT460L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT460L_EN               (0x1u<<0)

#define GFXMMU_LUT460L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT460L_EN_B_0X1         (0x1u<<0)

// LUT460H Configuration

#define GFXMMU_LUT460H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT460H_LO_0             (0x1u<<0)

// LUT461L Configuration

#define GFXMMU_LUT461L_LVB              (0xFFu<<16)
#define GFXMMU_LUT461L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT461L_FVB              (0xFFu<<8)
#define GFXMMU_LUT461L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT461L_EN               (0x1u<<0)

#define GFXMMU_LUT461L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT461L_EN_B_0X1         (0x1u<<0)

// LUT461H Configuration

#define GFXMMU_LUT461H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT461H_LO_0             (0x1u<<0)

// LUT462L Configuration

#define GFXMMU_LUT462L_LVB              (0xFFu<<16)
#define GFXMMU_LUT462L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT462L_FVB              (0xFFu<<8)
#define GFXMMU_LUT462L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT462L_EN               (0x1u<<0)

#define GFXMMU_LUT462L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT462L_EN_B_0X1         (0x1u<<0)

// LUT462H Configuration

#define GFXMMU_LUT462H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT462H_LO_0             (0x1u<<0)

// LUT463L Configuration

#define GFXMMU_LUT463L_LVB              (0xFFu<<16)
#define GFXMMU_LUT463L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT463L_FVB              (0xFFu<<8)
#define GFXMMU_LUT463L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT463L_EN               (0x1u<<0)

#define GFXMMU_LUT463L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT463L_EN_B_0X1         (0x1u<<0)

// LUT463H Configuration

#define GFXMMU_LUT463H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT463H_LO_0             (0x1u<<0)

// LUT464L Configuration

#define GFXMMU_LUT464L_LVB              (0xFFu<<16)
#define GFXMMU_LUT464L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT464L_FVB              (0xFFu<<8)
#define GFXMMU_LUT464L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT464L_EN               (0x1u<<0)

#define GFXMMU_LUT464L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT464L_EN_B_0X1         (0x1u<<0)

// LUT464H Configuration

#define GFXMMU_LUT464H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT464H_LO_0             (0x1u<<0)

// LUT465L Configuration

#define GFXMMU_LUT465L_LVB              (0xFFu<<16)
#define GFXMMU_LUT465L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT465L_FVB              (0xFFu<<8)
#define GFXMMU_LUT465L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT465L_EN               (0x1u<<0)

#define GFXMMU_LUT465L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT465L_EN_B_0X1         (0x1u<<0)

// LUT465H Configuration

#define GFXMMU_LUT465H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT465H_LO_0             (0x1u<<0)

// LUT466L Configuration

#define GFXMMU_LUT466L_LVB              (0xFFu<<16)
#define GFXMMU_LUT466L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT466L_FVB              (0xFFu<<8)
#define GFXMMU_LUT466L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT466L_EN               (0x1u<<0)

#define GFXMMU_LUT466L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT466L_EN_B_0X1         (0x1u<<0)

// LUT466H Configuration

#define GFXMMU_LUT466H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT466H_LO_0             (0x1u<<0)

// LUT467L Configuration

#define GFXMMU_LUT467L_LVB              (0xFFu<<16)
#define GFXMMU_LUT467L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT467L_FVB              (0xFFu<<8)
#define GFXMMU_LUT467L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT467L_EN               (0x1u<<0)

#define GFXMMU_LUT467L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT467L_EN_B_0X1         (0x1u<<0)

// LUT467H Configuration

#define GFXMMU_LUT467H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT467H_LO_0             (0x1u<<0)

// LUT468L Configuration

#define GFXMMU_LUT468L_LVB              (0xFFu<<16)
#define GFXMMU_LUT468L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT468L_FVB              (0xFFu<<8)
#define GFXMMU_LUT468L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT468L_EN               (0x1u<<0)

#define GFXMMU_LUT468L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT468L_EN_B_0X1         (0x1u<<0)

// LUT468H Configuration

#define GFXMMU_LUT468H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT468H_LO_0             (0x1u<<0)

// LUT469L Configuration

#define GFXMMU_LUT469L_LVB              (0xFFu<<16)
#define GFXMMU_LUT469L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT469L_FVB              (0xFFu<<8)
#define GFXMMU_LUT469L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT469L_EN               (0x1u<<0)

#define GFXMMU_LUT469L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT469L_EN_B_0X1         (0x1u<<0)

// LUT469H Configuration

#define GFXMMU_LUT469H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT469H_LO_0             (0x1u<<0)

