Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_gfxmmu.h
#define GFXMMU_LUT482H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT482H_LO_0             (0x1u<<0)

// LUT483L Configuration

#define GFXMMU_LUT483L_LVB              (0xFFu<<16)
#define GFXMMU_LUT483L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT483L_FVB              (0xFFu<<8)
#define GFXMMU_LUT483L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT483L_EN               (0x1u<<0)

#define GFXMMU_LUT483L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT483L_EN_B_0X1         (0x1u<<0)

// LUT483H Configuration

#define GFXMMU_LUT483H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT483H_LO_0             (0x1u<<0)

// LUT484L Configuration

#define GFXMMU_LUT484L_LVB              (0xFFu<<16)
#define GFXMMU_LUT484L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT484L_FVB              (0xFFu<<8)
#define GFXMMU_LUT484L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT484L_EN               (0x1u<<0)

#define GFXMMU_LUT484L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT484L_EN_B_0X1         (0x1u<<0)

// LUT484H Configuration

#define GFXMMU_LUT484H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT484H_LO_0             (0x1u<<0)

// LUT485L Configuration

#define GFXMMU_LUT485L_LVB              (0xFFu<<16)
#define GFXMMU_LUT485L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT485L_FVB              (0xFFu<<8)
#define GFXMMU_LUT485L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT485L_EN               (0x1u<<0)

#define GFXMMU_LUT485L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT485L_EN_B_0X1         (0x1u<<0)

// LUT485H Configuration

#define GFXMMU_LUT485H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT485H_LO_0             (0x1u<<0)

// LUT486L Configuration

#define GFXMMU_LUT486L_LVB              (0xFFu<<16)
#define GFXMMU_LUT486L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT486L_FVB              (0xFFu<<8)
#define GFXMMU_LUT486L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT486L_EN               (0x1u<<0)

#define GFXMMU_LUT486L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT486L_EN_B_0X1         (0x1u<<0)

// LUT486H Configuration

#define GFXMMU_LUT486H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT486H_LO_0             (0x1u<<0)

// LUT487L Configuration

#define GFXMMU_LUT487L_LVB              (0xFFu<<16)
#define GFXMMU_LUT487L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT487L_FVB              (0xFFu<<8)
#define GFXMMU_LUT487L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT487L_EN               (0x1u<<0)

#define GFXMMU_LUT487L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT487L_EN_B_0X1         (0x1u<<0)

// LUT487H Configuration

#define GFXMMU_LUT487H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT487H_LO_0             (0x1u<<0)

// LUT488L Configuration

#define GFXMMU_LUT488L_LVB              (0xFFu<<16)
#define GFXMMU_LUT488L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT488L_FVB              (0xFFu<<8)
#define GFXMMU_LUT488L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT488L_EN               (0x1u<<0)

#define GFXMMU_LUT488L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT488L_EN_B_0X1         (0x1u<<0)

// LUT488H Configuration

#define GFXMMU_LUT488H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT488H_LO_0             (0x1u<<0)

// LUT489L Configuration

#define GFXMMU_LUT489L_LVB              (0xFFu<<16)
#define GFXMMU_LUT489L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT489L_FVB              (0xFFu<<8)
#define GFXMMU_LUT489L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT489L_EN               (0x1u<<0)

#define GFXMMU_LUT489L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT489L_EN_B_0X1         (0x1u<<0)

// LUT489H Configuration

#define GFXMMU_LUT489H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT489H_LO_0             (0x1u<<0)

// LUT490L Configuration

#define GFXMMU_LUT490L_LVB              (0xFFu<<16)
#define GFXMMU_LUT490L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT490L_FVB              (0xFFu<<8)
#define GFXMMU_LUT490L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT490L_EN               (0x1u<<0)

#define GFXMMU_LUT490L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT490L_EN_B_0X1         (0x1u<<0)

// LUT490H Configuration

#define GFXMMU_LUT490H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT490H_LO_0             (0x1u<<0)

// LUT491L Configuration

#define GFXMMU_LUT491L_LVB              (0xFFu<<16)
#define GFXMMU_LUT491L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT491L_FVB              (0xFFu<<8)
#define GFXMMU_LUT491L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT491L_EN               (0x1u<<0)

#define GFXMMU_LUT491L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT491L_EN_B_0X1         (0x1u<<0)

// LUT491H Configuration

#define GFXMMU_LUT491H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT491H_LO_0             (0x1u<<0)

// LUT492L Configuration

#define GFXMMU_LUT492L_LVB              (0xFFu<<16)
#define GFXMMU_LUT492L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT492L_FVB              (0xFFu<<8)
#define GFXMMU_LUT492L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT492L_EN               (0x1u<<0)

#define GFXMMU_LUT492L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT492L_EN_B_0X1         (0x1u<<0)

// LUT492H Configuration

#define GFXMMU_LUT492H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT492H_LO_0             (0x1u<<0)

// LUT493L Configuration

#define GFXMMU_LUT493L_LVB              (0xFFu<<16)
#define GFXMMU_LUT493L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT493L_FVB              (0xFFu<<8)
#define GFXMMU_LUT493L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT493L_EN               (0x1u<<0)

#define GFXMMU_LUT493L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT493L_EN_B_0X1         (0x1u<<0)

// LUT493H Configuration

#define GFXMMU_LUT493H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT493H_LO_0             (0x1u<<0)

// LUT494L Configuration

#define GFXMMU_LUT494L_LVB              (0xFFu<<16)
#define GFXMMU_LUT494L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT494L_FVB              (0xFFu<<8)
#define GFXMMU_LUT494L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT494L_EN               (0x1u<<0)

