Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_gfxmmu.h
#define GFXMMU_LUT494L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT494L_EN_B_0X1         (0x1u<<0)

// LUT494H Configuration

#define GFXMMU_LUT494H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT494H_LO_0             (0x1u<<0)

// LUT495L Configuration

#define GFXMMU_LUT495L_LVB              (0xFFu<<16)
#define GFXMMU_LUT495L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT495L_FVB              (0xFFu<<8)
#define GFXMMU_LUT495L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT495L_EN               (0x1u<<0)

#define GFXMMU_LUT495L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT495L_EN_B_0X1         (0x1u<<0)

// LUT495H Configuration

#define GFXMMU_LUT495H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT495H_LO_0             (0x1u<<0)

// LUT496L Configuration

#define GFXMMU_LUT496L_LVB              (0xFFu<<16)
#define GFXMMU_LUT496L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT496L_FVB              (0xFFu<<8)
#define GFXMMU_LUT496L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT496L_EN               (0x1u<<0)

#define GFXMMU_LUT496L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT496L_EN_B_0X1         (0x1u<<0)

// LUT496H Configuration

#define GFXMMU_LUT496H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT496H_LO_0             (0x1u<<0)

// LUT497L Configuration

#define GFXMMU_LUT497L_LVB              (0xFFu<<16)
#define GFXMMU_LUT497L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT497L_FVB              (0xFFu<<8)
#define GFXMMU_LUT497L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT497L_EN               (0x1u<<0)

#define GFXMMU_LUT497L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT497L_EN_B_0X1         (0x1u<<0)

// LUT497H Configuration

#define GFXMMU_LUT497H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT497H_LO_0             (0x1u<<0)

// LUT498L Configuration

#define GFXMMU_LUT498L_LVB              (0xFFu<<16)
#define GFXMMU_LUT498L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT498L_FVB              (0xFFu<<8)
#define GFXMMU_LUT498L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT498L_EN               (0x1u<<0)

#define GFXMMU_LUT498L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT498L_EN_B_0X1         (0x1u<<0)

// LUT498H Configuration

#define GFXMMU_LUT498H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT498H_LO_0             (0x1u<<0)

// LUT499L Configuration

#define GFXMMU_LUT499L_LVB              (0xFFu<<16)
#define GFXMMU_LUT499L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT499L_FVB              (0xFFu<<8)
#define GFXMMU_LUT499L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT499L_EN               (0x1u<<0)

#define GFXMMU_LUT499L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT499L_EN_B_0X1         (0x1u<<0)

// LUT499H Configuration

#define GFXMMU_LUT499H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT499H_LO_0             (0x1u<<0)

// LUT500L Configuration

#define GFXMMU_LUT500L_LVB              (0xFFu<<16)
#define GFXMMU_LUT500L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT500L_FVB              (0xFFu<<8)
#define GFXMMU_LUT500L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT500L_EN               (0x1u<<0)

#define GFXMMU_LUT500L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT500L_EN_B_0X1         (0x1u<<0)

// LUT500H Configuration

#define GFXMMU_LUT500H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT500H_LO_0             (0x1u<<0)

// LUT501L Configuration

#define GFXMMU_LUT501L_LVB              (0xFFu<<16)
#define GFXMMU_LUT501L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT501L_FVB              (0xFFu<<8)
#define GFXMMU_LUT501L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT501L_EN               (0x1u<<0)

#define GFXMMU_LUT501L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT501L_EN_B_0X1         (0x1u<<0)

// LUT501H Configuration

#define GFXMMU_LUT501H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT501H_LO_0             (0x1u<<0)

// LUT502L Configuration

#define GFXMMU_LUT502L_LVB              (0xFFu<<16)
#define GFXMMU_LUT502L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT502L_FVB              (0xFFu<<8)
#define GFXMMU_LUT502L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT502L_EN               (0x1u<<0)

#define GFXMMU_LUT502L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT502L_EN_B_0X1         (0x1u<<0)

// LUT502H Configuration

#define GFXMMU_LUT502H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT502H_LO_0             (0x1u<<0)

// LUT503L Configuration

#define GFXMMU_LUT503L_LVB              (0xFFu<<16)
#define GFXMMU_LUT503L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT503L_FVB              (0xFFu<<8)
#define GFXMMU_LUT503L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT503L_EN               (0x1u<<0)

#define GFXMMU_LUT503L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT503L_EN_B_0X1         (0x1u<<0)

// LUT503H Configuration

#define GFXMMU_LUT503H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT503H_LO_0             (0x1u<<0)

// LUT504L Configuration

#define GFXMMU_LUT504L_LVB              (0xFFu<<16)
#define GFXMMU_LUT504L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT504L_FVB              (0xFFu<<8)
#define GFXMMU_LUT504L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT504L_EN               (0x1u<<0)

#define GFXMMU_LUT504L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT504L_EN_B_0X1         (0x1u<<0)

// LUT504H Configuration

#define GFXMMU_LUT504H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT504H_LO_0             (0x1u<<0)

// LUT505L Configuration

#define GFXMMU_LUT505L_LVB              (0xFFu<<16)
#define GFXMMU_LUT505L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT505L_FVB              (0xFFu<<8)
#define GFXMMU_LUT505L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT505L_EN               (0x1u<<0)

#define GFXMMU_LUT505L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT505L_EN_B_0X1         (0x1u<<0)

// LUT505H Configuration

#define GFXMMU_LUT505H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT505H_LO_0             (0x1u<<0)

// LUT506L Configuration

#define GFXMMU_LUT506L_LVB              (0xFFu<<16)
#define GFXMMU_LUT506L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT506L_FVB              (0xFFu<<8)
#define GFXMMU_LUT506L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT506L_EN               (0x1u<<0)

