Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_gfxmmu.h
#define GFXMMU_LUT506L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT506L_EN_B_0X1         (0x1u<<0)

// LUT506H Configuration

#define GFXMMU_LUT506H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT506H_LO_0             (0x1u<<0)

// LUT507L Configuration

#define GFXMMU_LUT507L_LVB              (0xFFu<<16)
#define GFXMMU_LUT507L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT507L_FVB              (0xFFu<<8)
#define GFXMMU_LUT507L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT507L_EN               (0x1u<<0)

#define GFXMMU_LUT507L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT507L_EN_B_0X1         (0x1u<<0)

// LUT507H Configuration

#define GFXMMU_LUT507H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT507H_LO_0             (0x1u<<0)

// LUT508L Configuration

#define GFXMMU_LUT508L_LVB              (0xFFu<<16)
#define GFXMMU_LUT508L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT508L_FVB              (0xFFu<<8)
#define GFXMMU_LUT508L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT508L_EN               (0x1u<<0)

#define GFXMMU_LUT508L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT508L_EN_B_0X1         (0x1u<<0)

// LUT508H Configuration

#define GFXMMU_LUT508H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT508H_LO_0             (0x1u<<0)

// LUT509L Configuration

#define GFXMMU_LUT509L_LVB              (0xFFu<<16)
#define GFXMMU_LUT509L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT509L_FVB              (0xFFu<<8)
#define GFXMMU_LUT509L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT509L_EN               (0x1u<<0)

#define GFXMMU_LUT509L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT509L_EN_B_0X1         (0x1u<<0)

// LUT509H Configuration

#define GFXMMU_LUT509H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT509H_LO_0             (0x1u<<0)

// LUT510L Configuration

#define GFXMMU_LUT510L_LVB              (0xFFu<<16)
#define GFXMMU_LUT510L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT510L_FVB              (0xFFu<<8)
#define GFXMMU_LUT510L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT510L_EN               (0x1u<<0)

#define GFXMMU_LUT510L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT510L_EN_B_0X1         (0x1u<<0)

// LUT510H Configuration

#define GFXMMU_LUT510H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT510H_LO_0             (0x1u<<0)

// LUT511L Configuration

#define GFXMMU_LUT511L_LVB              (0xFFu<<16)
#define GFXMMU_LUT511L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT511L_FVB              (0xFFu<<8)
#define GFXMMU_LUT511L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT511L_EN               (0x1u<<0)

#define GFXMMU_LUT511L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT511L_EN_B_0X1         (0x1u<<0)

// LUT511H Configuration

#define GFXMMU_LUT511H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT511H_LO_0             (0x1u<<0)

// LUT512L Configuration

#define GFXMMU_LUT512L_LVB              (0xFFu<<16)
#define GFXMMU_LUT512L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT512L_FVB              (0xFFu<<8)
#define GFXMMU_LUT512L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT512L_EN               (0x1u<<0)

#define GFXMMU_LUT512L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT512L_EN_B_0X1         (0x1u<<0)

// LUT512H Configuration

#define GFXMMU_LUT512H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT512H_LO_0             (0x1u<<0)

// LUT513L Configuration

#define GFXMMU_LUT513L_LVB              (0xFFu<<16)
#define GFXMMU_LUT513L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT513L_FVB              (0xFFu<<8)
#define GFXMMU_LUT513L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT513L_EN               (0x1u<<0)

#define GFXMMU_LUT513L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT513L_EN_B_0X1         (0x1u<<0)

// LUT513H Configuration

#define GFXMMU_LUT513H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT513H_LO_0             (0x1u<<0)

// LUT514L Configuration

#define GFXMMU_LUT514L_LVB              (0xFFu<<16)
#define GFXMMU_LUT514L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT514L_FVB              (0xFFu<<8)
#define GFXMMU_LUT514L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT514L_EN               (0x1u<<0)

#define GFXMMU_LUT514L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT514L_EN_B_0X1         (0x1u<<0)

// LUT514H Configuration

#define GFXMMU_LUT514H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT514H_LO_0             (0x1u<<0)

// LUT515L Configuration

#define GFXMMU_LUT515L_LVB              (0xFFu<<16)
#define GFXMMU_LUT515L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT515L_FVB              (0xFFu<<8)
#define GFXMMU_LUT515L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT515L_EN               (0x1u<<0)

#define GFXMMU_LUT515L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT515L_EN_B_0X1         (0x1u<<0)

// LUT515H Configuration

#define GFXMMU_LUT515H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT515H_LO_0             (0x1u<<0)

// LUT516L Configuration

#define GFXMMU_LUT516L_LVB              (0xFFu<<16)
#define GFXMMU_LUT516L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT516L_FVB              (0xFFu<<8)
#define GFXMMU_LUT516L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT516L_EN               (0x1u<<0)

#define GFXMMU_LUT516L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT516L_EN_B_0X1         (0x1u<<0)

// LUT516H Configuration

#define GFXMMU_LUT516H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT516H_LO_0             (0x1u<<0)

// LUT517L Configuration

#define GFXMMU_LUT517L_LVB              (0xFFu<<16)
#define GFXMMU_LUT517L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT517L_FVB              (0xFFu<<8)
#define GFXMMU_LUT517L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT517L_EN               (0x1u<<0)

#define GFXMMU_LUT517L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT517L_EN_B_0X1         (0x1u<<0)

// LUT517H Configuration

#define GFXMMU_LUT517H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT517H_LO_0             (0x1u<<0)

// LUT518L Configuration

#define GFXMMU_LUT518L_LVB              (0xFFu<<16)
#define GFXMMU_LUT518L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT518L_FVB              (0xFFu<<8)
#define GFXMMU_LUT518L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT518L_EN               (0x1u<<0)

#define GFXMMU_LUT518L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT518L_EN_B_0X1         (0x1u<<0)

// LUT518H Configuration

