Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_gfxmmu.h
#define GFXMMU_LUT518H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT518H_LO_0             (0x1u<<0)

// LUT519L Configuration

#define GFXMMU_LUT519L_LVB              (0xFFu<<16)
#define GFXMMU_LUT519L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT519L_FVB              (0xFFu<<8)
#define GFXMMU_LUT519L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT519L_EN               (0x1u<<0)

#define GFXMMU_LUT519L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT519L_EN_B_0X1         (0x1u<<0)

// LUT519H Configuration

#define GFXMMU_LUT519H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT519H_LO_0             (0x1u<<0)

// LUT520L Configuration

#define GFXMMU_LUT520L_LVB              (0xFFu<<16)
#define GFXMMU_LUT520L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT520L_FVB              (0xFFu<<8)
#define GFXMMU_LUT520L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT520L_EN               (0x1u<<0)

#define GFXMMU_LUT520L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT520L_EN_B_0X1         (0x1u<<0)

// LUT520H Configuration

#define GFXMMU_LUT520H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT520H_LO_0             (0x1u<<0)

// LUT521L Configuration

#define GFXMMU_LUT521L_LVB              (0xFFu<<16)
#define GFXMMU_LUT521L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT521L_FVB              (0xFFu<<8)
#define GFXMMU_LUT521L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT521L_EN               (0x1u<<0)

#define GFXMMU_LUT521L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT521L_EN_B_0X1         (0x1u<<0)

// LUT521H Configuration

#define GFXMMU_LUT521H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT521H_LO_0             (0x1u<<0)

// LUT522L Configuration

#define GFXMMU_LUT522L_LVB              (0xFFu<<16)
#define GFXMMU_LUT522L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT522L_FVB              (0xFFu<<8)
#define GFXMMU_LUT522L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT522L_EN               (0x1u<<0)

#define GFXMMU_LUT522L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT522L_EN_B_0X1         (0x1u<<0)

// LUT522H Configuration

#define GFXMMU_LUT522H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT522H_LO_0             (0x1u<<0)

// LUT523L Configuration

#define GFXMMU_LUT523L_LVB              (0xFFu<<16)
#define GFXMMU_LUT523L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT523L_FVB              (0xFFu<<8)
#define GFXMMU_LUT523L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT523L_EN               (0x1u<<0)

#define GFXMMU_LUT523L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT523L_EN_B_0X1         (0x1u<<0)

// LUT523H Configuration

#define GFXMMU_LUT523H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT523H_LO_0             (0x1u<<0)

// LUT524L Configuration

#define GFXMMU_LUT524L_LVB              (0xFFu<<16)
#define GFXMMU_LUT524L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT524L_FVB              (0xFFu<<8)
#define GFXMMU_LUT524L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT524L_EN               (0x1u<<0)

#define GFXMMU_LUT524L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT524L_EN_B_0X1         (0x1u<<0)

// LUT524H Configuration

#define GFXMMU_LUT524H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT524H_LO_0             (0x1u<<0)

// LUT525L Configuration

#define GFXMMU_LUT525L_LVB              (0xFFu<<16)
#define GFXMMU_LUT525L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT525L_FVB              (0xFFu<<8)
#define GFXMMU_LUT525L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT525L_EN               (0x1u<<0)

#define GFXMMU_LUT525L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT525L_EN_B_0X1         (0x1u<<0)

// LUT525H Configuration

#define GFXMMU_LUT525H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT525H_LO_0             (0x1u<<0)

// LUT526L Configuration

#define GFXMMU_LUT526L_LVB              (0xFFu<<16)
#define GFXMMU_LUT526L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT526L_FVB              (0xFFu<<8)
#define GFXMMU_LUT526L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT526L_EN               (0x1u<<0)

#define GFXMMU_LUT526L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT526L_EN_B_0X1         (0x1u<<0)

// LUT526H Configuration

#define GFXMMU_LUT526H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT526H_LO_0             (0x1u<<0)

// LUT527L Configuration

#define GFXMMU_LUT527L_LVB              (0xFFu<<16)
#define GFXMMU_LUT527L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT527L_FVB              (0xFFu<<8)
#define GFXMMU_LUT527L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT527L_EN               (0x1u<<0)

#define GFXMMU_LUT527L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT527L_EN_B_0X1         (0x1u<<0)

// LUT527H Configuration

#define GFXMMU_LUT527H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT527H_LO_0             (0x1u<<0)

// LUT528L Configuration

#define GFXMMU_LUT528L_LVB              (0xFFu<<16)
#define GFXMMU_LUT528L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT528L_FVB              (0xFFu<<8)
#define GFXMMU_LUT528L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT528L_EN               (0x1u<<0)

#define GFXMMU_LUT528L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT528L_EN_B_0X1         (0x1u<<0)

// LUT528H Configuration

#define GFXMMU_LUT528H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT528H_LO_0             (0x1u<<0)

// LUT529L Configuration

#define GFXMMU_LUT529L_LVB              (0xFFu<<16)
#define GFXMMU_LUT529L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT529L_FVB              (0xFFu<<8)
#define GFXMMU_LUT529L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT529L_EN               (0x1u<<0)

#define GFXMMU_LUT529L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT529L_EN_B_0X1         (0x1u<<0)

// LUT529H Configuration

#define GFXMMU_LUT529H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT529H_LO_0             (0x1u<<0)

// LUT530L Configuration

#define GFXMMU_LUT530L_LVB              (0xFFu<<16)
#define GFXMMU_LUT530L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT530L_FVB              (0xFFu<<8)
#define GFXMMU_LUT530L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT530L_EN               (0x1u<<0)

#define GFXMMU_LUT530L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT530L_EN_B_0X1         (0x1u<<0)

// LUT530H Configuration

#define GFXMMU_LUT530H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT530H_LO_0             (0x1u<<0)

// LUT531L Configuration

#define GFXMMU_LUT531L_LVB              (0xFFu<<16)
#define GFXMMU_LUT531L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT531L_FVB              (0xFFu<<8)
#define GFXMMU_LUT531L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT531L_EN               (0x1u<<0)

#define GFXMMU_LUT531L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT531L_EN_B_0X1         (0x1u<<0)

