Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_gfxmmu.h
// LUT531H Configuration

#define GFXMMU_LUT531H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT531H_LO_0             (0x1u<<0)

// LUT532L Configuration

#define GFXMMU_LUT532L_LVB              (0xFFu<<16)
#define GFXMMU_LUT532L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT532L_FVB              (0xFFu<<8)
#define GFXMMU_LUT532L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT532L_EN               (0x1u<<0)

#define GFXMMU_LUT532L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT532L_EN_B_0X1         (0x1u<<0)

// LUT532H Configuration

#define GFXMMU_LUT532H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT532H_LO_0             (0x1u<<0)

// LUT533L Configuration

#define GFXMMU_LUT533L_LVB              (0xFFu<<16)
#define GFXMMU_LUT533L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT533L_FVB              (0xFFu<<8)
#define GFXMMU_LUT533L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT533L_EN               (0x1u<<0)

#define GFXMMU_LUT533L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT533L_EN_B_0X1         (0x1u<<0)

// LUT533H Configuration

#define GFXMMU_LUT533H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT533H_LO_0             (0x1u<<0)

// LUT534L Configuration

#define GFXMMU_LUT534L_LVB              (0xFFu<<16)
#define GFXMMU_LUT534L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT534L_FVB              (0xFFu<<8)
#define GFXMMU_LUT534L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT534L_EN               (0x1u<<0)

#define GFXMMU_LUT534L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT534L_EN_B_0X1         (0x1u<<0)

// LUT534H Configuration

#define GFXMMU_LUT534H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT534H_LO_0             (0x1u<<0)

// LUT535L Configuration

#define GFXMMU_LUT535L_LVB              (0xFFu<<16)
#define GFXMMU_LUT535L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT535L_FVB              (0xFFu<<8)
#define GFXMMU_LUT535L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT535L_EN               (0x1u<<0)

#define GFXMMU_LUT535L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT535L_EN_B_0X1         (0x1u<<0)

// LUT535H Configuration

#define GFXMMU_LUT535H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT535H_LO_0             (0x1u<<0)

// LUT536L Configuration

#define GFXMMU_LUT536L_LVB              (0xFFu<<16)
#define GFXMMU_LUT536L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT536L_FVB              (0xFFu<<8)
#define GFXMMU_LUT536L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT536L_EN               (0x1u<<0)

#define GFXMMU_LUT536L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT536L_EN_B_0X1         (0x1u<<0)

// LUT536H Configuration

#define GFXMMU_LUT536H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT536H_LO_0             (0x1u<<0)

// LUT537L Configuration

#define GFXMMU_LUT537L_LVB              (0xFFu<<16)
#define GFXMMU_LUT537L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT537L_FVB              (0xFFu<<8)
#define GFXMMU_LUT537L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT537L_EN               (0x1u<<0)

#define GFXMMU_LUT537L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT537L_EN_B_0X1         (0x1u<<0)

// LUT537H Configuration

#define GFXMMU_LUT537H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT537H_LO_0             (0x1u<<0)

// LUT538L Configuration

#define GFXMMU_LUT538L_LVB              (0xFFu<<16)
#define GFXMMU_LUT538L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT538L_FVB              (0xFFu<<8)
#define GFXMMU_LUT538L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT538L_EN               (0x1u<<0)

#define GFXMMU_LUT538L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT538L_EN_B_0X1         (0x1u<<0)

// LUT538H Configuration

#define GFXMMU_LUT538H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT538H_LO_0             (0x1u<<0)

// LUT539L Configuration

#define GFXMMU_LUT539L_LVB              (0xFFu<<16)
#define GFXMMU_LUT539L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT539L_FVB              (0xFFu<<8)
#define GFXMMU_LUT539L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT539L_EN               (0x1u<<0)

#define GFXMMU_LUT539L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT539L_EN_B_0X1         (0x1u<<0)

// LUT539H Configuration

#define GFXMMU_LUT539H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT539H_LO_0             (0x1u<<0)

// LUT540L Configuration

#define GFXMMU_LUT540L_LVB              (0xFFu<<16)
#define GFXMMU_LUT540L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT540L_FVB              (0xFFu<<8)
#define GFXMMU_LUT540L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT540L_EN               (0x1u<<0)

#define GFXMMU_LUT540L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT540L_EN_B_0X1         (0x1u<<0)

// LUT540H Configuration

#define GFXMMU_LUT540H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT540H_LO_0             (0x1u<<0)

// LUT541L Configuration

#define GFXMMU_LUT541L_LVB              (0xFFu<<16)
#define GFXMMU_LUT541L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT541L_FVB              (0xFFu<<8)
#define GFXMMU_LUT541L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT541L_EN               (0x1u<<0)

#define GFXMMU_LUT541L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT541L_EN_B_0X1         (0x1u<<0)

// LUT541H Configuration

#define GFXMMU_LUT541H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT541H_LO_0             (0x1u<<0)

// LUT542L Configuration

#define GFXMMU_LUT542L_LVB              (0xFFu<<16)
#define GFXMMU_LUT542L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT542L_FVB              (0xFFu<<8)
#define GFXMMU_LUT542L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT542L_EN               (0x1u<<0)

#define GFXMMU_LUT542L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT542L_EN_B_0X1         (0x1u<<0)

// LUT542H Configuration

#define GFXMMU_LUT542H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT542H_LO_0             (0x1u<<0)

// LUT543L Configuration

#define GFXMMU_LUT543L_LVB              (0xFFu<<16)
#define GFXMMU_LUT543L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT543L_FVB              (0xFFu<<8)
#define GFXMMU_LUT543L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT543L_EN               (0x1u<<0)

#define GFXMMU_LUT543L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT543L_EN_B_0X1         (0x1u<<0)

