Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_gfxmmu.h
// LUT543H Configuration

#define GFXMMU_LUT543H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT543H_LO_0             (0x1u<<0)

// LUT544L Configuration

#define GFXMMU_LUT544L_LVB              (0xFFu<<16)
#define GFXMMU_LUT544L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT544L_FVB              (0xFFu<<8)
#define GFXMMU_LUT544L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT544L_EN               (0x1u<<0)

#define GFXMMU_LUT544L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT544L_EN_B_0X1         (0x1u<<0)

// LUT544H Configuration

#define GFXMMU_LUT544H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT544H_LO_0             (0x1u<<0)

// LUT545L Configuration

#define GFXMMU_LUT545L_LVB              (0xFFu<<16)
#define GFXMMU_LUT545L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT545L_FVB              (0xFFu<<8)
#define GFXMMU_LUT545L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT545L_EN               (0x1u<<0)

#define GFXMMU_LUT545L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT545L_EN_B_0X1         (0x1u<<0)

// LUT545H Configuration

#define GFXMMU_LUT545H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT545H_LO_0             (0x1u<<0)

// LUT546L Configuration

#define GFXMMU_LUT546L_LVB              (0xFFu<<16)
#define GFXMMU_LUT546L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT546L_FVB              (0xFFu<<8)
#define GFXMMU_LUT546L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT546L_EN               (0x1u<<0)

#define GFXMMU_LUT546L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT546L_EN_B_0X1         (0x1u<<0)

// LUT546H Configuration

#define GFXMMU_LUT546H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT546H_LO_0             (0x1u<<0)

// LUT547L Configuration

#define GFXMMU_LUT547L_LVB              (0xFFu<<16)
#define GFXMMU_LUT547L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT547L_FVB              (0xFFu<<8)
#define GFXMMU_LUT547L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT547L_EN               (0x1u<<0)

#define GFXMMU_LUT547L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT547L_EN_B_0X1         (0x1u<<0)

// LUT547H Configuration

#define GFXMMU_LUT547H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT547H_LO_0             (0x1u<<0)

// LUT548L Configuration

#define GFXMMU_LUT548L_LVB              (0xFFu<<16)
#define GFXMMU_LUT548L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT548L_FVB              (0xFFu<<8)
#define GFXMMU_LUT548L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT548L_EN               (0x1u<<0)

#define GFXMMU_LUT548L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT548L_EN_B_0X1         (0x1u<<0)

// LUT548H Configuration

#define GFXMMU_LUT548H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT548H_LO_0             (0x1u<<0)

// LUT549L Configuration

#define GFXMMU_LUT549L_LVB              (0xFFu<<16)
#define GFXMMU_LUT549L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT549L_FVB              (0xFFu<<8)
#define GFXMMU_LUT549L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT549L_EN               (0x1u<<0)

#define GFXMMU_LUT549L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT549L_EN_B_0X1         (0x1u<<0)

// LUT549H Configuration

#define GFXMMU_LUT549H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT549H_LO_0             (0x1u<<0)

// LUT550L Configuration

#define GFXMMU_LUT550L_LVB              (0xFFu<<16)
#define GFXMMU_LUT550L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT550L_FVB              (0xFFu<<8)
#define GFXMMU_LUT550L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT550L_EN               (0x1u<<0)

#define GFXMMU_LUT550L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT550L_EN_B_0X1         (0x1u<<0)

// LUT550H Configuration

#define GFXMMU_LUT550H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT550H_LO_0             (0x1u<<0)

// LUT551L Configuration

#define GFXMMU_LUT551L_LVB              (0xFFu<<16)
#define GFXMMU_LUT551L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT551L_FVB              (0xFFu<<8)
#define GFXMMU_LUT551L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT551L_EN               (0x1u<<0)

#define GFXMMU_LUT551L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT551L_EN_B_0X1         (0x1u<<0)

// LUT551H Configuration

#define GFXMMU_LUT551H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT551H_LO_0             (0x1u<<0)

// LUT552L Configuration

#define GFXMMU_LUT552L_LVB              (0xFFu<<16)
#define GFXMMU_LUT552L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT552L_FVB              (0xFFu<<8)
#define GFXMMU_LUT552L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT552L_EN               (0x1u<<0)

#define GFXMMU_LUT552L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT552L_EN_B_0X1         (0x1u<<0)

// LUT552H Configuration

#define GFXMMU_LUT552H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT552H_LO_0             (0x1u<<0)

// LUT553L Configuration

#define GFXMMU_LUT553L_LVB              (0xFFu<<16)
#define GFXMMU_LUT553L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT553L_FVB              (0xFFu<<8)
#define GFXMMU_LUT553L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT553L_EN               (0x1u<<0)

#define GFXMMU_LUT553L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT553L_EN_B_0X1         (0x1u<<0)

// LUT553H Configuration

#define GFXMMU_LUT553H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT553H_LO_0             (0x1u<<0)

// LUT554L Configuration

#define GFXMMU_LUT554L_LVB              (0xFFu<<16)
#define GFXMMU_LUT554L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT554L_FVB              (0xFFu<<8)
#define GFXMMU_LUT554L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT554L_EN               (0x1u<<0)

#define GFXMMU_LUT554L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT554L_EN_B_0X1         (0x1u<<0)

// LUT554H Configuration

#define GFXMMU_LUT554H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT554H_LO_0             (0x1u<<0)

// LUT555L Configuration

#define GFXMMU_LUT555L_LVB              (0xFFu<<16)
#define GFXMMU_LUT555L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT555L_FVB              (0xFFu<<8)
#define GFXMMU_LUT555L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT555L_EN               (0x1u<<0)

