Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_gfxmmu.h
#define GFXMMU_LUT555L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT555L_EN_B_0X1         (0x1u<<0)

// LUT555H Configuration

#define GFXMMU_LUT555H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT555H_LO_0             (0x1u<<0)

// LUT556L Configuration

#define GFXMMU_LUT556L_LVB              (0xFFu<<16)
#define GFXMMU_LUT556L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT556L_FVB              (0xFFu<<8)
#define GFXMMU_LUT556L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT556L_EN               (0x1u<<0)

#define GFXMMU_LUT556L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT556L_EN_B_0X1         (0x1u<<0)

// LUT556H Configuration

#define GFXMMU_LUT556H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT556H_LO_0             (0x1u<<0)

// LUT557L Configuration

#define GFXMMU_LUT557L_LVB              (0xFFu<<16)
#define GFXMMU_LUT557L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT557L_FVB              (0xFFu<<8)
#define GFXMMU_LUT557L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT557L_EN               (0x1u<<0)

#define GFXMMU_LUT557L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT557L_EN_B_0X1         (0x1u<<0)

// LUT557H Configuration

#define GFXMMU_LUT557H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT557H_LO_0             (0x1u<<0)

// LUT558L Configuration

#define GFXMMU_LUT558L_LVB              (0xFFu<<16)
#define GFXMMU_LUT558L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT558L_FVB              (0xFFu<<8)
#define GFXMMU_LUT558L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT558L_EN               (0x1u<<0)

#define GFXMMU_LUT558L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT558L_EN_B_0X1         (0x1u<<0)

// LUT558H Configuration

#define GFXMMU_LUT558H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT558H_LO_0             (0x1u<<0)

// LUT559L Configuration

#define GFXMMU_LUT559L_LVB              (0xFFu<<16)
#define GFXMMU_LUT559L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT559L_FVB              (0xFFu<<8)
#define GFXMMU_LUT559L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT559L_EN               (0x1u<<0)

#define GFXMMU_LUT559L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT559L_EN_B_0X1         (0x1u<<0)

// LUT559H Configuration

#define GFXMMU_LUT559H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT559H_LO_0             (0x1u<<0)

// LUT560L Configuration

#define GFXMMU_LUT560L_LVB              (0xFFu<<16)
#define GFXMMU_LUT560L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT560L_FVB              (0xFFu<<8)
#define GFXMMU_LUT560L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT560L_EN               (0x1u<<0)

#define GFXMMU_LUT560L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT560L_EN_B_0X1         (0x1u<<0)

// LUT560H Configuration

#define GFXMMU_LUT560H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT560H_LO_0             (0x1u<<0)

// LUT561L Configuration

#define GFXMMU_LUT561L_LVB              (0xFFu<<16)
#define GFXMMU_LUT561L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT561L_FVB              (0xFFu<<8)
#define GFXMMU_LUT561L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT561L_EN               (0x1u<<0)

#define GFXMMU_LUT561L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT561L_EN_B_0X1         (0x1u<<0)

// LUT561H Configuration

#define GFXMMU_LUT561H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT561H_LO_0             (0x1u<<0)

// LUT562L Configuration

#define GFXMMU_LUT562L_LVB              (0xFFu<<16)
#define GFXMMU_LUT562L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT562L_FVB              (0xFFu<<8)
#define GFXMMU_LUT562L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT562L_EN               (0x1u<<0)

#define GFXMMU_LUT562L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT562L_EN_B_0X1         (0x1u<<0)

// LUT562H Configuration

#define GFXMMU_LUT562H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT562H_LO_0             (0x1u<<0)

// LUT563L Configuration

#define GFXMMU_LUT563L_LVB              (0xFFu<<16)
#define GFXMMU_LUT563L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT563L_FVB              (0xFFu<<8)
#define GFXMMU_LUT563L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT563L_EN               (0x1u<<0)

#define GFXMMU_LUT563L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT563L_EN_B_0X1         (0x1u<<0)

// LUT563H Configuration

#define GFXMMU_LUT563H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT563H_LO_0             (0x1u<<0)

// LUT564L Configuration

#define GFXMMU_LUT564L_LVB              (0xFFu<<16)
#define GFXMMU_LUT564L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT564L_FVB              (0xFFu<<8)
#define GFXMMU_LUT564L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT564L_EN               (0x1u<<0)

#define GFXMMU_LUT564L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT564L_EN_B_0X1         (0x1u<<0)

// LUT564H Configuration

#define GFXMMU_LUT564H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT564H_LO_0             (0x1u<<0)

// LUT565L Configuration

#define GFXMMU_LUT565L_LVB              (0xFFu<<16)
#define GFXMMU_LUT565L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT565L_FVB              (0xFFu<<8)
#define GFXMMU_LUT565L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT565L_EN               (0x1u<<0)

#define GFXMMU_LUT565L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT565L_EN_B_0X1         (0x1u<<0)

// LUT565H Configuration

#define GFXMMU_LUT565H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT565H_LO_0             (0x1u<<0)

// LUT566L Configuration

#define GFXMMU_LUT566L_LVB              (0xFFu<<16)
#define GFXMMU_LUT566L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT566L_FVB              (0xFFu<<8)
#define GFXMMU_LUT566L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT566L_EN               (0x1u<<0)

#define GFXMMU_LUT566L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT566L_EN_B_0X1         (0x1u<<0)

// LUT566H Configuration

#define GFXMMU_LUT566H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT566H_LO_0             (0x1u<<0)

// LUT567L Configuration

#define GFXMMU_LUT567L_LVB              (0xFFu<<16)
#define GFXMMU_LUT567L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT567L_FVB              (0xFFu<<8)
#define GFXMMU_LUT567L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT567L_EN               (0x1u<<0)

