Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_gfxmmu.h
// LUT579H Configuration

#define GFXMMU_LUT579H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT579H_LO_0             (0x1u<<0)

// LUT580L Configuration

#define GFXMMU_LUT580L_LVB              (0xFFu<<16)
#define GFXMMU_LUT580L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT580L_FVB              (0xFFu<<8)
#define GFXMMU_LUT580L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT580L_EN               (0x1u<<0)

#define GFXMMU_LUT580L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT580L_EN_B_0X1         (0x1u<<0)

// LUT580H Configuration

#define GFXMMU_LUT580H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT580H_LO_0             (0x1u<<0)

// LUT581L Configuration

#define GFXMMU_LUT581L_LVB              (0xFFu<<16)
#define GFXMMU_LUT581L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT581L_FVB              (0xFFu<<8)
#define GFXMMU_LUT581L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT581L_EN               (0x1u<<0)

#define GFXMMU_LUT581L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT581L_EN_B_0X1         (0x1u<<0)

// LUT581H Configuration

#define GFXMMU_LUT581H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT581H_LO_0             (0x1u<<0)

// LUT582L Configuration

#define GFXMMU_LUT582L_LVB              (0xFFu<<16)
#define GFXMMU_LUT582L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT582L_FVB              (0xFFu<<8)
#define GFXMMU_LUT582L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT582L_EN               (0x1u<<0)

#define GFXMMU_LUT582L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT582L_EN_B_0X1         (0x1u<<0)

// LUT582H Configuration

#define GFXMMU_LUT582H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT582H_LO_0             (0x1u<<0)

// LUT583L Configuration

#define GFXMMU_LUT583L_LVB              (0xFFu<<16)
#define GFXMMU_LUT583L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT583L_FVB              (0xFFu<<8)
#define GFXMMU_LUT583L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT583L_EN               (0x1u<<0)

#define GFXMMU_LUT583L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT583L_EN_B_0X1         (0x1u<<0)

// LUT583H Configuration

#define GFXMMU_LUT583H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT583H_LO_0             (0x1u<<0)

// LUT584L Configuration

#define GFXMMU_LUT584L_LVB              (0xFFu<<16)
#define GFXMMU_LUT584L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT584L_FVB              (0xFFu<<8)
#define GFXMMU_LUT584L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT584L_EN               (0x1u<<0)

#define GFXMMU_LUT584L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT584L_EN_B_0X1         (0x1u<<0)

// LUT584H Configuration

#define GFXMMU_LUT584H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT584H_LO_0             (0x1u<<0)

// LUT585L Configuration

#define GFXMMU_LUT585L_LVB              (0xFFu<<16)
#define GFXMMU_LUT585L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT585L_FVB              (0xFFu<<8)
#define GFXMMU_LUT585L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT585L_EN               (0x1u<<0)

#define GFXMMU_LUT585L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT585L_EN_B_0X1         (0x1u<<0)

// LUT585H Configuration

#define GFXMMU_LUT585H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT585H_LO_0             (0x1u<<0)

// LUT586L Configuration

#define GFXMMU_LUT586L_LVB              (0xFFu<<16)
#define GFXMMU_LUT586L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT586L_FVB              (0xFFu<<8)
#define GFXMMU_LUT586L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT586L_EN               (0x1u<<0)

#define GFXMMU_LUT586L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT586L_EN_B_0X1         (0x1u<<0)

// LUT586H Configuration

#define GFXMMU_LUT586H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT586H_LO_0             (0x1u<<0)

// LUT587L Configuration

#define GFXMMU_LUT587L_LVB              (0xFFu<<16)
#define GFXMMU_LUT587L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT587L_FVB              (0xFFu<<8)
#define GFXMMU_LUT587L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT587L_EN               (0x1u<<0)

#define GFXMMU_LUT587L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT587L_EN_B_0X1         (0x1u<<0)

// LUT587H Configuration

#define GFXMMU_LUT587H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT587H_LO_0             (0x1u<<0)

// LUT588L Configuration

#define GFXMMU_LUT588L_LVB              (0xFFu<<16)
#define GFXMMU_LUT588L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT588L_FVB              (0xFFu<<8)
#define GFXMMU_LUT588L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT588L_EN               (0x1u<<0)

#define GFXMMU_LUT588L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT588L_EN_B_0X1         (0x1u<<0)

// LUT588H Configuration

#define GFXMMU_LUT588H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT588H_LO_0             (0x1u<<0)

// LUT589L Configuration

#define GFXMMU_LUT589L_LVB              (0xFFu<<16)
#define GFXMMU_LUT589L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT589L_FVB              (0xFFu<<8)
#define GFXMMU_LUT589L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT589L_EN               (0x1u<<0)

#define GFXMMU_LUT589L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT589L_EN_B_0X1         (0x1u<<0)

// LUT589H Configuration

#define GFXMMU_LUT589H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT589H_LO_0             (0x1u<<0)

// LUT590L Configuration

#define GFXMMU_LUT590L_LVB              (0xFFu<<16)
#define GFXMMU_LUT590L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT590L_FVB              (0xFFu<<8)
#define GFXMMU_LUT590L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT590L_EN               (0x1u<<0)

#define GFXMMU_LUT590L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT590L_EN_B_0X1         (0x1u<<0)

// LUT590H Configuration

#define GFXMMU_LUT590H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT590H_LO_0             (0x1u<<0)

// LUT591L Configuration

#define GFXMMU_LUT591L_LVB              (0xFFu<<16)
#define GFXMMU_LUT591L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT591L_FVB              (0xFFu<<8)
#define GFXMMU_LUT591L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT591L_EN               (0x1u<<0)

