Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_gfxmmu.h
#define GFXMMU_LUT591L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT591L_EN_B_0X1         (0x1u<<0)

// LUT591H Configuration

#define GFXMMU_LUT591H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT591H_LO_0             (0x1u<<0)

// LUT592L Configuration

#define GFXMMU_LUT592L_LVB              (0xFFu<<16)
#define GFXMMU_LUT592L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT592L_FVB              (0xFFu<<8)
#define GFXMMU_LUT592L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT592L_EN               (0x1u<<0)

#define GFXMMU_LUT592L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT592L_EN_B_0X1         (0x1u<<0)

// LUT592H Configuration

#define GFXMMU_LUT592H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT592H_LO_0             (0x1u<<0)

// LUT593L Configuration

#define GFXMMU_LUT593L_LVB              (0xFFu<<16)
#define GFXMMU_LUT593L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT593L_FVB              (0xFFu<<8)
#define GFXMMU_LUT593L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT593L_EN               (0x1u<<0)

#define GFXMMU_LUT593L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT593L_EN_B_0X1         (0x1u<<0)

// LUT593H Configuration

#define GFXMMU_LUT593H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT593H_LO_0             (0x1u<<0)

// LUT594L Configuration

#define GFXMMU_LUT594L_LVB              (0xFFu<<16)
#define GFXMMU_LUT594L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT594L_FVB              (0xFFu<<8)
#define GFXMMU_LUT594L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT594L_EN               (0x1u<<0)

#define GFXMMU_LUT594L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT594L_EN_B_0X1         (0x1u<<0)

// LUT594H Configuration

#define GFXMMU_LUT594H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT594H_LO_0             (0x1u<<0)

// LUT595L Configuration

#define GFXMMU_LUT595L_LVB              (0xFFu<<16)
#define GFXMMU_LUT595L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT595L_FVB              (0xFFu<<8)
#define GFXMMU_LUT595L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT595L_EN               (0x1u<<0)

#define GFXMMU_LUT595L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT595L_EN_B_0X1         (0x1u<<0)

// LUT595H Configuration

#define GFXMMU_LUT595H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT595H_LO_0             (0x1u<<0)

// LUT596L Configuration

#define GFXMMU_LUT596L_LVB              (0xFFu<<16)
#define GFXMMU_LUT596L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT596L_FVB              (0xFFu<<8)
#define GFXMMU_LUT596L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT596L_EN               (0x1u<<0)

#define GFXMMU_LUT596L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT596L_EN_B_0X1         (0x1u<<0)

// LUT596H Configuration

#define GFXMMU_LUT596H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT596H_LO_0             (0x1u<<0)

// LUT597L Configuration

#define GFXMMU_LUT597L_LVB              (0xFFu<<16)
#define GFXMMU_LUT597L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT597L_FVB              (0xFFu<<8)
#define GFXMMU_LUT597L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT597L_EN               (0x1u<<0)

#define GFXMMU_LUT597L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT597L_EN_B_0X1         (0x1u<<0)

// LUT597H Configuration

#define GFXMMU_LUT597H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT597H_LO_0             (0x1u<<0)

// LUT598L Configuration

#define GFXMMU_LUT598L_LVB              (0xFFu<<16)
#define GFXMMU_LUT598L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT598L_FVB              (0xFFu<<8)
#define GFXMMU_LUT598L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT598L_EN               (0x1u<<0)

#define GFXMMU_LUT598L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT598L_EN_B_0X1         (0x1u<<0)

// LUT598H Configuration

#define GFXMMU_LUT598H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT598H_LO_0             (0x1u<<0)

// LUT599L Configuration

#define GFXMMU_LUT599L_LVB              (0xFFu<<16)
#define GFXMMU_LUT599L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT599L_FVB              (0xFFu<<8)
#define GFXMMU_LUT599L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT599L_EN               (0x1u<<0)

#define GFXMMU_LUT599L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT599L_EN_B_0X1         (0x1u<<0)

// LUT599H Configuration

#define GFXMMU_LUT599H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT599H_LO_0             (0x1u<<0)

// LUT600L Configuration

#define GFXMMU_LUT600L_LVB              (0xFFu<<16)
#define GFXMMU_LUT600L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT600L_FVB              (0xFFu<<8)
#define GFXMMU_LUT600L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT600L_EN               (0x1u<<0)

#define GFXMMU_LUT600L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT600L_EN_B_0X1         (0x1u<<0)

// LUT600H Configuration

#define GFXMMU_LUT600H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT600H_LO_0             (0x1u<<0)

// LUT601L Configuration

#define GFXMMU_LUT601L_LVB              (0xFFu<<16)
#define GFXMMU_LUT601L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT601L_FVB              (0xFFu<<8)
#define GFXMMU_LUT601L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT601L_EN               (0x1u<<0)

#define GFXMMU_LUT601L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT601L_EN_B_0X1         (0x1u<<0)

// LUT601H Configuration

#define GFXMMU_LUT601H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT601H_LO_0             (0x1u<<0)

// LUT602L Configuration

#define GFXMMU_LUT602L_LVB              (0xFFu<<16)
#define GFXMMU_LUT602L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT602L_FVB              (0xFFu<<8)
#define GFXMMU_LUT602L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT602L_EN               (0x1u<<0)

#define GFXMMU_LUT602L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT602L_EN_B_0X1         (0x1u<<0)

// LUT602H Configuration

#define GFXMMU_LUT602H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT602H_LO_0             (0x1u<<0)

// LUT603L Configuration

#define GFXMMU_LUT603L_LVB              (0xFFu<<16)
#define GFXMMU_LUT603L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT603L_FVB              (0xFFu<<8)
#define GFXMMU_LUT603L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT603L_EN               (0x1u<<0)

#define GFXMMU_LUT603L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT603L_EN_B_0X1         (0x1u<<0)

// LUT603H Configuration

#define GFXMMU_LUT603H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT603H_LO_0             (0x1u<<0)

// LUT604L Configuration

#define GFXMMU_LUT604L_LVB              (0xFFu<<16)
#define GFXMMU_LUT604L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT604L_FVB              (0xFFu<<8)
#define GFXMMU_LUT604L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT604L_EN               (0x1u<<0)

#define GFXMMU_LUT604L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT604L_EN_B_0X1         (0x1u<<0)

