Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_gfxmmu.h
// LUT604H Configuration

#define GFXMMU_LUT604H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT604H_LO_0             (0x1u<<0)

// LUT605L Configuration

#define GFXMMU_LUT605L_LVB              (0xFFu<<16)
#define GFXMMU_LUT605L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT605L_FVB              (0xFFu<<8)
#define GFXMMU_LUT605L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT605L_EN               (0x1u<<0)

#define GFXMMU_LUT605L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT605L_EN_B_0X1         (0x1u<<0)

// LUT605H Configuration

#define GFXMMU_LUT605H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT605H_LO_0             (0x1u<<0)

// LUT606L Configuration

#define GFXMMU_LUT606L_LVB              (0xFFu<<16)
#define GFXMMU_LUT606L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT606L_FVB              (0xFFu<<8)
#define GFXMMU_LUT606L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT606L_EN               (0x1u<<0)

#define GFXMMU_LUT606L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT606L_EN_B_0X1         (0x1u<<0)

// LUT606H Configuration

#define GFXMMU_LUT606H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT606H_LO_0             (0x1u<<0)

// LUT607L Configuration

#define GFXMMU_LUT607L_LVB              (0xFFu<<16)
#define GFXMMU_LUT607L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT607L_FVB              (0xFFu<<8)
#define GFXMMU_LUT607L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT607L_EN               (0x1u<<0)

#define GFXMMU_LUT607L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT607L_EN_B_0X1         (0x1u<<0)

// LUT607H Configuration

#define GFXMMU_LUT607H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT607H_LO_0             (0x1u<<0)

// LUT608L Configuration

#define GFXMMU_LUT608L_LVB              (0xFFu<<16)
#define GFXMMU_LUT608L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT608L_FVB              (0xFFu<<8)
#define GFXMMU_LUT608L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT608L_EN               (0x1u<<0)

#define GFXMMU_LUT608L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT608L_EN_B_0X1         (0x1u<<0)

// LUT608H Configuration

#define GFXMMU_LUT608H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT608H_LO_0             (0x1u<<0)

// LUT609L Configuration

#define GFXMMU_LUT609L_LVB              (0xFFu<<16)
#define GFXMMU_LUT609L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT609L_FVB              (0xFFu<<8)
#define GFXMMU_LUT609L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT609L_EN               (0x1u<<0)

#define GFXMMU_LUT609L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT609L_EN_B_0X1         (0x1u<<0)

// LUT609H Configuration

#define GFXMMU_LUT609H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT609H_LO_0             (0x1u<<0)

// LUT610L Configuration

#define GFXMMU_LUT610L_LVB              (0xFFu<<16)
#define GFXMMU_LUT610L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT610L_FVB              (0xFFu<<8)
#define GFXMMU_LUT610L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT610L_EN               (0x1u<<0)

#define GFXMMU_LUT610L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT610L_EN_B_0X1         (0x1u<<0)

// LUT610H Configuration

#define GFXMMU_LUT610H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT610H_LO_0             (0x1u<<0)

// LUT611L Configuration

#define GFXMMU_LUT611L_LVB              (0xFFu<<16)
#define GFXMMU_LUT611L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT611L_FVB              (0xFFu<<8)
#define GFXMMU_LUT611L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT611L_EN               (0x1u<<0)

#define GFXMMU_LUT611L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT611L_EN_B_0X1         (0x1u<<0)

// LUT611H Configuration

#define GFXMMU_LUT611H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT611H_LO_0             (0x1u<<0)

// LUT612L Configuration

#define GFXMMU_LUT612L_LVB              (0xFFu<<16)
#define GFXMMU_LUT612L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT612L_FVB              (0xFFu<<8)
#define GFXMMU_LUT612L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT612L_EN               (0x1u<<0)

#define GFXMMU_LUT612L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT612L_EN_B_0X1         (0x1u<<0)

// LUT612H Configuration

#define GFXMMU_LUT612H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT612H_LO_0             (0x1u<<0)

// LUT613L Configuration

#define GFXMMU_LUT613L_LVB              (0xFFu<<16)
#define GFXMMU_LUT613L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT613L_FVB              (0xFFu<<8)
#define GFXMMU_LUT613L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT613L_EN               (0x1u<<0)

#define GFXMMU_LUT613L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT613L_EN_B_0X1         (0x1u<<0)

// LUT613H Configuration

#define GFXMMU_LUT613H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT613H_LO_0             (0x1u<<0)

// LUT614L Configuration

#define GFXMMU_LUT614L_LVB              (0xFFu<<16)
#define GFXMMU_LUT614L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT614L_FVB              (0xFFu<<8)
#define GFXMMU_LUT614L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT614L_EN               (0x1u<<0)

#define GFXMMU_LUT614L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT614L_EN_B_0X1         (0x1u<<0)

// LUT614H Configuration

#define GFXMMU_LUT614H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT614H_LO_0             (0x1u<<0)

// LUT615L Configuration

#define GFXMMU_LUT615L_LVB              (0xFFu<<16)
#define GFXMMU_LUT615L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT615L_FVB              (0xFFu<<8)
#define GFXMMU_LUT615L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT615L_EN               (0x1u<<0)

#define GFXMMU_LUT615L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT615L_EN_B_0X1         (0x1u<<0)

// LUT615H Configuration

#define GFXMMU_LUT615H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT615H_LO_0             (0x1u<<0)

// LUT616L Configuration

#define GFXMMU_LUT616L_LVB              (0xFFu<<16)
#define GFXMMU_LUT616L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT616L_FVB              (0xFFu<<8)
#define GFXMMU_LUT616L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT616L_EN               (0x1u<<0)

#define GFXMMU_LUT616L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT616L_EN_B_0X1         (0x1u<<0)

