Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_gfxmmu.h
#define GFXMMU_LUT628L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT628L_EN_B_0X1         (0x1u<<0)

// LUT628H Configuration

#define GFXMMU_LUT628H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT628H_LO_0             (0x1u<<0)

// LUT629L Configuration

#define GFXMMU_LUT629L_LVB              (0xFFu<<16)
#define GFXMMU_LUT629L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT629L_FVB              (0xFFu<<8)
#define GFXMMU_LUT629L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT629L_EN               (0x1u<<0)

#define GFXMMU_LUT629L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT629L_EN_B_0X1         (0x1u<<0)

// LUT629H Configuration

#define GFXMMU_LUT629H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT629H_LO_0             (0x1u<<0)

// LUT630L Configuration

#define GFXMMU_LUT630L_LVB              (0xFFu<<16)
#define GFXMMU_LUT630L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT630L_FVB              (0xFFu<<8)
#define GFXMMU_LUT630L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT630L_EN               (0x1u<<0)

#define GFXMMU_LUT630L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT630L_EN_B_0X1         (0x1u<<0)

// LUT630H Configuration

#define GFXMMU_LUT630H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT630H_LO_0             (0x1u<<0)

// LUT631L Configuration

#define GFXMMU_LUT631L_LVB              (0xFFu<<16)
#define GFXMMU_LUT631L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT631L_FVB              (0xFFu<<8)
#define GFXMMU_LUT631L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT631L_EN               (0x1u<<0)

#define GFXMMU_LUT631L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT631L_EN_B_0X1         (0x1u<<0)

// LUT631H Configuration

#define GFXMMU_LUT631H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT631H_LO_0             (0x1u<<0)

// LUT632L Configuration

#define GFXMMU_LUT632L_LVB              (0xFFu<<16)
#define GFXMMU_LUT632L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT632L_FVB              (0xFFu<<8)
#define GFXMMU_LUT632L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT632L_EN               (0x1u<<0)

#define GFXMMU_LUT632L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT632L_EN_B_0X1         (0x1u<<0)

// LUT632H Configuration

#define GFXMMU_LUT632H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT632H_LO_0             (0x1u<<0)

// LUT633L Configuration

#define GFXMMU_LUT633L_LVB              (0xFFu<<16)
#define GFXMMU_LUT633L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT633L_FVB              (0xFFu<<8)
#define GFXMMU_LUT633L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT633L_EN               (0x1u<<0)

#define GFXMMU_LUT633L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT633L_EN_B_0X1         (0x1u<<0)

// LUT633H Configuration

#define GFXMMU_LUT633H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT633H_LO_0             (0x1u<<0)

// LUT634L Configuration

#define GFXMMU_LUT634L_LVB              (0xFFu<<16)
#define GFXMMU_LUT634L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT634L_FVB              (0xFFu<<8)
#define GFXMMU_LUT634L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT634L_EN               (0x1u<<0)

#define GFXMMU_LUT634L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT634L_EN_B_0X1         (0x1u<<0)

// LUT634H Configuration

#define GFXMMU_LUT634H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT634H_LO_0             (0x1u<<0)

// LUT635L Configuration

#define GFXMMU_LUT635L_LVB              (0xFFu<<16)
#define GFXMMU_LUT635L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT635L_FVB              (0xFFu<<8)
#define GFXMMU_LUT635L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT635L_EN               (0x1u<<0)

#define GFXMMU_LUT635L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT635L_EN_B_0X1         (0x1u<<0)

// LUT635H Configuration

#define GFXMMU_LUT635H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT635H_LO_0             (0x1u<<0)

// LUT636L Configuration

#define GFXMMU_LUT636L_LVB              (0xFFu<<16)
#define GFXMMU_LUT636L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT636L_FVB              (0xFFu<<8)
#define GFXMMU_LUT636L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT636L_EN               (0x1u<<0)

#define GFXMMU_LUT636L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT636L_EN_B_0X1         (0x1u<<0)

// LUT636H Configuration

#define GFXMMU_LUT636H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT636H_LO_0             (0x1u<<0)

// LUT637L Configuration

#define GFXMMU_LUT637L_LVB              (0xFFu<<16)
#define GFXMMU_LUT637L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT637L_FVB              (0xFFu<<8)
#define GFXMMU_LUT637L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT637L_EN               (0x1u<<0)

#define GFXMMU_LUT637L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT637L_EN_B_0X1         (0x1u<<0)

// LUT637H Configuration

#define GFXMMU_LUT637H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT637H_LO_0             (0x1u<<0)

// LUT638L Configuration

#define GFXMMU_LUT638L_LVB              (0xFFu<<16)
#define GFXMMU_LUT638L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT638L_FVB              (0xFFu<<8)
#define GFXMMU_LUT638L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT638L_EN               (0x1u<<0)

#define GFXMMU_LUT638L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT638L_EN_B_0X1         (0x1u<<0)

// LUT638H Configuration

#define GFXMMU_LUT638H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT638H_LO_0             (0x1u<<0)

// LUT639L Configuration

#define GFXMMU_LUT639L_LVB              (0xFFu<<16)
#define GFXMMU_LUT639L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT639L_FVB              (0xFFu<<8)
#define GFXMMU_LUT639L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT639L_EN               (0x1u<<0)

#define GFXMMU_LUT639L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT639L_EN_B_0X1         (0x1u<<0)

// LUT639H Configuration

#define GFXMMU_LUT639H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT639H_LO_0             (0x1u<<0)

// LUT640L Configuration

#define GFXMMU_LUT640L_LVB              (0xFFu<<16)
#define GFXMMU_LUT640L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT640L_FVB              (0xFFu<<8)
#define GFXMMU_LUT640L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT640L_EN               (0x1u<<0)

#define GFXMMU_LUT640L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT640L_EN_B_0X1         (0x1u<<0)

