Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_gfxmmu.h
// LUT664H Configuration

#define GFXMMU_LUT664H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT664H_LO_0             (0x1u<<0)

// LUT665L Configuration

#define GFXMMU_LUT665L_LVB              (0xFFu<<16)
#define GFXMMU_LUT665L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT665L_FVB              (0xFFu<<8)
#define GFXMMU_LUT665L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT665L_EN               (0x1u<<0)

#define GFXMMU_LUT665L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT665L_EN_B_0X1         (0x1u<<0)

// LUT665H Configuration

#define GFXMMU_LUT665H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT665H_LO_0             (0x1u<<0)

// LUT666L Configuration

#define GFXMMU_LUT666L_LVB              (0xFFu<<16)
#define GFXMMU_LUT666L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT666L_FVB              (0xFFu<<8)
#define GFXMMU_LUT666L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT666L_EN               (0x1u<<0)

#define GFXMMU_LUT666L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT666L_EN_B_0X1         (0x1u<<0)

// LUT666H Configuration

#define GFXMMU_LUT666H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT666H_LO_0             (0x1u<<0)

// LUT667L Configuration

#define GFXMMU_LUT667L_LVB              (0xFFu<<16)
#define GFXMMU_LUT667L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT667L_FVB              (0xFFu<<8)
#define GFXMMU_LUT667L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT667L_EN               (0x1u<<0)

#define GFXMMU_LUT667L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT667L_EN_B_0X1         (0x1u<<0)

// LUT667H Configuration

#define GFXMMU_LUT667H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT667H_LO_0             (0x1u<<0)

// LUT668L Configuration

#define GFXMMU_LUT668L_LVB              (0xFFu<<16)
#define GFXMMU_LUT668L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT668L_FVB              (0xFFu<<8)
#define GFXMMU_LUT668L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT668L_EN               (0x1u<<0)

#define GFXMMU_LUT668L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT668L_EN_B_0X1         (0x1u<<0)

// LUT668H Configuration

#define GFXMMU_LUT668H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT668H_LO_0             (0x1u<<0)

// LUT669L Configuration

#define GFXMMU_LUT669L_LVB              (0xFFu<<16)
#define GFXMMU_LUT669L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT669L_FVB              (0xFFu<<8)
#define GFXMMU_LUT669L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT669L_EN               (0x1u<<0)

#define GFXMMU_LUT669L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT669L_EN_B_0X1         (0x1u<<0)

// LUT669H Configuration

#define GFXMMU_LUT669H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT669H_LO_0             (0x1u<<0)

// LUT670L Configuration

#define GFXMMU_LUT670L_LVB              (0xFFu<<16)
#define GFXMMU_LUT670L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT670L_FVB              (0xFFu<<8)
#define GFXMMU_LUT670L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT670L_EN               (0x1u<<0)

#define GFXMMU_LUT670L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT670L_EN_B_0X1         (0x1u<<0)

// LUT670H Configuration

#define GFXMMU_LUT670H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT670H_LO_0             (0x1u<<0)

// LUT671L Configuration

#define GFXMMU_LUT671L_LVB              (0xFFu<<16)
#define GFXMMU_LUT671L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT671L_FVB              (0xFFu<<8)
#define GFXMMU_LUT671L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT671L_EN               (0x1u<<0)

#define GFXMMU_LUT671L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT671L_EN_B_0X1         (0x1u<<0)

// LUT671H Configuration

#define GFXMMU_LUT671H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT671H_LO_0             (0x1u<<0)

// LUT672L Configuration

#define GFXMMU_LUT672L_LVB              (0xFFu<<16)
#define GFXMMU_LUT672L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT672L_FVB              (0xFFu<<8)
#define GFXMMU_LUT672L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT672L_EN               (0x1u<<0)

#define GFXMMU_LUT672L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT672L_EN_B_0X1         (0x1u<<0)

// LUT672H Configuration

#define GFXMMU_LUT672H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT672H_LO_0             (0x1u<<0)

// LUT673L Configuration

#define GFXMMU_LUT673L_LVB              (0xFFu<<16)
#define GFXMMU_LUT673L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT673L_FVB              (0xFFu<<8)
#define GFXMMU_LUT673L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT673L_EN               (0x1u<<0)

#define GFXMMU_LUT673L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT673L_EN_B_0X1         (0x1u<<0)

// LUT673H Configuration

#define GFXMMU_LUT673H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT673H_LO_0             (0x1u<<0)

// LUT674L Configuration

#define GFXMMU_LUT674L_LVB              (0xFFu<<16)
#define GFXMMU_LUT674L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT674L_FVB              (0xFFu<<8)
#define GFXMMU_LUT674L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT674L_EN               (0x1u<<0)

#define GFXMMU_LUT674L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT674L_EN_B_0X1         (0x1u<<0)

// LUT674H Configuration

#define GFXMMU_LUT674H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT674H_LO_0             (0x1u<<0)

// LUT675L Configuration

#define GFXMMU_LUT675L_LVB              (0xFFu<<16)
#define GFXMMU_LUT675L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT675L_FVB              (0xFFu<<8)
#define GFXMMU_LUT675L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT675L_EN               (0x1u<<0)

#define GFXMMU_LUT675L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT675L_EN_B_0X1         (0x1u<<0)

// LUT675H Configuration

#define GFXMMU_LUT675H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT675H_LO_0             (0x1u<<0)

// LUT676L Configuration

#define GFXMMU_LUT676L_LVB              (0xFFu<<16)
#define GFXMMU_LUT676L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT676L_FVB              (0xFFu<<8)
#define GFXMMU_LUT676L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT676L_EN               (0x1u<<0)

#define GFXMMU_LUT676L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT676L_EN_B_0X1         (0x1u<<0)

