Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_gfxmmu.h
// LUT676H Configuration

#define GFXMMU_LUT676H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT676H_LO_0             (0x1u<<0)

// LUT677L Configuration

#define GFXMMU_LUT677L_LVB              (0xFFu<<16)
#define GFXMMU_LUT677L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT677L_FVB              (0xFFu<<8)
#define GFXMMU_LUT677L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT677L_EN               (0x1u<<0)

#define GFXMMU_LUT677L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT677L_EN_B_0X1         (0x1u<<0)

// LUT677H Configuration

#define GFXMMU_LUT677H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT677H_LO_0             (0x1u<<0)

// LUT678L Configuration

#define GFXMMU_LUT678L_LVB              (0xFFu<<16)
#define GFXMMU_LUT678L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT678L_FVB              (0xFFu<<8)
#define GFXMMU_LUT678L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT678L_EN               (0x1u<<0)

#define GFXMMU_LUT678L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT678L_EN_B_0X1         (0x1u<<0)

// LUT678H Configuration

#define GFXMMU_LUT678H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT678H_LO_0             (0x1u<<0)

// LUT679L Configuration

#define GFXMMU_LUT679L_LVB              (0xFFu<<16)
#define GFXMMU_LUT679L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT679L_FVB              (0xFFu<<8)
#define GFXMMU_LUT679L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT679L_EN               (0x1u<<0)

#define GFXMMU_LUT679L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT679L_EN_B_0X1         (0x1u<<0)

// LUT679H Configuration

#define GFXMMU_LUT679H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT679H_LO_0             (0x1u<<0)

// LUT680L Configuration

#define GFXMMU_LUT680L_LVB              (0xFFu<<16)
#define GFXMMU_LUT680L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT680L_FVB              (0xFFu<<8)
#define GFXMMU_LUT680L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT680L_EN               (0x1u<<0)

#define GFXMMU_LUT680L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT680L_EN_B_0X1         (0x1u<<0)

// LUT680H Configuration

#define GFXMMU_LUT680H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT680H_LO_0             (0x1u<<0)

// LUT681L Configuration

#define GFXMMU_LUT681L_LVB              (0xFFu<<16)
#define GFXMMU_LUT681L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT681L_FVB              (0xFFu<<8)
#define GFXMMU_LUT681L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT681L_EN               (0x1u<<0)

#define GFXMMU_LUT681L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT681L_EN_B_0X1         (0x1u<<0)

// LUT681H Configuration

#define GFXMMU_LUT681H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT681H_LO_0             (0x1u<<0)

// LUT682L Configuration

#define GFXMMU_LUT682L_LVB              (0xFFu<<16)
#define GFXMMU_LUT682L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT682L_FVB              (0xFFu<<8)
#define GFXMMU_LUT682L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT682L_EN               (0x1u<<0)

#define GFXMMU_LUT682L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT682L_EN_B_0X1         (0x1u<<0)

// LUT682H Configuration

#define GFXMMU_LUT682H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT682H_LO_0             (0x1u<<0)

// LUT683L Configuration

#define GFXMMU_LUT683L_LVB              (0xFFu<<16)
#define GFXMMU_LUT683L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT683L_FVB              (0xFFu<<8)
#define GFXMMU_LUT683L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT683L_EN               (0x1u<<0)

#define GFXMMU_LUT683L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT683L_EN_B_0X1         (0x1u<<0)

// LUT683H Configuration

#define GFXMMU_LUT683H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT683H_LO_0             (0x1u<<0)

// LUT684L Configuration

#define GFXMMU_LUT684L_LVB              (0xFFu<<16)
#define GFXMMU_LUT684L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT684L_FVB              (0xFFu<<8)
#define GFXMMU_LUT684L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT684L_EN               (0x1u<<0)

#define GFXMMU_LUT684L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT684L_EN_B_0X1         (0x1u<<0)

// LUT684H Configuration

#define GFXMMU_LUT684H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT684H_LO_0             (0x1u<<0)

// LUT685L Configuration

#define GFXMMU_LUT685L_LVB              (0xFFu<<16)
#define GFXMMU_LUT685L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT685L_FVB              (0xFFu<<8)
#define GFXMMU_LUT685L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT685L_EN               (0x1u<<0)

#define GFXMMU_LUT685L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT685L_EN_B_0X1         (0x1u<<0)

// LUT685H Configuration

#define GFXMMU_LUT685H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT685H_LO_0             (0x1u<<0)

// LUT686L Configuration

#define GFXMMU_LUT686L_LVB              (0xFFu<<16)
#define GFXMMU_LUT686L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT686L_FVB              (0xFFu<<8)
#define GFXMMU_LUT686L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT686L_EN               (0x1u<<0)

#define GFXMMU_LUT686L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT686L_EN_B_0X1         (0x1u<<0)

// LUT686H Configuration

#define GFXMMU_LUT686H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT686H_LO_0             (0x1u<<0)

// LUT687L Configuration

#define GFXMMU_LUT687L_LVB              (0xFFu<<16)
#define GFXMMU_LUT687L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT687L_FVB              (0xFFu<<8)
#define GFXMMU_LUT687L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT687L_EN               (0x1u<<0)

#define GFXMMU_LUT687L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT687L_EN_B_0X1         (0x1u<<0)

// LUT687H Configuration

#define GFXMMU_LUT687H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT687H_LO_0             (0x1u<<0)

// LUT688L Configuration

#define GFXMMU_LUT688L_LVB              (0xFFu<<16)
#define GFXMMU_LUT688L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT688L_FVB              (0xFFu<<8)
#define GFXMMU_LUT688L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT688L_EN               (0x1u<<0)

#define GFXMMU_LUT688L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT688L_EN_B_0X1         (0x1u<<0)

// LUT688H Configuration

#define GFXMMU_LUT688H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT688H_LO_0             (0x1u<<0)

