Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_gfxmmu.h
// LUT689L Configuration

#define GFXMMU_LUT689L_LVB              (0xFFu<<16)
#define GFXMMU_LUT689L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT689L_FVB              (0xFFu<<8)
#define GFXMMU_LUT689L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT689L_EN               (0x1u<<0)

#define GFXMMU_LUT689L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT689L_EN_B_0X1         (0x1u<<0)

// LUT689H Configuration

#define GFXMMU_LUT689H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT689H_LO_0             (0x1u<<0)

// LUT690L Configuration

#define GFXMMU_LUT690L_LVB              (0xFFu<<16)
#define GFXMMU_LUT690L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT690L_FVB              (0xFFu<<8)
#define GFXMMU_LUT690L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT690L_EN               (0x1u<<0)

#define GFXMMU_LUT690L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT690L_EN_B_0X1         (0x1u<<0)

// LUT690H Configuration

#define GFXMMU_LUT690H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT690H_LO_0             (0x1u<<0)

// LUT691L Configuration

#define GFXMMU_LUT691L_LVB              (0xFFu<<16)
#define GFXMMU_LUT691L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT691L_FVB              (0xFFu<<8)
#define GFXMMU_LUT691L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT691L_EN               (0x1u<<0)

#define GFXMMU_LUT691L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT691L_EN_B_0X1         (0x1u<<0)

// LUT691H Configuration

#define GFXMMU_LUT691H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT691H_LO_0             (0x1u<<0)

// LUT692L Configuration

#define GFXMMU_LUT692L_LVB              (0xFFu<<16)
#define GFXMMU_LUT692L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT692L_FVB              (0xFFu<<8)
#define GFXMMU_LUT692L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT692L_EN               (0x1u<<0)

#define GFXMMU_LUT692L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT692L_EN_B_0X1         (0x1u<<0)

// LUT692H Configuration

#define GFXMMU_LUT692H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT692H_LO_0             (0x1u<<0)

// LUT693L Configuration

#define GFXMMU_LUT693L_LVB              (0xFFu<<16)
#define GFXMMU_LUT693L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT693L_FVB              (0xFFu<<8)
#define GFXMMU_LUT693L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT693L_EN               (0x1u<<0)

#define GFXMMU_LUT693L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT693L_EN_B_0X1         (0x1u<<0)

// LUT693H Configuration

#define GFXMMU_LUT693H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT693H_LO_0             (0x1u<<0)

// LUT694L Configuration

#define GFXMMU_LUT694L_LVB              (0xFFu<<16)
#define GFXMMU_LUT694L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT694L_FVB              (0xFFu<<8)
#define GFXMMU_LUT694L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT694L_EN               (0x1u<<0)

#define GFXMMU_LUT694L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT694L_EN_B_0X1         (0x1u<<0)

// LUT694H Configuration

#define GFXMMU_LUT694H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT694H_LO_0             (0x1u<<0)

// LUT695L Configuration

#define GFXMMU_LUT695L_LVB              (0xFFu<<16)
#define GFXMMU_LUT695L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT695L_FVB              (0xFFu<<8)
#define GFXMMU_LUT695L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT695L_EN               (0x1u<<0)

#define GFXMMU_LUT695L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT695L_EN_B_0X1         (0x1u<<0)

// LUT695H Configuration

#define GFXMMU_LUT695H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT695H_LO_0             (0x1u<<0)

// LUT696L Configuration

#define GFXMMU_LUT696L_LVB              (0xFFu<<16)
#define GFXMMU_LUT696L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT696L_FVB              (0xFFu<<8)
#define GFXMMU_LUT696L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT696L_EN               (0x1u<<0)

#define GFXMMU_LUT696L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT696L_EN_B_0X1         (0x1u<<0)

// LUT696H Configuration

#define GFXMMU_LUT696H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT696H_LO_0             (0x1u<<0)

// LUT697L Configuration

#define GFXMMU_LUT697L_LVB              (0xFFu<<16)
#define GFXMMU_LUT697L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT697L_FVB              (0xFFu<<8)
#define GFXMMU_LUT697L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT697L_EN               (0x1u<<0)

#define GFXMMU_LUT697L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT697L_EN_B_0X1         (0x1u<<0)

// LUT697H Configuration

#define GFXMMU_LUT697H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT697H_LO_0             (0x1u<<0)

// LUT698L Configuration

#define GFXMMU_LUT698L_LVB              (0xFFu<<16)
#define GFXMMU_LUT698L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT698L_FVB              (0xFFu<<8)
#define GFXMMU_LUT698L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT698L_EN               (0x1u<<0)

#define GFXMMU_LUT698L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT698L_EN_B_0X1         (0x1u<<0)

// LUT698H Configuration

#define GFXMMU_LUT698H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT698H_LO_0             (0x1u<<0)

// LUT699L Configuration

#define GFXMMU_LUT699L_LVB              (0xFFu<<16)
#define GFXMMU_LUT699L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT699L_FVB              (0xFFu<<8)
#define GFXMMU_LUT699L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT699L_EN               (0x1u<<0)

#define GFXMMU_LUT699L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT699L_EN_B_0X1         (0x1u<<0)

// LUT699H Configuration

#define GFXMMU_LUT699H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT699H_LO_0             (0x1u<<0)

// LUT700L Configuration

#define GFXMMU_LUT700L_LVB              (0xFFu<<16)
#define GFXMMU_LUT700L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT700L_FVB              (0xFFu<<8)
#define GFXMMU_LUT700L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT700L_EN               (0x1u<<0)

#define GFXMMU_LUT700L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT700L_EN_B_0X1         (0x1u<<0)

// LUT700H Configuration

#define GFXMMU_LUT700H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT700H_LO_0             (0x1u<<0)

