Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_gfxmmu.h
// LUT701L Configuration

#define GFXMMU_LUT701L_LVB              (0xFFu<<16)
#define GFXMMU_LUT701L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT701L_FVB              (0xFFu<<8)
#define GFXMMU_LUT701L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT701L_EN               (0x1u<<0)

#define GFXMMU_LUT701L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT701L_EN_B_0X1         (0x1u<<0)

// LUT701H Configuration

#define GFXMMU_LUT701H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT701H_LO_0             (0x1u<<0)

// LUT702L Configuration

#define GFXMMU_LUT702L_LVB              (0xFFu<<16)
#define GFXMMU_LUT702L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT702L_FVB              (0xFFu<<8)
#define GFXMMU_LUT702L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT702L_EN               (0x1u<<0)

#define GFXMMU_LUT702L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT702L_EN_B_0X1         (0x1u<<0)

// LUT702H Configuration

#define GFXMMU_LUT702H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT702H_LO_0             (0x1u<<0)

// LUT703L Configuration

#define GFXMMU_LUT703L_LVB              (0xFFu<<16)
#define GFXMMU_LUT703L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT703L_FVB              (0xFFu<<8)
#define GFXMMU_LUT703L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT703L_EN               (0x1u<<0)

#define GFXMMU_LUT703L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT703L_EN_B_0X1         (0x1u<<0)

// LUT703H Configuration

#define GFXMMU_LUT703H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT703H_LO_0             (0x1u<<0)

// LUT704L Configuration

#define GFXMMU_LUT704L_LVB              (0xFFu<<16)
#define GFXMMU_LUT704L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT704L_FVB              (0xFFu<<8)
#define GFXMMU_LUT704L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT704L_EN               (0x1u<<0)

#define GFXMMU_LUT704L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT704L_EN_B_0X1         (0x1u<<0)

// LUT704H Configuration

#define GFXMMU_LUT704H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT704H_LO_0             (0x1u<<0)

// LUT705L Configuration

#define GFXMMU_LUT705L_LVB              (0xFFu<<16)
#define GFXMMU_LUT705L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT705L_FVB              (0xFFu<<8)
#define GFXMMU_LUT705L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT705L_EN               (0x1u<<0)

#define GFXMMU_LUT705L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT705L_EN_B_0X1         (0x1u<<0)

// LUT705H Configuration

#define GFXMMU_LUT705H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT705H_LO_0             (0x1u<<0)

// LUT706L Configuration

#define GFXMMU_LUT706L_LVB              (0xFFu<<16)
#define GFXMMU_LUT706L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT706L_FVB              (0xFFu<<8)
#define GFXMMU_LUT706L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT706L_EN               (0x1u<<0)

#define GFXMMU_LUT706L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT706L_EN_B_0X1         (0x1u<<0)

// LUT706H Configuration

#define GFXMMU_LUT706H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT706H_LO_0             (0x1u<<0)

// LUT707L Configuration

#define GFXMMU_LUT707L_LVB              (0xFFu<<16)
#define GFXMMU_LUT707L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT707L_FVB              (0xFFu<<8)
#define GFXMMU_LUT707L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT707L_EN               (0x1u<<0)

#define GFXMMU_LUT707L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT707L_EN_B_0X1         (0x1u<<0)

// LUT707H Configuration

#define GFXMMU_LUT707H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT707H_LO_0             (0x1u<<0)

// LUT708L Configuration

#define GFXMMU_LUT708L_LVB              (0xFFu<<16)
#define GFXMMU_LUT708L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT708L_FVB              (0xFFu<<8)
#define GFXMMU_LUT708L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT708L_EN               (0x1u<<0)

#define GFXMMU_LUT708L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT708L_EN_B_0X1         (0x1u<<0)

// LUT708H Configuration

#define GFXMMU_LUT708H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT708H_LO_0             (0x1u<<0)

// LUT709L Configuration

#define GFXMMU_LUT709L_LVB              (0xFFu<<16)
#define GFXMMU_LUT709L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT709L_FVB              (0xFFu<<8)
#define GFXMMU_LUT709L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT709L_EN               (0x1u<<0)

#define GFXMMU_LUT709L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT709L_EN_B_0X1         (0x1u<<0)

// LUT709H Configuration

#define GFXMMU_LUT709H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT709H_LO_0             (0x1u<<0)

// LUT710L Configuration

#define GFXMMU_LUT710L_LVB              (0xFFu<<16)
#define GFXMMU_LUT710L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT710L_FVB              (0xFFu<<8)
#define GFXMMU_LUT710L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT710L_EN               (0x1u<<0)

#define GFXMMU_LUT710L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT710L_EN_B_0X1         (0x1u<<0)

// LUT710H Configuration

#define GFXMMU_LUT710H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT710H_LO_0             (0x1u<<0)

// LUT711L Configuration

#define GFXMMU_LUT711L_LVB              (0xFFu<<16)
#define GFXMMU_LUT711L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT711L_FVB              (0xFFu<<8)
#define GFXMMU_LUT711L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT711L_EN               (0x1u<<0)

#define GFXMMU_LUT711L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT711L_EN_B_0X1         (0x1u<<0)

// LUT711H Configuration

#define GFXMMU_LUT711H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT711H_LO_0             (0x1u<<0)

// LUT712L Configuration

#define GFXMMU_LUT712L_LVB              (0xFFu<<16)
#define GFXMMU_LUT712L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT712L_FVB              (0xFFu<<8)
#define GFXMMU_LUT712L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT712L_EN               (0x1u<<0)

#define GFXMMU_LUT712L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT712L_EN_B_0X1         (0x1u<<0)

// LUT712H Configuration

#define GFXMMU_LUT712H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT712H_LO_0             (0x1u<<0)

