Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_gfxmmu.h
// LUT737L Configuration

#define GFXMMU_LUT737L_LVB              (0xFFu<<16)
#define GFXMMU_LUT737L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT737L_FVB              (0xFFu<<8)
#define GFXMMU_LUT737L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT737L_EN               (0x1u<<0)

#define GFXMMU_LUT737L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT737L_EN_B_0X1         (0x1u<<0)

// LUT737H Configuration

#define GFXMMU_LUT737H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT737H_LO_0             (0x1u<<0)

// LUT738L Configuration

#define GFXMMU_LUT738L_LVB              (0xFFu<<16)
#define GFXMMU_LUT738L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT738L_FVB              (0xFFu<<8)
#define GFXMMU_LUT738L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT738L_EN               (0x1u<<0)

#define GFXMMU_LUT738L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT738L_EN_B_0X1         (0x1u<<0)

// LUT738H Configuration

#define GFXMMU_LUT738H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT738H_LO_0             (0x1u<<0)

// LUT739L Configuration

#define GFXMMU_LUT739L_LVB              (0xFFu<<16)
#define GFXMMU_LUT739L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT739L_FVB              (0xFFu<<8)
#define GFXMMU_LUT739L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT739L_EN               (0x1u<<0)

#define GFXMMU_LUT739L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT739L_EN_B_0X1         (0x1u<<0)

// LUT739H Configuration

#define GFXMMU_LUT739H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT739H_LO_0             (0x1u<<0)

// LUT740L Configuration

#define GFXMMU_LUT740L_LVB              (0xFFu<<16)
#define GFXMMU_LUT740L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT740L_FVB              (0xFFu<<8)
#define GFXMMU_LUT740L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT740L_EN               (0x1u<<0)

#define GFXMMU_LUT740L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT740L_EN_B_0X1         (0x1u<<0)

// LUT740H Configuration

#define GFXMMU_LUT740H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT740H_LO_0             (0x1u<<0)

// LUT741L Configuration

#define GFXMMU_LUT741L_LVB              (0xFFu<<16)
#define GFXMMU_LUT741L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT741L_FVB              (0xFFu<<8)
#define GFXMMU_LUT741L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT741L_EN               (0x1u<<0)

#define GFXMMU_LUT741L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT741L_EN_B_0X1         (0x1u<<0)

// LUT741H Configuration

#define GFXMMU_LUT741H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT741H_LO_0             (0x1u<<0)

// LUT742L Configuration

#define GFXMMU_LUT742L_LVB              (0xFFu<<16)
#define GFXMMU_LUT742L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT742L_FVB              (0xFFu<<8)
#define GFXMMU_LUT742L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT742L_EN               (0x1u<<0)

#define GFXMMU_LUT742L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT742L_EN_B_0X1         (0x1u<<0)

// LUT742H Configuration

#define GFXMMU_LUT742H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT742H_LO_0             (0x1u<<0)

// LUT743L Configuration

#define GFXMMU_LUT743L_LVB              (0xFFu<<16)
#define GFXMMU_LUT743L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT743L_FVB              (0xFFu<<8)
#define GFXMMU_LUT743L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT743L_EN               (0x1u<<0)

#define GFXMMU_LUT743L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT743L_EN_B_0X1         (0x1u<<0)

// LUT743H Configuration

#define GFXMMU_LUT743H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT743H_LO_0             (0x1u<<0)

// LUT744L Configuration

#define GFXMMU_LUT744L_LVB              (0xFFu<<16)
#define GFXMMU_LUT744L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT744L_FVB              (0xFFu<<8)
#define GFXMMU_LUT744L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT744L_EN               (0x1u<<0)

#define GFXMMU_LUT744L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT744L_EN_B_0X1         (0x1u<<0)

// LUT744H Configuration

#define GFXMMU_LUT744H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT744H_LO_0             (0x1u<<0)

// LUT745L Configuration

#define GFXMMU_LUT745L_LVB              (0xFFu<<16)
#define GFXMMU_LUT745L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT745L_FVB              (0xFFu<<8)
#define GFXMMU_LUT745L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT745L_EN               (0x1u<<0)

#define GFXMMU_LUT745L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT745L_EN_B_0X1         (0x1u<<0)

// LUT745H Configuration

#define GFXMMU_LUT745H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT745H_LO_0             (0x1u<<0)

// LUT746L Configuration

#define GFXMMU_LUT746L_LVB              (0xFFu<<16)
#define GFXMMU_LUT746L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT746L_FVB              (0xFFu<<8)
#define GFXMMU_LUT746L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT746L_EN               (0x1u<<0)

#define GFXMMU_LUT746L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT746L_EN_B_0X1         (0x1u<<0)

// LUT746H Configuration

#define GFXMMU_LUT746H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT746H_LO_0             (0x1u<<0)

// LUT747L Configuration

#define GFXMMU_LUT747L_LVB              (0xFFu<<16)
#define GFXMMU_LUT747L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT747L_FVB              (0xFFu<<8)
#define GFXMMU_LUT747L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT747L_EN               (0x1u<<0)

#define GFXMMU_LUT747L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT747L_EN_B_0X1         (0x1u<<0)

// LUT747H Configuration

#define GFXMMU_LUT747H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT747H_LO_0             (0x1u<<0)

// LUT748L Configuration

#define GFXMMU_LUT748L_LVB              (0xFFu<<16)
#define GFXMMU_LUT748L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT748L_FVB              (0xFFu<<8)
#define GFXMMU_LUT748L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT748L_EN               (0x1u<<0)

#define GFXMMU_LUT748L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT748L_EN_B_0X1         (0x1u<<0)

// LUT748H Configuration

#define GFXMMU_LUT748H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT748H_LO_0             (0x1u<<0)

