Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_gfxmmu.h
// LUT761L Configuration

#define GFXMMU_LUT761L_LVB              (0xFFu<<16)
#define GFXMMU_LUT761L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT761L_FVB              (0xFFu<<8)
#define GFXMMU_LUT761L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT761L_EN               (0x1u<<0)

#define GFXMMU_LUT761L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT761L_EN_B_0X1         (0x1u<<0)

// LUT761H Configuration

#define GFXMMU_LUT761H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT761H_LO_0             (0x1u<<0)

// LUT762L Configuration

#define GFXMMU_LUT762L_LVB              (0xFFu<<16)
#define GFXMMU_LUT762L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT762L_FVB              (0xFFu<<8)
#define GFXMMU_LUT762L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT762L_EN               (0x1u<<0)

#define GFXMMU_LUT762L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT762L_EN_B_0X1         (0x1u<<0)

// LUT762H Configuration

#define GFXMMU_LUT762H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT762H_LO_0             (0x1u<<0)

// LUT763L Configuration

#define GFXMMU_LUT763L_LVB              (0xFFu<<16)
#define GFXMMU_LUT763L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT763L_FVB              (0xFFu<<8)
#define GFXMMU_LUT763L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT763L_EN               (0x1u<<0)

#define GFXMMU_LUT763L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT763L_EN_B_0X1         (0x1u<<0)

// LUT763H Configuration

#define GFXMMU_LUT763H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT763H_LO_0             (0x1u<<0)

// LUT764L Configuration

#define GFXMMU_LUT764L_LVB              (0xFFu<<16)
#define GFXMMU_LUT764L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT764L_FVB              (0xFFu<<8)
#define GFXMMU_LUT764L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT764L_EN               (0x1u<<0)

#define GFXMMU_LUT764L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT764L_EN_B_0X1         (0x1u<<0)

// LUT764H Configuration

#define GFXMMU_LUT764H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT764H_LO_0             (0x1u<<0)

// LUT765L Configuration

#define GFXMMU_LUT765L_LVB              (0xFFu<<16)
#define GFXMMU_LUT765L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT765L_FVB              (0xFFu<<8)
#define GFXMMU_LUT765L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT765L_EN               (0x1u<<0)

#define GFXMMU_LUT765L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT765L_EN_B_0X1         (0x1u<<0)

// LUT765H Configuration

#define GFXMMU_LUT765H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT765H_LO_0             (0x1u<<0)

// LUT766L Configuration

#define GFXMMU_LUT766L_LVB              (0xFFu<<16)
#define GFXMMU_LUT766L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT766L_FVB              (0xFFu<<8)
#define GFXMMU_LUT766L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT766L_EN               (0x1u<<0)

#define GFXMMU_LUT766L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT766L_EN_B_0X1         (0x1u<<0)

// LUT766H Configuration

#define GFXMMU_LUT766H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT766H_LO_0             (0x1u<<0)

// LUT767L Configuration

#define GFXMMU_LUT767L_LVB              (0xFFu<<16)
#define GFXMMU_LUT767L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT767L_FVB              (0xFFu<<8)
#define GFXMMU_LUT767L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT767L_EN               (0x1u<<0)

#define GFXMMU_LUT767L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT767L_EN_B_0X1         (0x1u<<0)

// LUT767H Configuration

#define GFXMMU_LUT767H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT767H_LO_0             (0x1u<<0)

// LUT768L Configuration

#define GFXMMU_LUT768L_LVB              (0xFFu<<16)
#define GFXMMU_LUT768L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT768L_FVB              (0xFFu<<8)
#define GFXMMU_LUT768L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT768L_EN               (0x1u<<0)

#define GFXMMU_LUT768L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT768L_EN_B_0X1         (0x1u<<0)

// LUT768H Configuration

#define GFXMMU_LUT768H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT768H_LO_0             (0x1u<<0)

// LUT769L Configuration

#define GFXMMU_LUT769L_LVB              (0xFFu<<16)
#define GFXMMU_LUT769L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT769L_FVB              (0xFFu<<8)
#define GFXMMU_LUT769L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT769L_EN               (0x1u<<0)

#define GFXMMU_LUT769L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT769L_EN_B_0X1         (0x1u<<0)

// LUT769H Configuration

#define GFXMMU_LUT769H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT769H_LO_0             (0x1u<<0)

// LUT770L Configuration

#define GFXMMU_LUT770L_LVB              (0xFFu<<16)
#define GFXMMU_LUT770L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT770L_FVB              (0xFFu<<8)
#define GFXMMU_LUT770L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT770L_EN               (0x1u<<0)

#define GFXMMU_LUT770L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT770L_EN_B_0X1         (0x1u<<0)

// LUT770H Configuration

#define GFXMMU_LUT770H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT770H_LO_0             (0x1u<<0)

// LUT771L Configuration

#define GFXMMU_LUT771L_LVB              (0xFFu<<16)
#define GFXMMU_LUT771L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT771L_FVB              (0xFFu<<8)
#define GFXMMU_LUT771L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT771L_EN               (0x1u<<0)

#define GFXMMU_LUT771L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT771L_EN_B_0X1         (0x1u<<0)

// LUT771H Configuration

#define GFXMMU_LUT771H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT771H_LO_0             (0x1u<<0)

// LUT772L Configuration

#define GFXMMU_LUT772L_LVB              (0xFFu<<16)
#define GFXMMU_LUT772L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT772L_FVB              (0xFFu<<8)
#define GFXMMU_LUT772L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT772L_EN               (0x1u<<0)

#define GFXMMU_LUT772L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT772L_EN_B_0X1         (0x1u<<0)

// LUT772H Configuration

#define GFXMMU_LUT772H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT772H_LO_0             (0x1u<<0)

