Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_gfxmmu.h
// LUT773L Configuration

#define GFXMMU_LUT773L_LVB              (0xFFu<<16)
#define GFXMMU_LUT773L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT773L_FVB              (0xFFu<<8)
#define GFXMMU_LUT773L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT773L_EN               (0x1u<<0)

#define GFXMMU_LUT773L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT773L_EN_B_0X1         (0x1u<<0)

// LUT773H Configuration

#define GFXMMU_LUT773H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT773H_LO_0             (0x1u<<0)

// LUT774L Configuration

#define GFXMMU_LUT774L_LVB              (0xFFu<<16)
#define GFXMMU_LUT774L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT774L_FVB              (0xFFu<<8)
#define GFXMMU_LUT774L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT774L_EN               (0x1u<<0)

#define GFXMMU_LUT774L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT774L_EN_B_0X1         (0x1u<<0)

// LUT774H Configuration

#define GFXMMU_LUT774H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT774H_LO_0             (0x1u<<0)

// LUT775L Configuration

#define GFXMMU_LUT775L_LVB              (0xFFu<<16)
#define GFXMMU_LUT775L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT775L_FVB              (0xFFu<<8)
#define GFXMMU_LUT775L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT775L_EN               (0x1u<<0)

#define GFXMMU_LUT775L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT775L_EN_B_0X1         (0x1u<<0)

// LUT775H Configuration

#define GFXMMU_LUT775H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT775H_LO_0             (0x1u<<0)

// LUT776L Configuration

#define GFXMMU_LUT776L_LVB              (0xFFu<<16)
#define GFXMMU_LUT776L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT776L_FVB              (0xFFu<<8)
#define GFXMMU_LUT776L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT776L_EN               (0x1u<<0)

#define GFXMMU_LUT776L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT776L_EN_B_0X1         (0x1u<<0)

// LUT776H Configuration

#define GFXMMU_LUT776H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT776H_LO_0             (0x1u<<0)

// LUT777L Configuration

#define GFXMMU_LUT777L_LVB              (0xFFu<<16)
#define GFXMMU_LUT777L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT777L_FVB              (0xFFu<<8)
#define GFXMMU_LUT777L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT777L_EN               (0x1u<<0)

#define GFXMMU_LUT777L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT777L_EN_B_0X1         (0x1u<<0)

// LUT777H Configuration

#define GFXMMU_LUT777H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT777H_LO_0             (0x1u<<0)

// LUT778L Configuration

#define GFXMMU_LUT778L_LVB              (0xFFu<<16)
#define GFXMMU_LUT778L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT778L_FVB              (0xFFu<<8)
#define GFXMMU_LUT778L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT778L_EN               (0x1u<<0)

#define GFXMMU_LUT778L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT778L_EN_B_0X1         (0x1u<<0)

// LUT778H Configuration

#define GFXMMU_LUT778H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT778H_LO_0             (0x1u<<0)

// LUT779L Configuration

#define GFXMMU_LUT779L_LVB              (0xFFu<<16)
#define GFXMMU_LUT779L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT779L_FVB              (0xFFu<<8)
#define GFXMMU_LUT779L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT779L_EN               (0x1u<<0)

#define GFXMMU_LUT779L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT779L_EN_B_0X1         (0x1u<<0)

// LUT779H Configuration

#define GFXMMU_LUT779H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT779H_LO_0             (0x1u<<0)

// LUT780L Configuration

#define GFXMMU_LUT780L_LVB              (0xFFu<<16)
#define GFXMMU_LUT780L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT780L_FVB              (0xFFu<<8)
#define GFXMMU_LUT780L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT780L_EN               (0x1u<<0)

#define GFXMMU_LUT780L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT780L_EN_B_0X1         (0x1u<<0)

// LUT780H Configuration

#define GFXMMU_LUT780H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT780H_LO_0             (0x1u<<0)

// LUT781L Configuration

#define GFXMMU_LUT781L_LVB              (0xFFu<<16)
#define GFXMMU_LUT781L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT781L_FVB              (0xFFu<<8)
#define GFXMMU_LUT781L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT781L_EN               (0x1u<<0)

#define GFXMMU_LUT781L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT781L_EN_B_0X1         (0x1u<<0)

// LUT781H Configuration

#define GFXMMU_LUT781H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT781H_LO_0             (0x1u<<0)

// LUT782L Configuration

#define GFXMMU_LUT782L_LVB              (0xFFu<<16)
#define GFXMMU_LUT782L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT782L_FVB              (0xFFu<<8)
#define GFXMMU_LUT782L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT782L_EN               (0x1u<<0)

#define GFXMMU_LUT782L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT782L_EN_B_0X1         (0x1u<<0)

// LUT782H Configuration

#define GFXMMU_LUT782H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT782H_LO_0             (0x1u<<0)

// LUT783L Configuration

#define GFXMMU_LUT783L_LVB              (0xFFu<<16)
#define GFXMMU_LUT783L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT783L_FVB              (0xFFu<<8)
#define GFXMMU_LUT783L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT783L_EN               (0x1u<<0)

#define GFXMMU_LUT783L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT783L_EN_B_0X1         (0x1u<<0)

// LUT783H Configuration

#define GFXMMU_LUT783H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT783H_LO_0             (0x1u<<0)

// LUT784L Configuration

#define GFXMMU_LUT784L_LVB              (0xFFu<<16)
#define GFXMMU_LUT784L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT784L_FVB              (0xFFu<<8)
#define GFXMMU_LUT784L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT784L_EN               (0x1u<<0)

#define GFXMMU_LUT784L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT784L_EN_B_0X1         (0x1u<<0)

// LUT784H Configuration

#define GFXMMU_LUT784H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT784H_LO_0             (0x1u<<0)

// LUT785L Configuration

#define GFXMMU_LUT785L_LVB              (0xFFu<<16)
#define GFXMMU_LUT785L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT785L_FVB              (0xFFu<<8)
#define GFXMMU_LUT785L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT785L_EN               (0x1u<<0)

#define GFXMMU_LUT785L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT785L_EN_B_0X1         (0x1u<<0)

// LUT785H Configuration

