Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_gfxmmu.h
// LUT809H Configuration

#define GFXMMU_LUT809H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT809H_LO_0             (0x1u<<0)

// LUT810L Configuration

#define GFXMMU_LUT810L_LVB              (0xFFu<<16)
#define GFXMMU_LUT810L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT810L_FVB              (0xFFu<<8)
#define GFXMMU_LUT810L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT810L_EN               (0x1u<<0)

#define GFXMMU_LUT810L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT810L_EN_B_0X1         (0x1u<<0)

// LUT810H Configuration

#define GFXMMU_LUT810H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT810H_LO_0             (0x1u<<0)

// LUT811L Configuration

#define GFXMMU_LUT811L_LVB              (0xFFu<<16)
#define GFXMMU_LUT811L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT811L_FVB              (0xFFu<<8)
#define GFXMMU_LUT811L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT811L_EN               (0x1u<<0)

#define GFXMMU_LUT811L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT811L_EN_B_0X1         (0x1u<<0)

// LUT811H Configuration

#define GFXMMU_LUT811H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT811H_LO_0             (0x1u<<0)

// LUT812L Configuration

#define GFXMMU_LUT812L_LVB              (0xFFu<<16)
#define GFXMMU_LUT812L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT812L_FVB              (0xFFu<<8)
#define GFXMMU_LUT812L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT812L_EN               (0x1u<<0)

#define GFXMMU_LUT812L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT812L_EN_B_0X1         (0x1u<<0)

// LUT812H Configuration

#define GFXMMU_LUT812H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT812H_LO_0             (0x1u<<0)

// LUT813L Configuration

#define GFXMMU_LUT813L_LVB              (0xFFu<<16)
#define GFXMMU_LUT813L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT813L_FVB              (0xFFu<<8)
#define GFXMMU_LUT813L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT813L_EN               (0x1u<<0)

#define GFXMMU_LUT813L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT813L_EN_B_0X1         (0x1u<<0)

// LUT813H Configuration

#define GFXMMU_LUT813H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT813H_LO_0             (0x1u<<0)

// LUT814L Configuration

#define GFXMMU_LUT814L_LVB              (0xFFu<<16)
#define GFXMMU_LUT814L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT814L_FVB              (0xFFu<<8)
#define GFXMMU_LUT814L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT814L_EN               (0x1u<<0)

#define GFXMMU_LUT814L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT814L_EN_B_0X1         (0x1u<<0)

// LUT814H Configuration

#define GFXMMU_LUT814H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT814H_LO_0             (0x1u<<0)

// LUT815L Configuration

#define GFXMMU_LUT815L_LVB              (0xFFu<<16)
#define GFXMMU_LUT815L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT815L_FVB              (0xFFu<<8)
#define GFXMMU_LUT815L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT815L_EN               (0x1u<<0)

#define GFXMMU_LUT815L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT815L_EN_B_0X1         (0x1u<<0)

// LUT815H Configuration

#define GFXMMU_LUT815H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT815H_LO_0             (0x1u<<0)

// LUT816L Configuration

#define GFXMMU_LUT816L_LVB              (0xFFu<<16)
#define GFXMMU_LUT816L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT816L_FVB              (0xFFu<<8)
#define GFXMMU_LUT816L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT816L_EN               (0x1u<<0)

#define GFXMMU_LUT816L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT816L_EN_B_0X1         (0x1u<<0)

// LUT816H Configuration

#define GFXMMU_LUT816H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT816H_LO_0             (0x1u<<0)

// LUT817L Configuration

#define GFXMMU_LUT817L_LVB              (0xFFu<<16)
#define GFXMMU_LUT817L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT817L_FVB              (0xFFu<<8)
#define GFXMMU_LUT817L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT817L_EN               (0x1u<<0)

#define GFXMMU_LUT817L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT817L_EN_B_0X1         (0x1u<<0)

// LUT817H Configuration

#define GFXMMU_LUT817H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT817H_LO_0             (0x1u<<0)

// LUT818L Configuration

#define GFXMMU_LUT818L_LVB              (0xFFu<<16)
#define GFXMMU_LUT818L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT818L_FVB              (0xFFu<<8)
#define GFXMMU_LUT818L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT818L_EN               (0x1u<<0)

#define GFXMMU_LUT818L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT818L_EN_B_0X1         (0x1u<<0)

// LUT818H Configuration

#define GFXMMU_LUT818H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT818H_LO_0             (0x1u<<0)

// LUT819L Configuration

#define GFXMMU_LUT819L_LVB              (0xFFu<<16)
#define GFXMMU_LUT819L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT819L_FVB              (0xFFu<<8)
#define GFXMMU_LUT819L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT819L_EN               (0x1u<<0)

#define GFXMMU_LUT819L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT819L_EN_B_0X1         (0x1u<<0)

// LUT819H Configuration

#define GFXMMU_LUT819H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT819H_LO_0             (0x1u<<0)

// LUT820L Configuration

#define GFXMMU_LUT820L_LVB              (0xFFu<<16)
#define GFXMMU_LUT820L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT820L_FVB              (0xFFu<<8)
#define GFXMMU_LUT820L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT820L_EN               (0x1u<<0)

#define GFXMMU_LUT820L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT820L_EN_B_0X1         (0x1u<<0)

// LUT820H Configuration

#define GFXMMU_LUT820H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT820H_LO_0             (0x1u<<0)

// LUT821L Configuration

#define GFXMMU_LUT821L_LVB              (0xFFu<<16)
#define GFXMMU_LUT821L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT821L_FVB              (0xFFu<<8)
#define GFXMMU_LUT821L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT821L_EN               (0x1u<<0)

