Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_gfxmmu.h
#define GFXMMU_LUT821L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT821L_EN_B_0X1         (0x1u<<0)

// LUT821H Configuration

#define GFXMMU_LUT821H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT821H_LO_0             (0x1u<<0)

// LUT822L Configuration

#define GFXMMU_LUT822L_LVB              (0xFFu<<16)
#define GFXMMU_LUT822L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT822L_FVB              (0xFFu<<8)
#define GFXMMU_LUT822L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT822L_EN               (0x1u<<0)

#define GFXMMU_LUT822L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT822L_EN_B_0X1         (0x1u<<0)

// LUT822H Configuration

#define GFXMMU_LUT822H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT822H_LO_0             (0x1u<<0)

// LUT823L Configuration

#define GFXMMU_LUT823L_LVB              (0xFFu<<16)
#define GFXMMU_LUT823L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT823L_FVB              (0xFFu<<8)
#define GFXMMU_LUT823L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT823L_EN               (0x1u<<0)

#define GFXMMU_LUT823L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT823L_EN_B_0X1         (0x1u<<0)

// LUT823H Configuration

#define GFXMMU_LUT823H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT823H_LO_0             (0x1u<<0)

// LUT824L Configuration

#define GFXMMU_LUT824L_LVB              (0xFFu<<16)
#define GFXMMU_LUT824L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT824L_FVB              (0xFFu<<8)
#define GFXMMU_LUT824L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT824L_EN               (0x1u<<0)

#define GFXMMU_LUT824L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT824L_EN_B_0X1         (0x1u<<0)

// LUT824H Configuration

#define GFXMMU_LUT824H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT824H_LO_0             (0x1u<<0)

// LUT825L Configuration

#define GFXMMU_LUT825L_LVB              (0xFFu<<16)
#define GFXMMU_LUT825L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT825L_FVB              (0xFFu<<8)
#define GFXMMU_LUT825L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT825L_EN               (0x1u<<0)

#define GFXMMU_LUT825L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT825L_EN_B_0X1         (0x1u<<0)

// LUT825H Configuration

#define GFXMMU_LUT825H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT825H_LO_0             (0x1u<<0)

// LUT826L Configuration

#define GFXMMU_LUT826L_LVB              (0xFFu<<16)
#define GFXMMU_LUT826L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT826L_FVB              (0xFFu<<8)
#define GFXMMU_LUT826L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT826L_EN               (0x1u<<0)

#define GFXMMU_LUT826L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT826L_EN_B_0X1         (0x1u<<0)

// LUT826H Configuration

#define GFXMMU_LUT826H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT826H_LO_0             (0x1u<<0)

// LUT827L Configuration

#define GFXMMU_LUT827L_LVB              (0xFFu<<16)
#define GFXMMU_LUT827L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT827L_FVB              (0xFFu<<8)
#define GFXMMU_LUT827L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT827L_EN               (0x1u<<0)

#define GFXMMU_LUT827L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT827L_EN_B_0X1         (0x1u<<0)

// LUT827H Configuration

#define GFXMMU_LUT827H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT827H_LO_0             (0x1u<<0)

// LUT828L Configuration

#define GFXMMU_LUT828L_LVB              (0xFFu<<16)
#define GFXMMU_LUT828L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT828L_FVB              (0xFFu<<8)
#define GFXMMU_LUT828L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT828L_EN               (0x1u<<0)

#define GFXMMU_LUT828L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT828L_EN_B_0X1         (0x1u<<0)

// LUT828H Configuration

#define GFXMMU_LUT828H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT828H_LO_0             (0x1u<<0)

// LUT829L Configuration

#define GFXMMU_LUT829L_LVB              (0xFFu<<16)
#define GFXMMU_LUT829L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT829L_FVB              (0xFFu<<8)
#define GFXMMU_LUT829L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT829L_EN               (0x1u<<0)

#define GFXMMU_LUT829L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT829L_EN_B_0X1         (0x1u<<0)

// LUT829H Configuration

#define GFXMMU_LUT829H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT829H_LO_0             (0x1u<<0)

// LUT830L Configuration

#define GFXMMU_LUT830L_LVB              (0xFFu<<16)
#define GFXMMU_LUT830L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT830L_FVB              (0xFFu<<8)
#define GFXMMU_LUT830L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT830L_EN               (0x1u<<0)

#define GFXMMU_LUT830L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT830L_EN_B_0X1         (0x1u<<0)

// LUT830H Configuration

#define GFXMMU_LUT830H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT830H_LO_0             (0x1u<<0)

// LUT831L Configuration

#define GFXMMU_LUT831L_LVB              (0xFFu<<16)
#define GFXMMU_LUT831L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT831L_FVB              (0xFFu<<8)
#define GFXMMU_LUT831L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT831L_EN               (0x1u<<0)

#define GFXMMU_LUT831L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT831L_EN_B_0X1         (0x1u<<0)

// LUT831H Configuration

#define GFXMMU_LUT831H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT831H_LO_0             (0x1u<<0)

// LUT832L Configuration

#define GFXMMU_LUT832L_LVB              (0xFFu<<16)
#define GFXMMU_LUT832L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT832L_FVB              (0xFFu<<8)
#define GFXMMU_LUT832L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT832L_EN               (0x1u<<0)

#define GFXMMU_LUT832L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT832L_EN_B_0X1         (0x1u<<0)

// LUT832H Configuration

#define GFXMMU_LUT832H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT832H_LO_0             (0x1u<<0)

// LUT833L Configuration

#define GFXMMU_LUT833L_LVB              (0xFFu<<16)
#define GFXMMU_LUT833L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT833L_FVB              (0xFFu<<8)
#define GFXMMU_LUT833L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT833L_EN               (0x1u<<0)

