Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_gfxmmu.h
#define GFXMMU_LUT883H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT883H_LO_0             (0x1u<<0)

// LUT884L Configuration

#define GFXMMU_LUT884L_LVB              (0xFFu<<16)
#define GFXMMU_LUT884L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT884L_FVB              (0xFFu<<8)
#define GFXMMU_LUT884L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT884L_EN               (0x1u<<0)

#define GFXMMU_LUT884L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT884L_EN_B_0X1         (0x1u<<0)

// LUT884H Configuration

#define GFXMMU_LUT884H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT884H_LO_0             (0x1u<<0)

// LUT885L Configuration

#define GFXMMU_LUT885L_LVB              (0xFFu<<16)
#define GFXMMU_LUT885L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT885L_FVB              (0xFFu<<8)
#define GFXMMU_LUT885L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT885L_EN               (0x1u<<0)

#define GFXMMU_LUT885L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT885L_EN_B_0X1         (0x1u<<0)

// LUT885H Configuration

#define GFXMMU_LUT885H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT885H_LO_0             (0x1u<<0)

// LUT886L Configuration

#define GFXMMU_LUT886L_LVB              (0xFFu<<16)
#define GFXMMU_LUT886L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT886L_FVB              (0xFFu<<8)
#define GFXMMU_LUT886L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT886L_EN               (0x1u<<0)

#define GFXMMU_LUT886L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT886L_EN_B_0X1         (0x1u<<0)

// LUT886H Configuration

#define GFXMMU_LUT886H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT886H_LO_0             (0x1u<<0)

// LUT887L Configuration

#define GFXMMU_LUT887L_LVB              (0xFFu<<16)
#define GFXMMU_LUT887L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT887L_FVB              (0xFFu<<8)
#define GFXMMU_LUT887L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT887L_EN               (0x1u<<0)

#define GFXMMU_LUT887L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT887L_EN_B_0X1         (0x1u<<0)

// LUT887H Configuration

#define GFXMMU_LUT887H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT887H_LO_0             (0x1u<<0)

// LUT888L Configuration

#define GFXMMU_LUT888L_LVB              (0xFFu<<16)
#define GFXMMU_LUT888L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT888L_FVB              (0xFFu<<8)
#define GFXMMU_LUT888L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT888L_EN               (0x1u<<0)

#define GFXMMU_LUT888L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT888L_EN_B_0X1         (0x1u<<0)

// LUT888H Configuration

#define GFXMMU_LUT888H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT888H_LO_0             (0x1u<<0)

// LUT889L Configuration

#define GFXMMU_LUT889L_LVB              (0xFFu<<16)
#define GFXMMU_LUT889L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT889L_FVB              (0xFFu<<8)
#define GFXMMU_LUT889L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT889L_EN               (0x1u<<0)

#define GFXMMU_LUT889L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT889L_EN_B_0X1         (0x1u<<0)

// LUT889H Configuration

#define GFXMMU_LUT889H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT889H_LO_0             (0x1u<<0)

// LUT890L Configuration

#define GFXMMU_LUT890L_LVB              (0xFFu<<16)
#define GFXMMU_LUT890L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT890L_FVB              (0xFFu<<8)
#define GFXMMU_LUT890L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT890L_EN               (0x1u<<0)

#define GFXMMU_LUT890L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT890L_EN_B_0X1         (0x1u<<0)

// LUT890H Configuration

#define GFXMMU_LUT890H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT890H_LO_0             (0x1u<<0)

// LUT891L Configuration

#define GFXMMU_LUT891L_LVB              (0xFFu<<16)
#define GFXMMU_LUT891L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT891L_FVB              (0xFFu<<8)
#define GFXMMU_LUT891L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT891L_EN               (0x1u<<0)

#define GFXMMU_LUT891L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT891L_EN_B_0X1         (0x1u<<0)

// LUT891H Configuration

#define GFXMMU_LUT891H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT891H_LO_0             (0x1u<<0)

// LUT892L Configuration

#define GFXMMU_LUT892L_LVB              (0xFFu<<16)
#define GFXMMU_LUT892L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT892L_FVB              (0xFFu<<8)
#define GFXMMU_LUT892L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT892L_EN               (0x1u<<0)

#define GFXMMU_LUT892L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT892L_EN_B_0X1         (0x1u<<0)

// LUT892H Configuration

#define GFXMMU_LUT892H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT892H_LO_0             (0x1u<<0)

// LUT893L Configuration

#define GFXMMU_LUT893L_LVB              (0xFFu<<16)
#define GFXMMU_LUT893L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT893L_FVB              (0xFFu<<8)
#define GFXMMU_LUT893L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT893L_EN               (0x1u<<0)

#define GFXMMU_LUT893L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT893L_EN_B_0X1         (0x1u<<0)

// LUT893H Configuration

#define GFXMMU_LUT893H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT893H_LO_0             (0x1u<<0)

// LUT894L Configuration

#define GFXMMU_LUT894L_LVB              (0xFFu<<16)
#define GFXMMU_LUT894L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT894L_FVB              (0xFFu<<8)
#define GFXMMU_LUT894L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT894L_EN               (0x1u<<0)

#define GFXMMU_LUT894L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT894L_EN_B_0X1         (0x1u<<0)

// LUT894H Configuration

#define GFXMMU_LUT894H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT894H_LO_0             (0x1u<<0)

// LUT895L Configuration

#define GFXMMU_LUT895L_LVB              (0xFFu<<16)
#define GFXMMU_LUT895L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT895L_FVB              (0xFFu<<8)
#define GFXMMU_LUT895L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT895L_EN               (0x1u<<0)

