Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_gfxmmu.h
#define GFXMMU_LUT907L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT907L_EN_B_0X1         (0x1u<<0)

// LUT907H Configuration

#define GFXMMU_LUT907H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT907H_LO_0             (0x1u<<0)

// LUT908L Configuration

#define GFXMMU_LUT908L_LVB              (0xFFu<<16)
#define GFXMMU_LUT908L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT908L_FVB              (0xFFu<<8)
#define GFXMMU_LUT908L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT908L_EN               (0x1u<<0)

#define GFXMMU_LUT908L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT908L_EN_B_0X1         (0x1u<<0)

// LUT908H Configuration

#define GFXMMU_LUT908H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT908H_LO_0             (0x1u<<0)

// LUT909L Configuration

#define GFXMMU_LUT909L_LVB              (0xFFu<<16)
#define GFXMMU_LUT909L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT909L_FVB              (0xFFu<<8)
#define GFXMMU_LUT909L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT909L_EN               (0x1u<<0)

#define GFXMMU_LUT909L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT909L_EN_B_0X1         (0x1u<<0)

// LUT909H Configuration

#define GFXMMU_LUT909H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT909H_LO_0             (0x1u<<0)

// LUT910L Configuration

#define GFXMMU_LUT910L_LVB              (0xFFu<<16)
#define GFXMMU_LUT910L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT910L_FVB              (0xFFu<<8)
#define GFXMMU_LUT910L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT910L_EN               (0x1u<<0)

#define GFXMMU_LUT910L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT910L_EN_B_0X1         (0x1u<<0)

// LUT910H Configuration

#define GFXMMU_LUT910H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT910H_LO_0             (0x1u<<0)

// LUT911L Configuration

#define GFXMMU_LUT911L_LVB              (0xFFu<<16)
#define GFXMMU_LUT911L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT911L_FVB              (0xFFu<<8)
#define GFXMMU_LUT911L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT911L_EN               (0x1u<<0)

#define GFXMMU_LUT911L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT911L_EN_B_0X1         (0x1u<<0)

// LUT911H Configuration

#define GFXMMU_LUT911H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT911H_LO_0             (0x1u<<0)

// LUT912L Configuration

#define GFXMMU_LUT912L_LVB              (0xFFu<<16)
#define GFXMMU_LUT912L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT912L_FVB              (0xFFu<<8)
#define GFXMMU_LUT912L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT912L_EN               (0x1u<<0)

#define GFXMMU_LUT912L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT912L_EN_B_0X1         (0x1u<<0)

// LUT912H Configuration

#define GFXMMU_LUT912H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT912H_LO_0             (0x1u<<0)

// LUT913L Configuration

#define GFXMMU_LUT913L_LVB              (0xFFu<<16)
#define GFXMMU_LUT913L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT913L_FVB              (0xFFu<<8)
#define GFXMMU_LUT913L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT913L_EN               (0x1u<<0)

#define GFXMMU_LUT913L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT913L_EN_B_0X1         (0x1u<<0)

// LUT913H Configuration

#define GFXMMU_LUT913H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT913H_LO_0             (0x1u<<0)

// LUT914L Configuration

#define GFXMMU_LUT914L_LVB              (0xFFu<<16)
#define GFXMMU_LUT914L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT914L_FVB              (0xFFu<<8)
#define GFXMMU_LUT914L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT914L_EN               (0x1u<<0)

#define GFXMMU_LUT914L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT914L_EN_B_0X1         (0x1u<<0)

// LUT914H Configuration

#define GFXMMU_LUT914H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT914H_LO_0             (0x1u<<0)

// LUT915L Configuration

#define GFXMMU_LUT915L_LVB              (0xFFu<<16)
#define GFXMMU_LUT915L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT915L_FVB              (0xFFu<<8)
#define GFXMMU_LUT915L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT915L_EN               (0x1u<<0)

#define GFXMMU_LUT915L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT915L_EN_B_0X1         (0x1u<<0)

// LUT915H Configuration

#define GFXMMU_LUT915H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT915H_LO_0             (0x1u<<0)

// LUT916L Configuration

#define GFXMMU_LUT916L_LVB              (0xFFu<<16)
#define GFXMMU_LUT916L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT916L_FVB              (0xFFu<<8)
#define GFXMMU_LUT916L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT916L_EN               (0x1u<<0)

#define GFXMMU_LUT916L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT916L_EN_B_0X1         (0x1u<<0)

// LUT916H Configuration

#define GFXMMU_LUT916H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT916H_LO_0             (0x1u<<0)

// LUT917L Configuration

#define GFXMMU_LUT917L_LVB              (0xFFu<<16)
#define GFXMMU_LUT917L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT917L_FVB              (0xFFu<<8)
#define GFXMMU_LUT917L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT917L_EN               (0x1u<<0)

#define GFXMMU_LUT917L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT917L_EN_B_0X1         (0x1u<<0)

// LUT917H Configuration

#define GFXMMU_LUT917H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT917H_LO_0             (0x1u<<0)

// LUT918L Configuration

#define GFXMMU_LUT918L_LVB              (0xFFu<<16)
#define GFXMMU_LUT918L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT918L_FVB              (0xFFu<<8)
#define GFXMMU_LUT918L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT918L_EN               (0x1u<<0)

#define GFXMMU_LUT918L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT918L_EN_B_0X1         (0x1u<<0)

// LUT918H Configuration

#define GFXMMU_LUT918H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT918H_LO_0             (0x1u<<0)

// LUT919L Configuration

#define GFXMMU_LUT919L_LVB              (0xFFu<<16)
#define GFXMMU_LUT919L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT919L_FVB              (0xFFu<<8)
#define GFXMMU_LUT919L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT919L_EN               (0x1u<<0)

#define GFXMMU_LUT919L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT919L_EN_B_0X1         (0x1u<<0)

// LUT919H Configuration

