Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_gfxmmu.h
#define GFXMMU_LUT919H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT919H_LO_0             (0x1u<<0)

// LUT920L Configuration

#define GFXMMU_LUT920L_LVB              (0xFFu<<16)
#define GFXMMU_LUT920L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT920L_FVB              (0xFFu<<8)
#define GFXMMU_LUT920L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT920L_EN               (0x1u<<0)

#define GFXMMU_LUT920L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT920L_EN_B_0X1         (0x1u<<0)

// LUT920H Configuration

#define GFXMMU_LUT920H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT920H_LO_0             (0x1u<<0)

// LUT921L Configuration

#define GFXMMU_LUT921L_LVB              (0xFFu<<16)
#define GFXMMU_LUT921L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT921L_FVB              (0xFFu<<8)
#define GFXMMU_LUT921L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT921L_EN               (0x1u<<0)

#define GFXMMU_LUT921L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT921L_EN_B_0X1         (0x1u<<0)

// LUT921H Configuration

#define GFXMMU_LUT921H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT921H_LO_0             (0x1u<<0)

// LUT922L Configuration

#define GFXMMU_LUT922L_LVB              (0xFFu<<16)
#define GFXMMU_LUT922L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT922L_FVB              (0xFFu<<8)
#define GFXMMU_LUT922L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT922L_EN               (0x1u<<0)

#define GFXMMU_LUT922L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT922L_EN_B_0X1         (0x1u<<0)

// LUT922H Configuration

#define GFXMMU_LUT922H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT922H_LO_0             (0x1u<<0)

// LUT923L Configuration

#define GFXMMU_LUT923L_LVB              (0xFFu<<16)
#define GFXMMU_LUT923L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT923L_FVB              (0xFFu<<8)
#define GFXMMU_LUT923L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT923L_EN               (0x1u<<0)

#define GFXMMU_LUT923L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT923L_EN_B_0X1         (0x1u<<0)

// LUT923H Configuration

#define GFXMMU_LUT923H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT923H_LO_0             (0x1u<<0)

// LUT924L Configuration

#define GFXMMU_LUT924L_LVB              (0xFFu<<16)
#define GFXMMU_LUT924L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT924L_FVB              (0xFFu<<8)
#define GFXMMU_LUT924L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT924L_EN               (0x1u<<0)

#define GFXMMU_LUT924L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT924L_EN_B_0X1         (0x1u<<0)

// LUT924H Configuration

#define GFXMMU_LUT924H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT924H_LO_0             (0x1u<<0)

// LUT925L Configuration

#define GFXMMU_LUT925L_LVB              (0xFFu<<16)
#define GFXMMU_LUT925L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT925L_FVB              (0xFFu<<8)
#define GFXMMU_LUT925L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT925L_EN               (0x1u<<0)

#define GFXMMU_LUT925L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT925L_EN_B_0X1         (0x1u<<0)

// LUT925H Configuration

#define GFXMMU_LUT925H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT925H_LO_0             (0x1u<<0)

// LUT926L Configuration

#define GFXMMU_LUT926L_LVB              (0xFFu<<16)
#define GFXMMU_LUT926L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT926L_FVB              (0xFFu<<8)
#define GFXMMU_LUT926L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT926L_EN               (0x1u<<0)

#define GFXMMU_LUT926L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT926L_EN_B_0X1         (0x1u<<0)

// LUT926H Configuration

#define GFXMMU_LUT926H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT926H_LO_0             (0x1u<<0)

// LUT927L Configuration

#define GFXMMU_LUT927L_LVB              (0xFFu<<16)
#define GFXMMU_LUT927L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT927L_FVB              (0xFFu<<8)
#define GFXMMU_LUT927L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT927L_EN               (0x1u<<0)

#define GFXMMU_LUT927L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT927L_EN_B_0X1         (0x1u<<0)

// LUT927H Configuration

#define GFXMMU_LUT927H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT927H_LO_0             (0x1u<<0)

// LUT928L Configuration

#define GFXMMU_LUT928L_LVB              (0xFFu<<16)
#define GFXMMU_LUT928L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT928L_FVB              (0xFFu<<8)
#define GFXMMU_LUT928L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT928L_EN               (0x1u<<0)

#define GFXMMU_LUT928L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT928L_EN_B_0X1         (0x1u<<0)

// LUT928H Configuration

#define GFXMMU_LUT928H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT928H_LO_0             (0x1u<<0)

// LUT929L Configuration

#define GFXMMU_LUT929L_LVB              (0xFFu<<16)
#define GFXMMU_LUT929L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT929L_FVB              (0xFFu<<8)
#define GFXMMU_LUT929L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT929L_EN               (0x1u<<0)

#define GFXMMU_LUT929L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT929L_EN_B_0X1         (0x1u<<0)

// LUT929H Configuration

#define GFXMMU_LUT929H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT929H_LO_0             (0x1u<<0)

// LUT930L Configuration

#define GFXMMU_LUT930L_LVB              (0xFFu<<16)
#define GFXMMU_LUT930L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT930L_FVB              (0xFFu<<8)
#define GFXMMU_LUT930L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT930L_EN               (0x1u<<0)

#define GFXMMU_LUT930L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT930L_EN_B_0X1         (0x1u<<0)

// LUT930H Configuration

#define GFXMMU_LUT930H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT930H_LO_0             (0x1u<<0)

// LUT931L Configuration

#define GFXMMU_LUT931L_LVB              (0xFFu<<16)
#define GFXMMU_LUT931L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT931L_FVB              (0xFFu<<8)
#define GFXMMU_LUT931L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT931L_EN               (0x1u<<0)

#define GFXMMU_LUT931L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT931L_EN_B_0X1         (0x1u<<0)

// LUT931H Configuration

#define GFXMMU_LUT931H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT931H_LO_0             (0x1u<<0)

// LUT932L Configuration

