Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_gfxmmu.h
#define GFXMMU_LUT932L_LVB              (0xFFu<<16)
#define GFXMMU_LUT932L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT932L_FVB              (0xFFu<<8)
#define GFXMMU_LUT932L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT932L_EN               (0x1u<<0)

#define GFXMMU_LUT932L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT932L_EN_B_0X1         (0x1u<<0)

// LUT932H Configuration

#define GFXMMU_LUT932H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT932H_LO_0             (0x1u<<0)

// LUT933L Configuration

#define GFXMMU_LUT933L_LVB              (0xFFu<<16)
#define GFXMMU_LUT933L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT933L_FVB              (0xFFu<<8)
#define GFXMMU_LUT933L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT933L_EN               (0x1u<<0)

#define GFXMMU_LUT933L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT933L_EN_B_0X1         (0x1u<<0)

// LUT933H Configuration

#define GFXMMU_LUT933H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT933H_LO_0             (0x1u<<0)

// LUT934L Configuration

#define GFXMMU_LUT934L_LVB              (0xFFu<<16)
#define GFXMMU_LUT934L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT934L_FVB              (0xFFu<<8)
#define GFXMMU_LUT934L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT934L_EN               (0x1u<<0)

#define GFXMMU_LUT934L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT934L_EN_B_0X1         (0x1u<<0)

// LUT934H Configuration

#define GFXMMU_LUT934H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT934H_LO_0             (0x1u<<0)

// LUT935L Configuration

#define GFXMMU_LUT935L_LVB              (0xFFu<<16)
#define GFXMMU_LUT935L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT935L_FVB              (0xFFu<<8)
#define GFXMMU_LUT935L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT935L_EN               (0x1u<<0)

#define GFXMMU_LUT935L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT935L_EN_B_0X1         (0x1u<<0)

// LUT935H Configuration

#define GFXMMU_LUT935H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT935H_LO_0             (0x1u<<0)

// LUT936L Configuration

#define GFXMMU_LUT936L_LVB              (0xFFu<<16)
#define GFXMMU_LUT936L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT936L_FVB              (0xFFu<<8)
#define GFXMMU_LUT936L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT936L_EN               (0x1u<<0)

#define GFXMMU_LUT936L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT936L_EN_B_0X1         (0x1u<<0)

// LUT936H Configuration

#define GFXMMU_LUT936H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT936H_LO_0             (0x1u<<0)

// LUT937L Configuration

#define GFXMMU_LUT937L_LVB              (0xFFu<<16)
#define GFXMMU_LUT937L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT937L_FVB              (0xFFu<<8)
#define GFXMMU_LUT937L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT937L_EN               (0x1u<<0)

#define GFXMMU_LUT937L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT937L_EN_B_0X1         (0x1u<<0)

// LUT937H Configuration

#define GFXMMU_LUT937H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT937H_LO_0             (0x1u<<0)

// LUT938L Configuration

#define GFXMMU_LUT938L_LVB              (0xFFu<<16)
#define GFXMMU_LUT938L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT938L_FVB              (0xFFu<<8)
#define GFXMMU_LUT938L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT938L_EN               (0x1u<<0)

#define GFXMMU_LUT938L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT938L_EN_B_0X1         (0x1u<<0)

// LUT938H Configuration

#define GFXMMU_LUT938H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT938H_LO_0             (0x1u<<0)

// LUT939L Configuration

#define GFXMMU_LUT939L_LVB              (0xFFu<<16)
#define GFXMMU_LUT939L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT939L_FVB              (0xFFu<<8)
#define GFXMMU_LUT939L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT939L_EN               (0x1u<<0)

#define GFXMMU_LUT939L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT939L_EN_B_0X1         (0x1u<<0)

// LUT939H Configuration

#define GFXMMU_LUT939H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT939H_LO_0             (0x1u<<0)

// LUT940L Configuration

#define GFXMMU_LUT940L_LVB              (0xFFu<<16)
#define GFXMMU_LUT940L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT940L_FVB              (0xFFu<<8)
#define GFXMMU_LUT940L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT940L_EN               (0x1u<<0)

#define GFXMMU_LUT940L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT940L_EN_B_0X1         (0x1u<<0)

// LUT940H Configuration

#define GFXMMU_LUT940H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT940H_LO_0             (0x1u<<0)

// LUT941L Configuration

#define GFXMMU_LUT941L_LVB              (0xFFu<<16)
#define GFXMMU_LUT941L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT941L_FVB              (0xFFu<<8)
#define GFXMMU_LUT941L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT941L_EN               (0x1u<<0)

#define GFXMMU_LUT941L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT941L_EN_B_0X1         (0x1u<<0)

// LUT941H Configuration

#define GFXMMU_LUT941H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT941H_LO_0             (0x1u<<0)

// LUT942L Configuration

#define GFXMMU_LUT942L_LVB              (0xFFu<<16)
#define GFXMMU_LUT942L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT942L_FVB              (0xFFu<<8)
#define GFXMMU_LUT942L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT942L_EN               (0x1u<<0)

#define GFXMMU_LUT942L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT942L_EN_B_0X1         (0x1u<<0)

// LUT942H Configuration

#define GFXMMU_LUT942H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT942H_LO_0             (0x1u<<0)

// LUT943L Configuration

#define GFXMMU_LUT943L_LVB              (0xFFu<<16)
#define GFXMMU_LUT943L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT943L_FVB              (0xFFu<<8)
#define GFXMMU_LUT943L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT943L_EN               (0x1u<<0)

#define GFXMMU_LUT943L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT943L_EN_B_0X1         (0x1u<<0)

// LUT943H Configuration

#define GFXMMU_LUT943H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT943H_LO_0             (0x1u<<0)

