Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_gfxmmu.h
// LUT956L Configuration

#define GFXMMU_LUT956L_LVB              (0xFFu<<16)
#define GFXMMU_LUT956L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT956L_FVB              (0xFFu<<8)
#define GFXMMU_LUT956L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT956L_EN               (0x1u<<0)

#define GFXMMU_LUT956L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT956L_EN_B_0X1         (0x1u<<0)

// LUT956H Configuration

#define GFXMMU_LUT956H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT956H_LO_0             (0x1u<<0)

// LUT957L Configuration

#define GFXMMU_LUT957L_LVB              (0xFFu<<16)
#define GFXMMU_LUT957L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT957L_FVB              (0xFFu<<8)
#define GFXMMU_LUT957L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT957L_EN               (0x1u<<0)

#define GFXMMU_LUT957L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT957L_EN_B_0X1         (0x1u<<0)

// LUT957H Configuration

#define GFXMMU_LUT957H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT957H_LO_0             (0x1u<<0)

// LUT958L Configuration

#define GFXMMU_LUT958L_LVB              (0xFFu<<16)
#define GFXMMU_LUT958L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT958L_FVB              (0xFFu<<8)
#define GFXMMU_LUT958L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT958L_EN               (0x1u<<0)

#define GFXMMU_LUT958L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT958L_EN_B_0X1         (0x1u<<0)

// LUT958H Configuration

#define GFXMMU_LUT958H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT958H_LO_0             (0x1u<<0)

// LUT959L Configuration

#define GFXMMU_LUT959L_LVB              (0xFFu<<16)
#define GFXMMU_LUT959L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT959L_FVB              (0xFFu<<8)
#define GFXMMU_LUT959L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT959L_EN               (0x1u<<0)

#define GFXMMU_LUT959L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT959L_EN_B_0X1         (0x1u<<0)

// LUT959H Configuration

#define GFXMMU_LUT959H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT959H_LO_0             (0x1u<<0)

// LUT960L Configuration

#define GFXMMU_LUT960L_LVB              (0xFFu<<16)
#define GFXMMU_LUT960L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT960L_FVB              (0xFFu<<8)
#define GFXMMU_LUT960L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT960L_EN               (0x1u<<0)

#define GFXMMU_LUT960L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT960L_EN_B_0X1         (0x1u<<0)

// LUT960H Configuration

#define GFXMMU_LUT960H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT960H_LO_0             (0x1u<<0)

// LUT961L Configuration

#define GFXMMU_LUT961L_LVB              (0xFFu<<16)
#define GFXMMU_LUT961L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT961L_FVB              (0xFFu<<8)
#define GFXMMU_LUT961L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT961L_EN               (0x1u<<0)

#define GFXMMU_LUT961L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT961L_EN_B_0X1         (0x1u<<0)

// LUT961H Configuration

#define GFXMMU_LUT961H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT961H_LO_0             (0x1u<<0)

// LUT962L Configuration

#define GFXMMU_LUT962L_LVB              (0xFFu<<16)
#define GFXMMU_LUT962L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT962L_FVB              (0xFFu<<8)
#define GFXMMU_LUT962L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT962L_EN               (0x1u<<0)

#define GFXMMU_LUT962L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT962L_EN_B_0X1         (0x1u<<0)

// LUT962H Configuration

#define GFXMMU_LUT962H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT962H_LO_0             (0x1u<<0)

// LUT963L Configuration

#define GFXMMU_LUT963L_LVB              (0xFFu<<16)
#define GFXMMU_LUT963L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT963L_FVB              (0xFFu<<8)
#define GFXMMU_LUT963L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT963L_EN               (0x1u<<0)

#define GFXMMU_LUT963L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT963L_EN_B_0X1         (0x1u<<0)

// LUT963H Configuration

#define GFXMMU_LUT963H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT963H_LO_0             (0x1u<<0)

// LUT964L Configuration

#define GFXMMU_LUT964L_LVB              (0xFFu<<16)
#define GFXMMU_LUT964L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT964L_FVB              (0xFFu<<8)
#define GFXMMU_LUT964L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT964L_EN               (0x1u<<0)

#define GFXMMU_LUT964L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT964L_EN_B_0X1         (0x1u<<0)

// LUT964H Configuration

#define GFXMMU_LUT964H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT964H_LO_0             (0x1u<<0)

// LUT965L Configuration

#define GFXMMU_LUT965L_LVB              (0xFFu<<16)
#define GFXMMU_LUT965L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT965L_FVB              (0xFFu<<8)
#define GFXMMU_LUT965L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT965L_EN               (0x1u<<0)

#define GFXMMU_LUT965L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT965L_EN_B_0X1         (0x1u<<0)

// LUT965H Configuration

#define GFXMMU_LUT965H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT965H_LO_0             (0x1u<<0)

// LUT966L Configuration

#define GFXMMU_LUT966L_LVB              (0xFFu<<16)
#define GFXMMU_LUT966L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT966L_FVB              (0xFFu<<8)
#define GFXMMU_LUT966L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT966L_EN               (0x1u<<0)

#define GFXMMU_LUT966L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT966L_EN_B_0X1         (0x1u<<0)

// LUT966H Configuration

#define GFXMMU_LUT966H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT966H_LO_0             (0x1u<<0)

// LUT967L Configuration

#define GFXMMU_LUT967L_LVB              (0xFFu<<16)
#define GFXMMU_LUT967L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT967L_FVB              (0xFFu<<8)
#define GFXMMU_LUT967L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT967L_EN               (0x1u<<0)

#define GFXMMU_LUT967L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT967L_EN_B_0X1         (0x1u<<0)

// LUT967H Configuration

#define GFXMMU_LUT967H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT967H_LO_0             (0x1u<<0)

// LUT968L Configuration

#define GFXMMU_LUT968L_LVB              (0xFFu<<16)
#define GFXMMU_LUT968L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT968L_FVB              (0xFFu<<8)
#define GFXMMU_LUT968L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT968L_EN               (0x1u<<0)

#define GFXMMU_LUT968L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT968L_EN_B_0X1         (0x1u<<0)

