Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_gfxmmu.h
// LUT968H Configuration

#define GFXMMU_LUT968H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT968H_LO_0             (0x1u<<0)

// LUT969L Configuration

#define GFXMMU_LUT969L_LVB              (0xFFu<<16)
#define GFXMMU_LUT969L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT969L_FVB              (0xFFu<<8)
#define GFXMMU_LUT969L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT969L_EN               (0x1u<<0)

#define GFXMMU_LUT969L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT969L_EN_B_0X1         (0x1u<<0)

// LUT969H Configuration

#define GFXMMU_LUT969H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT969H_LO_0             (0x1u<<0)

// LUT970L Configuration

#define GFXMMU_LUT970L_LVB              (0xFFu<<16)
#define GFXMMU_LUT970L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT970L_FVB              (0xFFu<<8)
#define GFXMMU_LUT970L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT970L_EN               (0x1u<<0)

#define GFXMMU_LUT970L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT970L_EN_B_0X1         (0x1u<<0)

// LUT970H Configuration

#define GFXMMU_LUT970H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT970H_LO_0             (0x1u<<0)

// LUT971L Configuration

#define GFXMMU_LUT971L_LVB              (0xFFu<<16)
#define GFXMMU_LUT971L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT971L_FVB              (0xFFu<<8)
#define GFXMMU_LUT971L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT971L_EN               (0x1u<<0)

#define GFXMMU_LUT971L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT971L_EN_B_0X1         (0x1u<<0)

// LUT971H Configuration

#define GFXMMU_LUT971H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT971H_LO_0             (0x1u<<0)

// LUT972L Configuration

#define GFXMMU_LUT972L_LVB              (0xFFu<<16)
#define GFXMMU_LUT972L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT972L_FVB              (0xFFu<<8)
#define GFXMMU_LUT972L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT972L_EN               (0x1u<<0)

#define GFXMMU_LUT972L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT972L_EN_B_0X1         (0x1u<<0)

// LUT972H Configuration

#define GFXMMU_LUT972H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT972H_LO_0             (0x1u<<0)

// LUT973L Configuration

#define GFXMMU_LUT973L_LVB              (0xFFu<<16)
#define GFXMMU_LUT973L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT973L_FVB              (0xFFu<<8)
#define GFXMMU_LUT973L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT973L_EN               (0x1u<<0)

#define GFXMMU_LUT973L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT973L_EN_B_0X1         (0x1u<<0)

// LUT973H Configuration

#define GFXMMU_LUT973H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT973H_LO_0             (0x1u<<0)

// LUT974L Configuration

#define GFXMMU_LUT974L_LVB              (0xFFu<<16)
#define GFXMMU_LUT974L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT974L_FVB              (0xFFu<<8)
#define GFXMMU_LUT974L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT974L_EN               (0x1u<<0)

#define GFXMMU_LUT974L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT974L_EN_B_0X1         (0x1u<<0)

// LUT974H Configuration

#define GFXMMU_LUT974H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT974H_LO_0             (0x1u<<0)

// LUT975L Configuration

#define GFXMMU_LUT975L_LVB              (0xFFu<<16)
#define GFXMMU_LUT975L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT975L_FVB              (0xFFu<<8)
#define GFXMMU_LUT975L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT975L_EN               (0x1u<<0)

#define GFXMMU_LUT975L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT975L_EN_B_0X1         (0x1u<<0)

// LUT975H Configuration

#define GFXMMU_LUT975H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT975H_LO_0             (0x1u<<0)

// LUT976L Configuration

#define GFXMMU_LUT976L_LVB              (0xFFu<<16)
#define GFXMMU_LUT976L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT976L_FVB              (0xFFu<<8)
#define GFXMMU_LUT976L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT976L_EN               (0x1u<<0)

#define GFXMMU_LUT976L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT976L_EN_B_0X1         (0x1u<<0)

// LUT976H Configuration

#define GFXMMU_LUT976H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT976H_LO_0             (0x1u<<0)

// LUT977L Configuration

#define GFXMMU_LUT977L_LVB              (0xFFu<<16)
#define GFXMMU_LUT977L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT977L_FVB              (0xFFu<<8)
#define GFXMMU_LUT977L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT977L_EN               (0x1u<<0)

#define GFXMMU_LUT977L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT977L_EN_B_0X1         (0x1u<<0)

// LUT977H Configuration

#define GFXMMU_LUT977H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT977H_LO_0             (0x1u<<0)

// LUT978L Configuration

#define GFXMMU_LUT978L_LVB              (0xFFu<<16)
#define GFXMMU_LUT978L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT978L_FVB              (0xFFu<<8)
#define GFXMMU_LUT978L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT978L_EN               (0x1u<<0)

#define GFXMMU_LUT978L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT978L_EN_B_0X1         (0x1u<<0)

// LUT978H Configuration

#define GFXMMU_LUT978H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT978H_LO_0             (0x1u<<0)

// LUT979L Configuration

#define GFXMMU_LUT979L_LVB              (0xFFu<<16)
#define GFXMMU_LUT979L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT979L_FVB              (0xFFu<<8)
#define GFXMMU_LUT979L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT979L_EN               (0x1u<<0)

#define GFXMMU_LUT979L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT979L_EN_B_0X1         (0x1u<<0)

// LUT979H Configuration

#define GFXMMU_LUT979H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT979H_LO_0             (0x1u<<0)

// LUT980L Configuration

#define GFXMMU_LUT980L_LVB              (0xFFu<<16)
#define GFXMMU_LUT980L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT980L_FVB              (0xFFu<<8)
#define GFXMMU_LUT980L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT980L_EN               (0x1u<<0)

