Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_gfxmmu.h
#define GFXMMU_LUT980L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT980L_EN_B_0X1         (0x1u<<0)

// LUT980H Configuration

#define GFXMMU_LUT980H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT980H_LO_0             (0x1u<<0)

// LUT981L Configuration

#define GFXMMU_LUT981L_LVB              (0xFFu<<16)
#define GFXMMU_LUT981L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT981L_FVB              (0xFFu<<8)
#define GFXMMU_LUT981L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT981L_EN               (0x1u<<0)

#define GFXMMU_LUT981L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT981L_EN_B_0X1         (0x1u<<0)

// LUT981H Configuration

#define GFXMMU_LUT981H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT981H_LO_0             (0x1u<<0)

// LUT982L Configuration

#define GFXMMU_LUT982L_LVB              (0xFFu<<16)
#define GFXMMU_LUT982L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT982L_FVB              (0xFFu<<8)
#define GFXMMU_LUT982L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT982L_EN               (0x1u<<0)

#define GFXMMU_LUT982L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT982L_EN_B_0X1         (0x1u<<0)

// LUT982H Configuration

#define GFXMMU_LUT982H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT982H_LO_0             (0x1u<<0)

// LUT983L Configuration

#define GFXMMU_LUT983L_LVB              (0xFFu<<16)
#define GFXMMU_LUT983L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT983L_FVB              (0xFFu<<8)
#define GFXMMU_LUT983L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT983L_EN               (0x1u<<0)

#define GFXMMU_LUT983L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT983L_EN_B_0X1         (0x1u<<0)

// LUT983H Configuration

#define GFXMMU_LUT983H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT983H_LO_0             (0x1u<<0)

// LUT984L Configuration

#define GFXMMU_LUT984L_LVB              (0xFFu<<16)
#define GFXMMU_LUT984L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT984L_FVB              (0xFFu<<8)
#define GFXMMU_LUT984L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT984L_EN               (0x1u<<0)

#define GFXMMU_LUT984L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT984L_EN_B_0X1         (0x1u<<0)

// LUT984H Configuration

#define GFXMMU_LUT984H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT984H_LO_0             (0x1u<<0)

// LUT985L Configuration

#define GFXMMU_LUT985L_LVB              (0xFFu<<16)
#define GFXMMU_LUT985L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT985L_FVB              (0xFFu<<8)
#define GFXMMU_LUT985L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT985L_EN               (0x1u<<0)

#define GFXMMU_LUT985L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT985L_EN_B_0X1         (0x1u<<0)

// LUT985H Configuration

#define GFXMMU_LUT985H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT985H_LO_0             (0x1u<<0)

// LUT986L Configuration

#define GFXMMU_LUT986L_LVB              (0xFFu<<16)
#define GFXMMU_LUT986L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT986L_FVB              (0xFFu<<8)
#define GFXMMU_LUT986L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT986L_EN               (0x1u<<0)

#define GFXMMU_LUT986L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT986L_EN_B_0X1         (0x1u<<0)

// LUT986H Configuration

#define GFXMMU_LUT986H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT986H_LO_0             (0x1u<<0)

// LUT987L Configuration

#define GFXMMU_LUT987L_LVB              (0xFFu<<16)
#define GFXMMU_LUT987L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT987L_FVB              (0xFFu<<8)
#define GFXMMU_LUT987L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT987L_EN               (0x1u<<0)

#define GFXMMU_LUT987L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT987L_EN_B_0X1         (0x1u<<0)

// LUT987H Configuration

#define GFXMMU_LUT987H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT987H_LO_0             (0x1u<<0)

// LUT988L Configuration

#define GFXMMU_LUT988L_LVB              (0xFFu<<16)
#define GFXMMU_LUT988L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT988L_FVB              (0xFFu<<8)
#define GFXMMU_LUT988L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT988L_EN               (0x1u<<0)

#define GFXMMU_LUT988L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT988L_EN_B_0X1         (0x1u<<0)

// LUT988H Configuration

#define GFXMMU_LUT988H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT988H_LO_0             (0x1u<<0)

// LUT989L Configuration

#define GFXMMU_LUT989L_LVB              (0xFFu<<16)
#define GFXMMU_LUT989L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT989L_FVB              (0xFFu<<8)
#define GFXMMU_LUT989L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT989L_EN               (0x1u<<0)

#define GFXMMU_LUT989L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT989L_EN_B_0X1         (0x1u<<0)

// LUT989H Configuration

#define GFXMMU_LUT989H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT989H_LO_0             (0x1u<<0)

// LUT990L Configuration

#define GFXMMU_LUT990L_LVB              (0xFFu<<16)
#define GFXMMU_LUT990L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT990L_FVB              (0xFFu<<8)
#define GFXMMU_LUT990L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT990L_EN               (0x1u<<0)

#define GFXMMU_LUT990L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT990L_EN_B_0X1         (0x1u<<0)

// LUT990H Configuration

#define GFXMMU_LUT990H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT990H_LO_0             (0x1u<<0)

// LUT991L Configuration

#define GFXMMU_LUT991L_LVB              (0xFFu<<16)
#define GFXMMU_LUT991L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT991L_FVB              (0xFFu<<8)
#define GFXMMU_LUT991L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT991L_EN               (0x1u<<0)

#define GFXMMU_LUT991L_EN_B_0X0         (0x0u<<0)
#define GFXMMU_LUT991L_EN_B_0X1         (0x1u<<0)

// LUT991H Configuration

#define GFXMMU_LUT991H_LO               (0x3FFFFu<<0)
#define GFXMMU_LUT991H_LO_0             (0x1u<<0)

// LUT992L Configuration

#define GFXMMU_LUT992L_LVB              (0xFFu<<16)
#define GFXMMU_LUT992L_LVB_0            (0x1u<<16)
#define GFXMMU_LUT992L_FVB              (0xFFu<<8)
#define GFXMMU_LUT992L_FVB_0            (0x1u<<8)
#define GFXMMU_LUT992L_EN               (0x1u<<0)

